{"English Language Arts Standards":{"Kindergarten":{"Reading: Literature":[{"title":"RL.K.1","body":" With prompting and support, ask and answer questions about key details in a text."},{"title":"RL.K.2","body":" With prompting and support, retell familiar stories, including key details."},{"title":"RL.K.3","body":" With prompting and support, identify characters, settings, and major events in a story."},{"title":"RL.K.4","body":" Ask and answer questions about unknown words in a text."},{"title":"RL.K.5","body":" Recognize common types of texts (e.g., storybooks, poems)."},{"title":"RL.K.6","body":" With prompting and support, name the author and illustrator of a story and define the role of each in telling the story."},{"title":"RL.K.7","body":" With prompting and support, describe the relationship between illustrations and the story in which they appear (e.g., what moment in a story an illustration depicts)."},{"title":"RL.K.8","body":" (Not applicable to literature)"},{"title":"RL.K.9","body":" With prompting and support, compare and contrast the adventures and experiences of characters in familiar stories."},{"title":"RL.K.10","body":" Actively engage in group reading activities with purpose and understanding."}],"Reading: Informational Text":[{"title":"RI.K.1","body":" With prompting and support, ask and answer questions about key details in a text."},{"title":"RI.K.2","body":" With prompting and support, identify the main topic and retell key details of a text."},{"title":"RI.K.3","body":" With prompting and support, describe the connection between two individuals, events, ideas, or pieces of information in a text."},{"title":"RI.K.4","body":" With prompting and support, ask and answer questions about unknown words in a text."},{"title":"RI.K.5","body":" Identify the front cover, back cover, and title page of a book."},{"title":"RI.K.6","body":" Name the author and illustrator of a text and define the role of each in presenting the ideas or information in a text."},{"title":"RI.K.7","body":" With prompting and support, describe the relationship between illustrations and the text in which they appear (e.g., what person, place, thing, or idea in the text an illustration depicts)."},{"title":"RI.K.8","body":" With prompting and support, identify the reasons an author gives to support points in a text."},{"title":"RI.K.9","body":" With prompting and support, identify basic similarities in and differences between two texts on the same topic (e.g., in illustrations, descriptions, or procedures)."},{"title":"RI.K.10","body":" Actively engage in group reading activities with purpose and understanding."}],"Reading: Foundational Skills":[{"title":"RF.K.1","body":" Demonstrate understanding of the organization and basic features of print.      <ul>          <li>Follow words from left to right, top to bottom, and page by page.<\/li>          <li>Recognize that spoken words are represented in written language by specific sequences of letters.<\/li>          <li>Understand that words are separated by spaces in print.<\/li>          <li>Recognize and name all upper- and lowercase letters of the alphabet.<\/li>      <\/ul>      "},{"title":"RF.K.2","body":" Demonstrate understanding of spoken words, syllables, and sounds (phonemes).      <ul>          <li>Recognize and produce rhyming words.<\/li>          <li>Count, pronounce, blend, and segment syllables in spoken words.<\/li>          <li>Blend and segment onsets and rimes of single-syllable spoken words.<\/li>          <li>Isolate and pronounce the initial, medial vowel, and final sounds (phonemes) in three-phoneme (consonant-vowel-consonant, or CVC) words.<sup>1<\/sup> (This does not include CVCs ending with \/l\/, \/r\/, or \/x\/.)<\/li>          <li>Add or substitute individual sounds (phonemes) in simple, one-syllable words to make new words.<\/li>      <\/ul>      "},{"title":"RF.K.3","body":" Know and apply grade-level phonics and word analysis skills in decoding words.      <ul>          <li>Demonstrate basic knowledge of letter-sound correspondences by producing the primary or most frequent sound for each consonant.<\/li>          <li>Associate the long and short sounds with the common spellings (graphemes) for the five major vowels.<\/li>          <li>Read common high-frequency words by sight (e.g., <i>the<\/i>, <i>of<\/i>, <i>to<\/i>, <i>you<\/i>, <i>she<\/i>, <i>my<\/i>, <i>is<\/i>, <i>are<\/i>, <i>do<\/i>, <i>does<\/i>).<\/li>          <li>Distinguish between similarly spelled words by identifying the sounds of the letters that differ.<\/li>      <\/ul>      "},{"title":"RF.K.4","body":" Read emergent-reader texts with purpose and understanding."}],"Writing":[{"title":"W.K.1","body":" Use a combination of drawing, dictating, and writing to compose opinion pieces in which they tell a reader the topic or the name of the book they are writing about and state an opinion or preference about the topic or book (e.g., <i>My favorite book is...<\/i>)."},{"title":"W.K.2","body":" Use a combination of drawing, dictating, and writing to compose informative\/explanatory texts in which they name what they are writing about and supply some information about the topic."},{"title":"W.K.3","body":" Use a combination of drawing, dictating, and writing to narrate a single event or several loosely linked events, tell about the events in the order in which they occurred, and provide a reaction to what happened."},{"title":"W.K.4","body":" (Begins in grade 3)"},{"title":"W.K.5","body":" With guidance and support from adults, respond to questions and suggestions from peers and add details to strengthen writing as needed."},{"title":"W.K.6","body":" With guidance and support from adults, explore a variety of digital tools to produce and publish writing, including in collaboration with peers."},{"title":"W.K.7","body":" Participate in shared research and writing projects (e.g., explore a number of books by a favorite author and express opinions about them)."},{"title":"W.K.8","body":" With guidance and support from adults, recall information from experiences or gather information from provided sources to answer a question."},{"title":"W.K.9","body":" (Begins in grade 4)"},{"title":"W.K.10","body":" (Begins in grade 3)"}],"Speaking & Listening":[{"title":"SL.K.1","body":" Participate in collaborative conversations with diverse partners about <i>kindergarten topics and texts<\/i> with peers and adults in small and larger groups.      <ul>          <li>Follow agreed-upon rules for discussions (e.g., listening to others and taking turns speaking about the topics and texts under discussion).<\/li>          <li>Continue a conversation through multiple exchanges.<\/li>      <\/ul>      "},{"title":"SL.K.2","body":" Confirm understanding of a text read aloud or information presented orally or through other media by asking and answering questions about key details and requesting clarification if something is not understood."},{"title":"SL.K.3","body":" Ask and answer questions in order to seek help, get information, or clarify something that is not understood."},{"title":"SL.K.4","body":" Describe familiar people, places, things, and events and, with prompting and support, provide additional detail."},{"title":"SL.K.5","body":" Add drawings or other visual displays to descriptions as desired to provide additional detail."},{"title":"SL.K.6","body":" Speak audibly and express thoughts, feelings, and ideas clearly."}],"Language":[{"title":"L.K.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"title":"L.K.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"title":"L.K.3","body":" (Begins in grade 2)"},{"title":"L.K.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on kindergarten reading and content."},{"title":"L.K.5","body":" With guidance and support from adults, explore word relationships and nuances in word meanings."},{"title":"L.K.6","body":" Use words and phrases acquired through conversations, reading and being read to, and responding to texts."}]},"Grade 1":{"Reading: Literature":[{"title":"RL.1.1","body":" Ask and answer questions about key details in a text."},{"title":"RL.1.2","body":" Retell stories, including key details, and demonstrate understanding of their central message or lesson."},{"title":"RL.1.3","body":" Describe characters, settings, and major events in a story, using key details."},{"title":"RL.1.4","body":" Identify words and phrases in stories or poems that suggest feelings or appeal to the senses."},{"title":"RL.1.5","body":" Explain major differences between books that tell stories and books that give information, drawing on a wide reading of a range of text types."},{"title":"RL.1.6","body":" Identify who is telling the story at various points in a text."},{"title":"RL.1.7","body":" Use illustrations and details in a story to describe its characters, setting, or events."},{"title":"RL.1.8","body":" (Not applicable to literature)"},{"title":"RL.1.9","body":" Compare and contrast the adventures and experiences of characters in stories."},{"title":"RL.1.10","body":" With prompting and support, read prose and poetry of appropriate complexity for grade 1."}],"Reading: Informational Text":[{"title":"RI.1.1","body":" Ask and answer questions about key details in a text."},{"title":"RI.1.2","body":" Identify the main topic and retell key details of a text."},{"title":"RI.1.3","body":" Describe the connection between two individuals, events, ideas, or pieces of information in a text."},{"title":"RI.1.4","body":" Ask and answer questions to help determine or clarify the meaning of words and phrases in a text."},{"title":"RI.1.5","body":" Know and use various text features (e.g., headings, tables of contents, glossaries, electronic menus, icons) to locate key facts or information in a text."},{"title":"RI.1.6","body":" Distinguish between information provided by pictures or other illustrations and information provided by the words in a text."},{"title":"RI.1.7","body":" Use the illustrations and details in a text to describe its key ideas."},{"title":"RI.1.8","body":" Identify the reasons an author gives to support points in a text."},{"title":"RI.1.9","body":" Identify basic similarities in and differences between two texts on the same topic (e.g., in illustrations, descriptions, or procedures)."},{"title":"RI.1.10","body":" With prompting and support, read informational texts appropriately complex for grade 1."}],"Reading: Foundational Skills":[{"title":"RF.1.1","body":" Demonstrate understanding of the organization and basic features of print."},{"title":"RF.1.2","body":" Demonstrate understanding of spoken words, syllables, and sounds (phonemes)."},{"title":"RF.1.3","body":" Know and apply grade-level phonics and word analysis skills in decoding words."},{"title":"RF.1.4","body":" Read with sufficient accuracy and fluency to support comprehension."}],"Writing":[{"title":"W.1.1","body":". Write opinion pieces in which they introduce the topic or name the book they are writing about, state an opinion, supply a reason for the opinion, and provide some sense of closure."},{"title":"W.1.2","body":" Write informative\/explanatory texts in which they name a topic, supply some facts about the topic, and provide some sense of closure."},{"title":"W.1.3","body":" Write narratives in which they recount two or more appropriately sequenced events, include some details regarding what happened, use temporal words to signal event order, and provide some sense of closure."},{"title":"W.1.4","body":" (Begins in grade 3)"},{"title":"W.1.5","body":" With guidance and support from adults, focus on a topic, respond to questions and suggestions from peers, and add details to strengthen writing as needed."},{"title":"W.1.6","body":" With guidance and support from adults, use a variety of digital tools to produce and publish writing, including in collaboration with peers. "},{"title":"W.1.7","body":" Participate in shared research and writing projects (e.g., explore a number of “how-to” books on a given topic and use them to write a sequence of instructions)."},{"title":"W.1.8","body":" With guidance and support from adults, recall information from experiences or gather information from provided sources to answer a question."},{"title":"W.1.9","body":" (Begins in grade 4)"},{"title":"W.1.10","body":" (Begins in grade 3)"}],"Speaking & Listening":[{"title":"SL.1.1","body":" Participate in collaborative conversations with diverse partners about <i>grade 1 topics and texts<\/i> with peers and adults in small and larger groups.      <ul>          <li>Follow agreed-upon rules for discussions (e.g., listening to others with care, speaking one at a time about the topics and texts under discussion).<\/li>          <li>Build on others&rsquo; talk in conversations by responding to the comments of others through multiple exchanges.<\/li>          <li>Ask questions to clear up any confusion about the topics and texts under discussion.<\/li>      <\/ul>      "},{"title":"SL.1.2","body":" Ask and answer questions about key details in a text read aloud or information presented orally or through other media."},{"title":"SL.1.3","body":" Ask and answer questions about what a speaker says in order to gather additional information or clarify something that is not understood."},{"title":"SL.1.4","body":" Describe people, places, things, and events with relevant details, expressing ideas and feelings clearly."},{"title":"SL.1.5","body":" Add drawings or other visual displays to descriptions when appropriate to clarify ideas, thoughts, and feelings."},{"title":"SL.1.6","body":" Produce complete sentences when appropriate to task and situation."}],"Language":[{"title":"L.1.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking.      <ul>          <li>Print all upper- and lowercase letters.<\/li>          <li>Use common, proper, and possessive nouns.<\/li>          <li>Use singular and plural nouns with matching verbs in basic sentences (e.g., He hops; We hop).<\/li>          <li>Use personal, possessive, and indefinite pronouns (e.g., I, me, my; they, them, their, anyone, everything).<\/li>          <li>Use verbs to convey a sense of past, present, and future (e.g., Yesterday I walked home; Today I walk home; Tomorrow I will walk home).<\/li>          <li>Use frequently occurring adjectives.<\/li>          <li>Use frequently occurring conjunctions (e.g., <em>and, but, or, so, because<\/em>).<\/li>          <li>Use determiners (e.g., articles, demonstratives).<\/li>          <li>Use frequently occurring prepositions (e.g., <em>during, beyond, toward<\/em>).<\/li>          <li>Produce and expand complete simple and compound declarative, interrogative, imperative, and exclamatory sentences in response to prompts.<\/li>      <\/ul>      "},{"title":"L.1.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing.      <ul>          <li>Capitalize dates and names of people.<\/li>          <li>Use end punctuation for sentences.<\/li>          <li>Use commas in dates and to separate single words in a series.<\/li>          <li>Use conventional spelling for words with common spelling patterns and for frequently occurring irregular words.<\/li>          <li>Spell untaught words phonetically, drawing on phonemic awareness and spelling conventions.<\/li>      <\/ul>      "},{"title":"L.1.3","body":" (Begins in grade 2)"},{"title":"L.1.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on <em>grade 1 reading and content<\/em>, choosing flexibly from an array of strategies.      <ul>          <li>Use sentence-level context as a clue to the meaning of a word or phrase.<\/li>          <li>Use frequently occurring affixes as a clue to the meaning of a word.<\/li>          <li>Identify frequently occurring root words (e.g., <em>look<\/em>) and their inflectional forms (e.g., <em>looks, looked, looking<\/em>).<\/li>      <\/ul>      "},{"title":"L.1.5","body":" With guidance and support from adults, demonstrate understanding of figurative language, word relationships and nuances in word meanings.      <ul>          <li>Sort words into categories (e.g., colors, clothing) to gain a sense of the concepts the categories represent.<\/li>          <li>Define words by category and by one or more key attributes (e.g., a <em>duck<\/em> is a bird that swims; a <em>tiger<\/em> is a large cat with stripes).<\/li>          <li>Identify real-life connections between words and their use (e.g., note places at home that are <em>cozy<\/em>).<\/li>          <li>Distinguish shades of meaning among verbs differing in manner (e.g., <em>look, peek, glance, stare, glare, scowl<\/em>) and adjectives differing in intensity (e.g., large, gigantic) by defining or choosing them or by acting out the meanings.<\/li>      <\/ul>      "},{"title":"L.1.6","body":" Use words and phrases acquired through conversations, reading and being read to, and responding to texts, including using frequently occurring conjunctions to signal simple relationships (e.g., <em>because<\/em>)."}]},"Grade 2":{"Reading: Literature":[{"title":"RL.2.1","body":" Ask and answer such questions as <i>who, what, where, when, why<\/i>, and <i>how<\/i> to demonstrate understanding of key details in a text."},{"title":"RL.2.2","body":" Recount stories, including fables and folktales from diverse cultures, and determine their central message, lesson, or moral."},{"title":"RL.2.3","body":" Describe how characters in a story respond to major events and challenges."},{"title":"RL.2.4","body":" Describe how words and phrases (e.g., regular beats, alliteration, rhymes, repeated lines) supply rhythm and meaning in a story, poem, or song."},{"title":"RL.2.5","body":" Describe the overall structure of a story, including describing how the beginning introduces the story and the ending concludes the action."},{"title":"RL.2.6","body":" Acknowledge differences in the points of view of characters, including by speaking in a different voice for each character when reading dialogue aloud."},{"title":"RL.2.7","body":" Use information gained from the illustrations and words in a print or digital text to demonstrate understanding of its characters, setting, or plot."},{"title":"RL.2.8","body":" (Not applicable to literature)"},{"title":"RL.2.9","body":" Compare and contrast two or more versions of the same story (e.g., Cinderella stories) by different authors or from different cultures."},{"title":"RL.2.10","body":" By the end of the year, read and comprehend literature, including stories and poetry, in the grades 2&ndash;3 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Reading: Informational Text":[{"title":"RI.2.1","body":" Ask and answer such questions as <i>who, what, where, when, why<\/i>, and <i>how<\/i> to demonstrate understanding of key details in a text."},{"title":"RI.2.2","body":" Identify the main topic of a multiparagraph text as well as the focus of specific paragraphs within the text."},{"title":"RI.2.3","body":" Describe the connection between a series of historical events, scientific ideas or concepts, or steps in technical procedures in a text."},{"title":"RI.2.4","body":" Determine the meaning of words and phrases in a text relevant to a <i>grade 2 topic or subject area<\/i>."},{"title":"RI.2.6","body":" Know and use various text features (e.g., captions, bold print, subheadings, glossaries, indexes, electronic menus, icons) to locate key facts or information in a text efficiently."},{"title":"RI.2.7","body":" Identify the main purpose of a text, including what the author wants to answer, explain, or describe."},{"title":"RI.2.7","body":" Explain how specific images (e.g., a diagram showing how a machine works) contribute to and clarify a text."},{"title":"RI.2.8","body":" Describe how reasons support specific points the author makes in a text."},{"title":"RI.2.9","body":" Compare and contrast the most important points presented by two texts on the same topic."},{"title":"RI.2.10","body":" By the end of year, read and comprehend informational texts, including history\/social studies, science, and technical texts, in the grades 2&ndash;3 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Reading: Foundational Skills":[{"title":"RF.2.3","body":" Know and apply grade-level phonics and word analysis skills in decoding words."},{"title":"RF.2.4","body":" Read with sufficient accuracy and fluency to support comprehension."}],"Writing":[{"title":"W.2.1","body":" Write opinion pieces in which they introduce the topic or book they are writing about, state an opinion, supply reasons that support the opinion, use linking words (e.g., <i>because<\/i>,<i> and<\/i>,<i> also<\/i>) to connect opinion and reasons, and provide a concluding statement or section."},{"title":"W.2.2","body":" Write informative\/explanatory texts in which they introduce a topic, use facts and definitions to develop points, and provide a concluding statement or section."},{"title":"W.2.3","body":" Write narratives in which they recount a well-elaborated event or short sequence of events, include details to describe actions, thoughts, and feelings, use temporal words to signal event order, and provide a sense of closure."},{"title":"W.2.4","body":" (Begins in grade 3)"},{"title":"W.2.5","body":" With guidance and support from adults and peers, focus on a topic and strengthen writing as needed by revising and editing."},{"title":"W.2.6","body":" With guidance and support from adults, use a variety of digital tools to produce and publish writing, including in collaboration with peers."},{"title":"W.2.7","body":" Participate in shared research and writing projects (e.g., read a number of books on a single topic to produce a report; record science observations)."},{"title":"W.2.8","body":" Recall information from experiences or gather information from provided sources to answer a question."},{"title":"W.2.9","body":" (Begins in grade 4)"},{"title":"W.2.10","body":" (Begins in grade 3)"}],"Speaking & Listening":[{"title":"SL.2.1","body":" Participate in collaborative conversations with diverse partners about <i>grade 2 topics and texts<\/i> with peers and adults in small and larger groups.      <ul>          <li>Follow agreed-upon rules for discussions (e.g., gaining the floor in respectful ways, listening to others with care, speaking one at a time about the topics and texts under discussion).<\/li>          <li>Build on others&rsquo; talk in conversations by linking their comments to the remarks of others.<\/li>          <li>Ask for clarification and further explanation as needed about the topics and texts under discussion.<\/li>      <\/ul>      "},{"title":"SL.2.2","body":" Recount or describe key ideas or details from a text read aloud or information presented orally or through other media."},{"title":"SL.2.3","body":" Ask and answer questions about what a speaker says in order to clarify comprehension, gather additional information, or deepen understanding of a topic or issue."},{"title":"SL.2.4","body":" Tell a story or recount an experience with appropriate facts and relevant, descriptive details, speaking audibly in coherent sentences."},{"title":"SL.2.5","body":" Create audio recordings of stories or poems; add drawings or other visual displays to stories or recounts of experiences when appropriate to clarify ideas, thoughts, and feelings."},{"title":"SL.2.6","body":" Produce complete sentences when appropriate to task and situation in order to provide requested detail or clarification."}],"Language":[{"title":"L.2.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"title":"L.2.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"title":"L.2.3","body":" Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"title":"L.2.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grade 2 reading and content, choosing flexibly from an array of strategies."},{"title":"L.2.5","body":" Demonstrate understanding of figurative language, word relationships and nuances in word meanings."},{"title":"L.2.6","body":" Use words and phrases acquired through conversations, reading and being read to, and responding to texts, including using adjectives and adverbs to describe (e.g., <em>When other kids are happy that makes me happy<\/em>)."}]},"Grade 3":{"Reading: Literature":[{"title":"RL.3.1","body":" Ask and answer questions to demonstrate understanding of a text, referring explicitly to the text as the basis for the answers."},{"title":"RL.3.2","body":" Recount stories, including fables, folktales, and myths from diverse cultures; determine the central message, lesson, or moral and explain how it is conveyed through key details in the text."},{"title":"RL.3.3","body":" Describe characters in a story (e.g., their traits, motivations, or feelings) and explain how their actions contribute to the sequence of events."},{"title":"RL.3.4","body":" Determine the meaning of words and phrases as they are used in a text, distinguishing literal from nonliteral language."},{"title":"RL.3.5","body":" Refer to parts of stories, dramas, and poems when writing or speaking about a text, using terms such as chapter, scene, and stanza; describe how each successive part builds on earlier sections."},{"title":"RL.3.6","body":" Distinguish their own point of view from that of the narrator or those of the characters."},{"title":"RL.3.7","body":" Explain how specific aspects of a text's illustrations contribute to what is conveyed by the words in a story (e.g., create mood, emphasize aspects of a character or setting)."},{"title":"RL.3.8","body":" (Not applicable to literature)"},{"title":"RL.3.9","body":" Compare and contrast the themes, settings, and plots of stories written by the same author about the same or similar characters (e.g., in books from a series)."},{"title":"RL.3.10","body":" By the end of the year, read and comprehend literature, including stories, dramas, and poetry, at the high end of the grades 2-3 text complexity band independently and proficiently."}],"Reading: Informational Text":[{"title":"RI.3.1","body":" Ask and answer questions to demonstrate understanding of a text, referring explicitly to the text as the basis for the answers."},{"title":"RI.3.2","body":" Determine the main idea of a text; recount the key details and explain how they support the main idea."},{"title":"RI.3.3","body":" Describe the relationship between a series of historical events, scientific ideas or concepts, or steps in technical procedures in a text, using language that pertains to time, sequence, and cause\/effect."},{"title":"RI.3.4","body":" Determine the meaning of general academic and domain-specific words and phrases in a text relevant to a <i>grade 3 topic or subject area<\/i>."},{"title":"RI.3.5","body":" Use text features and search tools (e.g., key words, sidebars, hyperlinks) to locate information relevant to a given topic efficiently."},{"title":"RI.3.6","body":" Distinguish their own point of view from that of the author of a text."},{"title":"RI.3.7","body":" Use information gained from illustrations (e.g., maps, photographs) and the words in a text to demonstrate understanding of the text (e.g., where, when, why, and how key events occur)."},{"title":"RI.3.8","body":" Describe the logical connection between particular sentences and paragraphs in a text (e.g., comparison, cause\/effect, first\/second\/third in a sequence)."},{"title":"RI.3.9","body":" Compare and contrast the most important points and key details presented in two texts on the same topic."},{"title":"RI.3.10","body":" By the end of the year, read and comprehend informational texts, including history\/social studies, science, and technical texts, at the high end of the grades 2&ndash;3 text complexity band independently and proficiently."}],"Reading: Foundational Skills":[{"title":"RF.3.3","body":" Know and apply grade-level phonics and word analysis skills in decoding words."},{"title":"RF.3.4","body":" Read with sufficient accuracy and fluency to support comprehension."}],"Writing":[{"title":"W.3.1","body":" Write opinion pieces on topics or texts, supporting a point of view with reasons.      <ul>          <li>Introduce the topic or text they are writing about, state an opinion, and create an organizational structure that lists reasons.<\/li>          <li>Provide reasons that support the opinion.<\/li>          <li>Use linking words and phrases (e.g., <i>because<\/i>, <i>therefore<\/i>, <i>since<\/i>, <i>for<\/i> <i>example<\/i>) to connect opinion and reasons.<\/li>          <li>Provide a concluding statement or section.<\/li>      <\/ul>      "},{"title":"W.3.2","body":" Write informative\/explanatory texts to examine a topic and convey ideas and information clearly.      <ul>          <li>Introduce a topic and group related information together; include illustrations when useful to aiding comprehension.<\/li>          <li>Develop the topic with facts, definitions, and details.<\/li>          <li>Use linking words and phrases (e.g., <i>also<\/i>, <i>another<\/i>, <i>and<\/i>, <i>more<\/i>, <i>but<\/i>) to connect ideas within categories of information.<\/li>          <li>Provide a concluding statement or section.<\/li>      <\/ul>      "},{"title":"W.3.3","body":" Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences.      <ul>          <li>Establish a situation and introduce a narrator and\/or characters; organize an event sequence that unfolds naturally.<\/li>          <li>Use dialogue and descriptions of actions, thoughts, and feelings to develop experiences and events or show the response of characters to situations.<\/li>          <li>Use temporal words and phrases to signal event order.<\/li>          <li>Provide a sense of closure.<\/li>      <\/ul>      "},{"title":"W.3.4","body":" With guidance and support from adults, produce writing in which the development and organization are appropriate to task and purpose. (Grade-specific expectations for writing types are defined in standards 1&ndash;3 above.)"},{"title":"W.3.5","body":" With guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, and editing."},{"title":"W.3.6","body":" With guidance and support from adults, use technology to produce and publish writing (using keyboarding skills) as well as to interact and collaborate with others."},{"title":"W.3.7","body":" Conduct short research projects that build knowledge about a topic."},{"title":"W.3.8","body":" Recall information from experiences or gather information from print and digital sources; take brief notes on sources and sort evidence into provided categories."},{"title":"W.3.9","body":" (Begins in grade 4)"},{"title":"W.3.10","body":" Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."}],"Speaking & Listening":[{"title":"SL.3.1","body":" Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on <i>grade 3 topics and texts<\/i>, building on others&rsquo; ideas and expressing their own clearly.      <ul>          <li>Come to discussions prepared, having read or studied required material; explicitly draw on that preparation and other information known about the topic to explore ideas under discussion.<\/li>          <li>Follow agreed-upon rules for discussions (e.g., gaining the floor in respectful ways, listening to others with care, speaking one at a time about the topics and texts under discussion).<\/li>          <li>Ask questions to check understanding of information presented, stay on topic, and link their comments to the remarks of others.<\/li>          <li>Explain their own ideas and understanding in light of the discussion.<\/li>      <\/ul>      "},{"title":"SL.3.2","body":" Determine the main ideas and supporting details of a text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally."},{"title":"SL.3.3","body":" Ask and answer questions about information from a speaker, offering appropriate elaboration and detail."},{"title":"SL.3.4","body":" Report on a topic or text, tell a story, or recount an experience with appropriate facts and relevant, descriptive details, speaking clearly at an understandable pace."},{"title":"SL.3.5","body":" Create engaging audio recordings of stories or poems that demonstrate fluid reading at an understandable pace; add visual displays when appropriate to emphasize or enhance certain facts or details."},{"title":"SL.3.6","body":" Speak in complete sentences when appropriate to task and situation in order to provide requested detail or clarification."}],"Language":[{"title":"L.3.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"title":"L.3.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"title":"L.3.3","body":" Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"title":"L.3.4","body":" Determine or clarify the meaning of unknown and multiple-meaning word and phrases based on grade 3 reading and content, choosing flexibly from a range of strategies."},{"title":"L.3.5","body":" Demonstrate understanding of figurative language, word relationships and nuances in word meanings."},{"title":"L.3.6","body":" Acquire and use accurately grade-appropriate conversational, general academic, and domain-specific words and phrases, including those that signal spatial and temporal relationships (e.g., <em>After dinner that night we went looking for them<\/em>)."}]},"Grade 4":{"Reading: Literature":[{"title":"RL.4.1","body":" Refer to details and examples in a text when explaining what the text says explicitly and when drawing inferences from the text."},{"title":"RL.4.2","body":" Determine a theme of a story, drama, or poem from details in the text; summarize the text."},{"title":"RL.4.3","body":" Describe in depth a character, setting, or event in a story or drama, drawing on specific details in the text (e.g., a character's thoughts, words, or actions)."},{"title":"RL.4.4","body":" Determine the meaning of words and phrases as they are used in a text, including those that allude to significant characters found in mythology (e.g., Herculean)."},{"title":"RL.4.5","body":" Explain major differences between poems, drama, and prose, and refer to the structural elements of poems (e.g., verse, rhythm, meter) and drama (e.g., casts of characters, settings, descriptions, dialogue, stage directions) when writing or speaking about a text."},{"title":"RL.4.6","body":" Compare and contrast the point of view from which different stories are narrated, including the difference between first- and third-person narrations."},{"title":"RL.4.7","body":" Make connections between the text of a story or drama and a visual or oral presentation of the text, identifying where each version reflects specific descriptions and directions in the text."},{"title":"RL.4.8","body":" (Not applicable to literature)"},{"title":"RL.4.9","body":" Compare and contrast the treatment of similar themes and topics (e.g., opposition of good and evil) and patterns of events (e.g., the quest) in stories, myths, and traditional literature from different cultures."},{"title":"RL.4.10","body":" By the end of the year, read and comprehend literature, including stories, dramas, and poetry, in the grades 4-5 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Reading: Informational Text":[{"title":"RI.4.1","body":" Refer to details and examples in a text when explaining what the text says explicitly and when drawing inferences from the text."},{"title":"RI.4.2","body":" Determine the main idea of a text and explain how it is supported by key details; summarize the text."},{"title":"RI.4.3","body":" Explain events, procedures, ideas, or concepts in a historical, scientific, or technical text, including what happened and why, based on specific information in the text."},{"title":"RI.4.4","body":" Determine the meaning of general academic and domain-specific words or phrases in a text relevant to a <i>grade 4 topic or subject area<\/i>."},{"title":"RI.4.5","body":" Describe the overall structure (e.g., chronology, comparison, cause\/effect, problem\/solution) of events, ideas, concepts, or information in a text or part of a text."},{"title":"RI.4.6","body":" Compare and contrast a firsthand and secondhand account of the same event or topic; describe the differences in focus and the information provided."},{"title":"RI.4.7","body":" Interpret information presented visually, orally, or quantitatively (e.g., in charts, graphs, diagrams, time lines, animations, or interactive elements on Web pages) and explain how the information contributes to an understanding of the text in which it appears."},{"title":"RI.4.8","body":" Explain how an author uses reasons and evidence to support particular points in a text."},{"title":"RI.4.9","body":" Integrate information from two texts on the same topic in order to write or speak about the subject knowledgeably."},{"title":"RI.4.10","body":" By the end of year, read and comprehend informational texts, including history\/social studies, science, and technical texts, in the grades 4&ndash;5 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Reading: Foundational Skills":[{"title":"RF.4.3","body":" Know and apply grade-level phonics and word analysis skills in decoding words."},{"title":"RF.4.4","body":" Read with sufficient accuracy and fluency to support comprehension."}],"Writing":[{"title":"W.4.1","body":" Write opinion pieces on topics or texts, supporting a point of view with reasons and information.      <ul>          <li>Introduce a topic or text clearly, state an opinion, and create an organizational structure in which related ideas are grouped to support the writer&rsquo;s purpose.<\/li>          <li>Provide reasons that are supported by facts and details.<\/li>          <li>Link opinion and reasons using words and phrases (e.g., f<i>or instance<\/i>, <i>in order to<\/i>, <i>in addition<\/i>).<\/li>          <li>Provide a concluding statement or section related to the opinion presented.<\/li>      <\/ul>      "},{"title":"W.4.2","body":" Write informative\/explanatory texts to examine a topic and convey ideas and information clearly.      <ul>          <li>Introduce a topic clearly and group related information in paragraphs and sections; include formatting (e.g., headings), illustrations, and multimedia when useful to aiding comprehension.<\/li>          <li>Develop the topic with facts, definitions, concrete details, quotations, or other information and examples related to the topic.<\/li>          <li>Link ideas within categories of information using words and phrases (e.g., <i>another<\/i>, <i>for example<\/i>, <i>also<\/i>, <i>because<\/i>).<\/li>          d.Use precise language and domain-specific vocabulary to inform about or explain the topic.          <li>Provide a concluding statement or section related to the information or explanation presented.<\/li>      <\/ul>      "},{"title":"W.4.3","body":" Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences.      <ul>          <li>Orient the reader by establishing a situation and introducing a narrator and\/or characters; organize an event sequence that unfolds naturally.<\/li>          <li>Use dialogue and description to develop experiences and events or show the responses of characters to situations.<\/li>          <li>Use a variety of transitional words and phrases to manage the sequence of events.<\/li>          <li>Use concrete words and phrases and sensory details to convey experiences and events precisely.<\/li>          <li>Provide a conclusion that follows from the narrated experiences or events.<\/li>      <\/ul>      "},{"title":"W.4.4","body":" Produce clear and coherent writing in which the development and organization are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1&ndash;3 above.)"},{"title":"W.4.5","body":" With guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, and editing."},{"title":"W.4.6","body":" With some guidance and support from adults, use technology, including the Internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills to type a minimum of one page in a single sitting."},{"title":"W.4.7","body":" Conduct short research projects that build knowledge through investigation of different aspects of a topic."},{"title":"W.4.8","body":" Recall relevant information from experiences or gather relevant information from print and digital sources; take notes and categorize information, and provide a list of sources."},{"title":"W.4.9","body":" Draw evidence from literary or informational texts to support analysis, reflection, and research.      <ul>          <li>Apply <i>grade 4 Reading standards<\/i> to literature (e.g., &ldquo;Describe in depth a character, setting, or event in a story or drama, drawing on specific details in the text [e.g., a character&rsquo;s thoughts, words, or actions].&rdquo;).<\/li>          <li>Apply <i>grade 4 Reading standards<\/i> to informational texts (e.g., &ldquo;Explain how an author uses reasons and evidence to support particular points in a text&rdquo;).<\/li>      <\/ul>      "},{"title":"W.4.10","body":" Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."}],"Speaking & Listening":[{"title":"SL.4.1","body":" Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on <em>grade 4 topics and texts<\/em>, building on others' ideas and expressing their own clearly."},{"title":"SL.4.2","body":" Paraphrase portions of a text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally."},{"title":"SL.4.3","body":" Identify the reasons and evidence a speaker provides to support particular points."},{"title":"SL.4.4","body":" Report on a topic or text, tell a story, or recount an experience in an organized manner, using appropriate facts and relevant, descriptive details to support main ideas or themes; speak clearly at an understandable pace."},{"title":"SL.4.5","body":" Add audio recordings and visual displays to presentations when appropriate to enhance the development of main ideas or themes."},{"title":"SL.4.6","body":" Differentiate between contexts that call for formal English (e.g., presenting ideas) and situations where informal discourse is appropriate (e.g., small-group discussion); use formal English when appropriate to task and situation."}],"Language":[{"title":"L.4.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"title":"L.4.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"title":"L.4.3","body":" Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"title":"L.4.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grade 4 reading and content, choosing flexibly from a range of strategies."},{"title":"L.4.5","body":" Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"title":"L.4.6","body":" Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases, including those that signal precise actions, emotions, or states of being (e.g., quizzed, whined, stammered) and that are basic to a particular topic (e.g., <em>wildlife, conservation,<\/em> and <em>endangered<\/em> when discussing animal preservation)."}]},"Grade 5":{"Reading: Literature":[{"title":"RL.5.1","body":" Quote accurately from a text when explaining what the text says explicitly and when drawing inferences from the text."},{"title":"RL.5.2","body":" Determine a theme of a story, drama, or poem from details in the text, including how characters in a story or drama respond to challenges or how the speaker in a poem reflects upon a topic; summarize the text."},{"title":"RL.5.3","body":" Compare and contrast two or more characters, settings, or events in a story or drama, drawing on specific details in the text (e.g., how characters interact)."},{"title":"RL.5.4","body":" Determine the meaning of words and phrases as they are used in a text, including figurative language such as metaphors and similes."},{"title":"RL.5.5","body":" Explain how a series of chapters, scenes, or stanzas fits together to provide the overall structure of a particular story, drama, or poem."},{"title":"RL.5.6","body":" Describe how a narrator's or speaker's point of view influences how events are described."},{"title":"RL.5.7","body":" Analyze how visual and multimedia elements contribute to the meaning, tone, or beauty of a text (e.g., graphic novel, multimedia presentation of fiction, folktale, myth, poem)."},{"title":"RL.5.8","body":" (Not applicable to literature)"},{"title":"RL.5.9","body":" Compare and contrast stories in the same genre (e.g., mysteries and adventure stories) on their approaches to similar themes and topics."},{"title":"RL.5.10","body":" By the end of the year, read and comprehend literature, including stories, dramas, and poetry, at the high end of the grades 4-5 text complexity band independently and proficiently."}],"Reading: Informational Text":[{"title":"RI.5.1","body":" Quote accurately from a text when explaining what the text says explicitly and when drawing inferences from the text."},{"title":"RI.5.2","body":" Determine two or more main ideas of a text and explain how they are supported by key details; summarize the text."},{"title":"RI.5.3","body":" Explain the relationships or interactions between two or more individuals, events, ideas, or concepts in a historical, scientific, or technical text based on specific information in the text."},{"title":"RI.5.4","body":" Determine the meaning of general academic and domain-specific words and phrases in a text relevant to a <i>grade 5 topic or subject area<\/i>."},{"title":"RI.5.5","body":" Compare and contrast the overall structure (e.g., chronology, comparison, cause\/effect, problem\/solution) of events, ideas, concepts, or information in two or more texts."},{"title":"RI.5.6","body":" Analyze multiple accounts of the same event or topic, noting important similarities and differences in the point of view they represent."},{"title":"RI.5.7","body":" Draw on information from multiple print or digital sources, demonstrating the ability to locate an answer to a question quickly or to solve a problem efficiently."},{"title":"RI.5.8","body":" Explain how an author uses reasons and evidence to support particular points in a text, identifying which reasons and evidence support which point(s)."},{"title":"RI.5.9","body":" Integrate information from several texts on the same topic in order to write or speak about the subject knowledgeably."},{"title":"RI.5.10","body":" By the end of the year, read and comprehend informational texts, including history\/social studies, science, and technical texts, at the high end of the grades 4&ndash;5 text complexity band independently and proficiently."}],"Reading: Foundational Skills":[{"title":"RF.5.3","body":" Know and apply grade-level phonics and word analysis skills in decoding words."},{"title":"RF.5.4","body":" Read with sufficient accuracy and fluency to support comprehension."}],"Writing":[{"title":"W.5.1","body":" Write opinion pieces on topics or texts, supporting a point of view with reasons and information.      <ul>          <li>Introduce a topic or text clearly, state an opinion, and create an organizational structure in which ideas are logically grouped to support the writer&rsquo;s purpose.<\/li>          <li>Provide logically ordered reasons that are supported by facts and details.<\/li>          <li>Link opinion and reasons using words, phrases, and clauses (e.g., <i>consequently<\/i>, <i>specifically<\/i>).<\/li>          <li>Provide a concluding statement or section related to the opinion presented.<\/li>      <\/ul>      "},{"title":"W.5.2","body":" Write informative\/explanatory texts to examine a topic and convey ideas and information clearly.      <ul>          <li>Introduce a topic clearly, provide a general observation and focus, and group related information logically; include formatting (e.g., headings), illustrations, and multimedia when useful to aiding comprehension.<\/li>          <li>Develop the topic with facts, definitions, concrete details, quotations, or other information and examples related to the topic.<\/li>          <li>Link ideas within and across categories of information using words, phrases, and clauses (e.g., <i>in<\/i> <i>contrast<\/i>, <i>especially<\/i>).<\/li>          <li>Use precise language and domain-specific vocabulary to inform about or explain the topic.<\/li>          <li>Provide a concluding statement or section related to the information or explanation presented.<\/li>      <\/ul>      "},{"title":"W.5.3","body":" Write narratives to develop real or imagined experiences or events using effective technique, descriptive details, and clear event sequences.      <ul>          <li>Orient the reader by establishing a situation and introducing a narrator and\/or characters; organize an event sequence that unfolds naturally.<\/li>          <li>Use narrative techniques, such as dialogue, description, and pacing, to develop experiences and events or show the responses of characters to situations.<\/li>          <li>Use a variety of transitional words, phrases, and clauses to manage the sequence of events.<\/li>          <li>Use concrete words and phrases and sensory details to convey experiences and events precisely.<\/li>          <li>Provide a conclusion that follows from the narrated experiences or events.<\/li>      <\/ul>      "},{"title":"W.5.4","body":" Produce clear and coherent writing in which the development and organization are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1&ndash;3 above.)"},{"title":"W.5.5","body":" With guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach."},{"title":"W.5.6","body":" With some guidance and support from adults, use technology, including the Internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills to type a minimum of two pages in a single sitting."},{"title":"W.5.7","body":" Conduct short research projects that use several sources to build knowledge through investigation of different aspects of a topic."},{"title":"W.5.8","body":" Recall relevant information from experiences or gather relevant information from print and digital sources; summarize or paraphrase information in notes and finished work, and provide a list of sources."},{"title":"W.5.9","body":" Draw evidence from literary or informational texts to support analysis, reflection, and research.      <ul>          <li>Apply <i>grade 5 Reading standards<\/i> to literature (e.g., &ldquo;Compare and contrast two or more characters, settings, or events in a story or a drama, drawing on specific details in the text [e.g., how characters interact]&rdquo;).<\/li>          <li>Apply <i>grade 5 Reading standards<\/i> to informational texts (e.g., &ldquo;Explain how an author uses reasons and evidence to support particular points in a text, identifying which reasons and evidence support which point[s]&rdquo;).<\/li>      <\/ul>      "},{"title":"W.5.10","body":" Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."}],"Speaking & Listening":[{"title":"SL.5.1","body":" Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on <em>grade 5 topics and texts<\/em>, building on others' ideas and expressing their own clearly."},{"title":"SL.5.2","body":" Summarize a written text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally."},{"title":"SL.5.3","body":" Summarize the points a speaker makes and explain how each claim is supported by reasons and evidence."},{"title":"SL.5.4","body":" Report on a topic or text or present an opinion, sequencing ideas logically and using appropriate facts and relevant, descriptive details to support main ideas or themes; speak clearly at an understandable pace."},{"title":"SL.5.5","body":" Include multimedia components (e.g., graphics, sound) and visual displays in presentations when appropriate to enhance the development of main ideas or themes."},{"title":"SL.5.6","body":" Adapt speech to a variety of contexts and tasks, using formal English when appropriate to task and situation."}],"Language":[{"title":"L.5.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking.      <ul>          <li>Explain the function of conjunctions, prepositions, and interjections in general and their function in particular sentences.<\/li>          <li>Form and use the perfect (e.g., <em>I had walked; I have walked; I will have walked<\/em>) verb tenses.<\/li>          <li>Use verb tense to convey various times, sequences, states, and conditions.<\/li>          <li>Recognize and correct inappropriate shifts in verb tense.*<\/li>          <li>Use correlative conjunctions (e.g., <em>either\/or, neither\/nor<\/em>).<\/li>      <\/ul>      "},{"title":"L.5.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing.      <ul>          <li>Use punctuation to separate items in a series.*<\/li>          <li>Use a comma to separate an introductory element from the rest of the sentence.<\/li>          <li>Use a comma to set off the words <i>yes<\/i> and <i>no<\/i> (e.g., <em>Yes, thank you<\/em>), to set off a tag question from the rest of the sentence (e.g., <em>It&rsquo;s true, isn&rsquo;t it?<\/em>), and to indicate direct address (e.g., <em>Is that you, Steve?<\/em>).<\/li>          <li>Use underlining, quotation marks, or italics to indicate titles of works.<\/li>          <li>Spell grade-appropriate words correctly, consulting references as needed.<\/li>      <\/ul>      "},{"title":"L.5.3","body":" Use knowledge of language and its conventions when writing, speaking, reading, or listening.      <ul>          <li>Expand, combine, and reduce sentences for meaning, reader\/listener interest, and style.<\/li>          <li>Compare and contrast the varieties of English (e.g., <em>dialects, registers<\/em>) used in stories, dramas, or poems.<\/li>      <\/ul>      "},{"title":"L.5.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grade 5 reading and content, choosing flexibly from a range of strategies.      <ul>          <li>Use context (e.g., cause\/effect relationships and comparisons in text) as a clue to the meaning of a word or phrase.<\/li>          <li>Use common, grade-appropriate Greek and Latin affixes and roots as clues to the meaning of a word (e.g., <em>photograph, photosynthesis<\/em>).<\/li>          <li>Consult reference materials (e.g., dictionaries, glossaries, thesauruses), both print and digital, to find the pronunciation and determine or clarify the precise meaning of key words and phrases.<\/li>      <\/ul>      "},{"title":"L.5.5","body":" Demonstrate understanding of figurative language, word relationships, and nuances in word meanings.      <ul>          <li>Interpret figurative language, including similes and metaphors, in context.<\/li>          <li>Recognize and explain the meaning of common idioms, adages, and proverbs.<\/li>          <li>Use the relationship between particular words (e.g., synonyms, antonyms, homographs) to better understand each of the words.<\/li>      <\/ul>      "},{"title":"L.5.6","body":" Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases, including those that signal contrast, addition, and other logical relationships (e.g., <em>however, although, nevertheless, similarly, moreover, in addition<\/em>)."}]},"Grade 6":{"Reading: Literature":[{"title":"RL.6.1","body":" Cite textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"title":"RL.6.2","body":" Determine a theme or central idea of a text and how it is conveyed through particular details; provide a summary of the text distinct from personal opinions or judgments."},{"title":"RL.6.3","body":" Describe how a particular story's or drama's plot unfolds in a series of episodes as well as how the characters respond or change as the plot moves toward a resolution."},{"title":"RL.6.4","body":" Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of a specific word choice on meaning and tone."},{"title":"RL.6.5","body":" Analyze how a particular sentence, chapter, scene, or stanza fits into the overall structure of a text and contributes to the development of the theme, setting, or plot."},{"title":"RL.6.6","body":" Explain how an author develops the point of view of the narrator or speaker in a text."},{"title":"RL.6.7","body":" Compare and contrast the experience of reading a story, drama, or poem to listening to or viewing an audio, video, or live version of the text, including contrasting what they “see” and “hear” when reading the text to what they perceive when they listen or watch."},{"title":"RL.6.8","body":" (Not applicable to literature)"},{"title":"RL.6.9","body":" Compare and contrast texts in different forms or genres (e.g., stories and poems; historical novels and fantasy stories) in terms of their approaches to similar themes and topics."},{"title":"RL.6.10","body":" By the end of the year, read and comprehend literature, including stories, dramas, and poems, in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Reading: Informational Text":[{"title":"RI.6.1","body":" Cite textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"title":"RI.6.2","body":" Determine a central idea of a text and how it is conveyed through particular details; provide a summary of the text distinct from personal opinions or judgments."},{"title":"RI.6.3","body":" Analyze in detail how a key individual, event, or idea is introduced, illustrated, and elaborated in a text (e.g., through examples or anecdotes)."},{"title":"RI.6.4","body":" Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings."},{"title":"RI.6.5","body":" Analyze how a particular sentence, paragraph, chapter, or section fits into the overall structure of a text and contributes to the development of the ideas."},{"title":"RI.6.6","body":" Determine an author's point of view or purpose in a text and explain how it is conveyed in the text."},{"title":"RI.6.7","body":" Integrate information presented in different media or formats (e.g., visually, quantitatively) as well as in words to develop a coherent understanding of a topic or issue."},{"title":"RI.6.8","body":" Trace and evaluate the argument and specific claims in a text, distinguishing claims that are supported by reasons and evidence from claims that are not."},{"title":"RI.6.9","body":" Compare and contrast one author's presentation of events with that of another (e.g., a memoir written by and a biography on the same person)."},{"title":"RI.6.10","body":" By the end of the year, read and comprehend literary nonfiction in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Writing":[{"title":"W.6.1","body":" Write arguments to support claims with clear reasons and relevant evidence.      <ul>          <li>Introduce claim(s) and organize the reasons and evidence clearly.<\/li>          <li>Support claim(s) with clear reasons and relevant evidence, using credible sources and demonstrating an understanding of the topic or text.<\/li>          <li>Use words, phrases, and clauses to clarify the relationships among claim(s) and reasons.<\/li>          <li>Establish and maintain a formal style.<\/li>          <li>Provide a concluding statement or section that follows from the argument presented.<\/li>      <\/ul>      "},{"title":"W.6.2","body":" Write informative\/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content.      <ul>          <li>Introduce a topic; organize ideas, concepts, and information, using strategies such as definition, classification, comparison\/contrast, and cause\/effect; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension.<\/li>          <li>Develop the topic with relevant facts, definitions, concrete details, quotations, or other information and examples.<\/li>          <li>Use appropriate transitions to clarify the relationships among ideas and concepts.<\/li>          <li>Use precise language and domain-specific vocabulary to inform about or explain the topic.<\/li>          <li>Establish and maintain a formal style.<\/li>          <li>Provide a concluding statement or section that follows from the information or explanation presented.<\/li>      <\/ul>      "},{"title":"W.6.3","body":" Write narratives to develop real or imagined experiences or events using effective technique, relevant descriptive details, and well-structured event sequences.      <ul>          <li>Engage and orient the reader by establishing a context and introducing a narrator and\/or characters; organize an event sequence that unfolds naturally and logically.<\/li>          <li>Use narrative techniques, such as dialogue, pacing, and description, to develop experiences, events, and\/or characters.<\/li>          <li>Use a variety of transition words, phrases, and clauses to convey sequence and signal shifts from one time frame or setting to another.<\/li>          <li>Use precise words and phrases, relevant descriptive details, and sensory language to convey experiences and events.<\/li>          <li>Provide a conclusion that follows from the narrated experiences or events.<\/li>      <\/ul>      "},{"title":"W.6.4","body":" Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1&ndash;3 above.)"},{"title":"W.6.5","body":" With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach."},{"title":"W.6.6","body":" Use technology, including the Internet, to produce and publish writing as well as to interact and collaborate with others; demonstrate sufficient command of keyboarding skills to type a minimum of three pages in a single sitting."},{"title":"W.6.7","body":" Conduct short research projects to answer a question, drawing on several sources and refocusing the inquiry when appropriate."},{"title":"W.6.8","body":" Gather relevant information from multiple print and digital sources; assess the credibility of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and providing basic bibliographic information for sources."},{"title":"W.6.9","body":" Draw evidence from literary or informational texts to support analysis, reflection, and research.      <ul>          <li>Apply <i>grade 6 Reading standards<\/i> to literature (e.g., &ldquo;Compare and contrast texts in different forms or genres [e.g., stories and poems; historical novels and fantasy stories] in terms of their approaches to similar themes and topics&rdquo;).<\/li>          <li>Apply <i>grade 6 Reading standards<\/i> to literary nonfiction (e.g., &ldquo;Trace and evaluate the argument and specific claims in a text, distinguishing claims that are supported by reasons and evidence from claims that are not&rdquo;).<\/li>      <\/ul>      "},{"title":"W.6.10","body":" Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."}],"Speaking & Listening":[{"title":"SL.6.1","body":" Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 6 topics, texts, and issues, building on others' ideas and expressing their own clearly."},{"title":"SL.6.2","body":" Interpret information presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how it contributes to a topic, text, or issue under study."},{"title":"SL.6.3","body":" Delineate a speaker's argument and specific claims, distinguishing claims that are supported by reasons and evidence from claims that are not."},{"title":"SL.6.4","body":" Present claims and findings, sequencing ideas logically and using pertinent descriptions, facts, and details to accentuate main ideas or themes; use appropriate eye contact, adequate volume, and clear pronunciation."},{"title":"SL.6.5","body":". Include multimedia components (e.g., graphics, images, music, sound) and visual displays in presentations to clarify information."},{"title":"SL.6.6","body":" Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate."}],"Language":[{"title":"L.6.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"title":"L.6.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"title":"L.6.3","body":" Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"title":"L.6.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on grade 6 reading and content, choosing flexibly from a range of strategies."},{"title":"L.6.5","body":" Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"title":"L.6.6","body":" Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases; gather vocabulary knowledge when considering a word or phrase important to comprehension or expression."}]},"Grade 7":{"Reading: Literature":[{"title":"RL.7.1","body":" Cite several pieces of textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"title":"RL.7.2","body":" Determine a theme or central idea of a text and analyze its development over the course of the text; provide an objective summary of the text."},{"title":"RL.7.3","body":" Analyze how particular elements of a story or drama interact (e.g., how setting shapes the characters or plot)."},{"title":"RL.7.4","body":" Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of rhymes and other repetitions of sounds (e.g., alliteration) on a specific verse or stanza of a poem or section of a story or drama. "},{"title":"RL.7.5","body":". Analyze how a drama's or poem's form or structure (e.g., soliloquy, sonnet) contributes to its meaning."},{"title":"RL.7.6","body":" Analyze how an author develops and contrasts the points of view of different characters or narrators in a text."},{"title":"RL.7.7","body":" Compare and contrast a written story, drama, or poem to its audio, filmed, staged, or multimedia version, analyzing the effects of techniques unique to each medium (e.g., lighting, sound, color, or camera focus and angles in a film). "},{"title":"RL.7.8","body":" (Not applicable to literature)"},{"title":"RL.7.9","body":" Compare and contrast a fictional portrayal of a time, place, or character and a historical account of the same period as a means of understanding how authors of fiction use or alter history."},{"title":"RL.7.10","body":" By the end of the year, read and comprehend literature, including stories, dramas, and poems, in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Reading: Informational Text":[{"title":"RI.7.1","body":" Cite several pieces of textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"title":"RI.7.2","body":" Determine two or more central ideas in a text and analyze their development over the course of the text; provide an objective summary of the text."},{"title":"RI.7.3","body":" Analyze the interactions between individuals, events, and ideas in a text (e.g., how ideas influence individuals or events, or how individuals influence ideas or events)."},{"title":"RI.7.4","body":" Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the impact of a specific word choice on meaning and tone."},{"title":"RI.7.5","body":" Analyze the structure an author uses to organize a text, including how the major sections contribute to the whole and to the development of the ideas."},{"title":"RI.7.6","body":" Determine an author's point of view or purpose in a text and analyze how the author distinguishes his or her position from that of others."},{"title":"RI.7.7","body":" Compare and contrast a text to an audio, video, or multimedia version of the text, analyzing each medium's portrayal of the subject (e.g., how the delivery of a speech affects the impact of the words)."},{"title":"RI.7.8","body":" Trace and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient to support the claims."},{"title":"RI.7.9","body":" Analyze how two or more authors writing about the same topic shape their presentations of key information by emphasizing different evidence or advancing different interpretations of facts."},{"title":"RI.7.10","body":" By the end of the year, read and comprehend literary nonfiction in the grades 6-8 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Writing":[{"title":"W.7.1","body":" Write arguments to support claims with clear reasons and relevant evidence.      <ul>          <li>Introduce claim(s), acknowledge alternate or opposing claims, and organize the reasons and evidence logically.<\/li>          <li>Support claim(s) with logical reasoning and relevant evidence, using accurate, credible sources and demonstrating an understanding of the topic or text.<\/li>          <li>Use words, phrases, and clauses to create cohesion and clarify the relationships among claim(s), reasons, and evidence.<\/li>          <li>Establish and maintain a formal style.<\/li>          <li>Provide a concluding statement or section that follows from and supports the argument presented.<\/li>      <\/ul>      "},{"title":"W.7.2","body":" Write informative\/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content.      <ul>          <li>Introduce a topic clearly, previewing what is to follow; organize ideas, concepts, and information, using strategies such as definition, classification, comparison\/contrast, and cause\/effect; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension.<\/li>          <li>Develop the topic with relevant facts, definitions, concrete details, quotations, or other information and examples.<\/li>          <li>Use appropriate transitions to create cohesion and clarify the relationships among ideas and concepts.<\/li>          <li>Use precise language and domain-specific vocabulary to inform about or explain the topic.<\/li>          <li>Establish and maintain a formal style.<\/li>          <li>Provide a concluding statement or section that follows from and supports the information or explanation presented.<\/li>      <\/ul>      "},{"title":"W.7.3","body":" Write narratives to develop real or imagined experiences or events using effective technique, relevant descriptive details, and well-structured event sequences.      <ul>          <li>Engage and orient the reader by establishing a context and point of view and introducing a narrator and\/or characters; organize an event sequence that unfolds naturally and logically.<\/li>          <li>Use narrative techniques, such as dialogue, pacing, and description, to develop experiences, events, and\/or characters.<\/li>          <li>Use a variety of transition words, phrases, and clauses to convey sequence and signal shifts from one time frame or setting to another.<\/li>          <li>Use precise words and phrases, relevant descriptive details, and sensory language to capture the action and convey experiences and events.<\/li>          <li>Provide a conclusion that follows from and reflects on the narrated experiences or events.<\/li>      <\/ul>      "},{"title":"W.7.4","body":" Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1&ndash;3 above.)"},{"title":"W.7.5","body":" With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on how well purpose and audience have been addressed."},{"title":"W.7.6","body":" Use technology, including the Internet, to produce and publish writing and link to and cite sources as well as to interact and collaborate with others, including linking to and citing sources."},{"title":"W.7.7","body":" Conduct short research projects to answer a question, drawing on several sources and generating additional related, focused questions for further research and investigation."},{"title":"W.7.8","body":" Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation."},{"title":"W.7.9","body":" Draw evidence from literary or informational texts to support analysis, reflection, and research.      <ul>          <li>Apply <i>grade 7 Reading standards<\/i> to literature (e.g., &ldquo;Compare and contrast a fictional portrayal of a time, place, or character and a historical account of the same period as a means of understanding how authors of fiction use or alter history&rdquo;).<\/li>          <li>Apply <i>grade 7 Reading standards<\/i> to literary nonfiction (e.g. &ldquo;Trace and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient to support the claims&rdquo;).<\/li>      <\/ul>      "},{"title":"W.7.10","body":" Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."}],"Speaking & Listening":[{"title":"SL.7.1","body":" Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 7 topics, texts, and issues, building on others' ideas and expressing their own clearly."},{"title":"SL.7.2","body":" Analyze the main ideas and supporting details presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how the ideas clarify a topic, text, or issue under study."},{"title":"SL.7.3","body":" Delineate a speaker's argument and specific claims, evaluating the soundness of the reasoning and the relevance and sufficiency of the evidence."},{"title":"SL.7.4","body":" Present claims and findings, emphasizing salient points in a focused, coherent manner with pertinent descriptions, facts, details, and examples; use appropriate eye contact, adequate volume, and clear pronunciation."},{"title":"SL.7.5","body":" Include multimedia components and visual displays in presentations to clarify claims and findings and emphasize salient points."},{"title":"SL.7.6","body":" Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate."}],"Language":[{"title":"L.7.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"title":"L.7.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"title":"L.7.3","body":" Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"title":"L.7.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on <em>grade 7 reading and content<\/em>, choosing flexibly from a range of strategies."},{"title":"L.7.5","body":" Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"title":"L.7.6","body":" Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases; gather vocabulary knowledge when considering a word or phrase important to comprehension or expression."}]},"Grade 8":{"Reading: Literature":[{"title":"RL.8.1","body":" Cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text."},{"title":"RL.8.2","body":" Determine a theme or central idea of a text and analyze its development over the course of the text, including its relationship to the characters, setting, and plot; provide an objective summary of the text."},{"title":"RL.8.3","body":" Analyze how particular lines of dialogue or incidents in a story or drama propel the action, reveal aspects of a character, or provoke a decision."},{"title":"RL.8.4","body":" Determine the meaning of words and phrases as they are used in a text, including figurative and connotative meanings; analyze the impact of specific word choices on meaning and tone, including analogies or allusions to other texts."},{"title":"RL.8.5","body":" Compare and contrast the structure of two or more texts and analyze how the differing structure of each text contributes to its meaning and style."},{"title":"RL.8.6","body":" Analyze how differences in the points of view of the characters and the audience or reader (e.g., created through the use of dramatic irony) create such effects as suspense or humor."},{"title":"RL.8.7","body":" Analyze the extent to which a filmed or live production of a story or drama stays faithful to or departs from the text or script, evaluating the choices made by the director or actors."},{"title":"RL.8.8","body":" (Not applicable to literature)"},{"title":"RL.8.9","body":" Analyze how a modern work of fiction draws on themes, patterns of events, or character types from myths, traditional stories, or religious works such as the Bible, including describing how the material is rendered new."},{"title":"RL.8.10","body":" By the end of the year, read and comprehend literature, including stories, dramas, and poems, at the high end of grades 6-8 text complexity band independently and proficiently."}],"Reading: Informational Text":[{"title":"RI.8.1","body":" Cite the textual evidence that most strongly supports an analysis of what the text says explicitly as well as inferences drawn from the text."},{"title":"RI.8.2","body":" Determine a central idea of a text and analyze its development over the course of the text, including its relationship to supporting ideas; provide an objective summary of the text."},{"title":"RI.8.3","body":" Analyze how a text makes connections among and distinctions between individuals, ideas, or events (e.g., through comparisons, analogies, or categories)."},{"title":"RI.8.4","body":" Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the impact of specific word choices on meaning and tone, including analogies or allusions to other texts."},{"title":"RI.8.5","body":" Analyze in detail the structure of a specific paragraph in a text, including the role of particular sentences in developing and refining a key concept."},{"title":"RI.8.6","body":" Determine an author's point of view or purpose in a text and analyze how the author acknowledges and responds to conflicting evidence or viewpoints. "},{"title":"RI.8.7","body":" Evaluate the advantages and disadvantages of using different mediums (e.g., print or digital text, video, multimedia) to present a particular topic or idea."},{"title":"RI.8.8","body":" Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient; recognize when irrelevant evidence is introduced."},{"title":"RI.8.9","body":" Analyze a case in which two or more texts provide conflicting information on the same topic and identify where the texts disagree on matters of fact or interpretation."},{"title":"RI.8.10","body":" By the end of the year, read and comprehend literary nonfiction at the high end of the grades 6-8 text complexity band independently and proficiently."}],"Writing":[{"title":"W.8.1","body":" Write arguments to support claims with clear reasons and relevant evidence.      <ul>          <li>Introduce claim(s), acknowledge and distinguish the claim(s) from alternate or opposing claims, and organize the reasons and evidence logically.<\/li>          <li>Support claim(s) with logical reasoning and relevant evidence, using accurate, credible sources and demonstrating an understanding of the topic or text.<\/li>          <li>Use words, phrases, and clauses to create cohesion and clarify the relationships among claim(s), counterclaims, reasons, and evidence.<\/li>          <li>Establish and maintain a formal style.<\/li>          <li>Provide a concluding statement or section that follows from and supports the argument presented.<\/li>      <\/ul>      "},{"title":"W.8.2","body":" Write informative\/explanatory texts to examine a topic and convey ideas, concepts, and information through the selection, organization, and analysis of relevant content.      <ul>          <li>Introduce a topic clearly, previewing what is to follow; organize ideas, concepts, and information into broader categories; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension.<\/li>          <li>Develop the topic with relevant, well-chosen facts, definitions, concrete details, quotations, or other information and examples.<\/li>          <li>Use appropriate and varied transitions to create cohesion and clarify the relationships among ideas and concepts.<\/li>          <li>Use precise language and domain-specific vocabulary to inform about or explain the topic.<\/li>          <li>Establish and maintain a formal style.<\/li>          <li>Provide a concluding statement or section that follows from and supports the information or explanation presented.<\/li>      <\/ul>      "},{"title":"W.8.3","body":" Write narratives to develop real or imagined experiences or events using effective technique, relevant descriptive details, and well-structured event sequences.      <ul>          <li>Engage and orient the reader by establishing a context and point of view and introducing a narrator and\/or characters; organize an event sequence that unfolds naturally and logically.<\/li>          <li>Use narrative techniques, such as dialogue, pacing, description, and reflection, to develop experiences, events, and\/or characters.<\/li>          <li>Use a variety of transition words, phrases, and clauses to convey sequence, signal shifts from one time frame or setting to another, and show the relationships among experiences and events.<\/li>          <li>Use precise words and phrases, relevant descriptive details, and sensory language to capture the action and convey experiences and events.<\/li>          <li>Provide a conclusion that follows from and reflects on the narrated experiences or events.<\/li>      <\/ul>      "},{"title":"W.8.4","body":" Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1&ndash;3 above.)"},{"title":"W.8.5","body":" With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on how well purpose and audience have been addressed."},{"title":"W.8.6","body":" Use technology, including the Internet, to produce and publish writing and present the relationships between information and ideas efficiently as well as to interact and collaborate with others."},{"title":"W.8.7","body":" Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration."},{"title":"W.8.8","body":" Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation."},{"title":"W.8.9","body":" Draw evidence from literary or informational texts to support analysis, reflection, and research.      <ul>          <li>Apply <i>grade 8 Reading standards<\/i> to literature (e.g., &ldquo;Analyze how a modern work of fiction draws on themes, patterns of events, or character types from myths, traditional stories, or religious works such as the Bible, including describing how the material is rendered new&rdquo;).<\/li>          <li>Apply <i>grade 8 Reading standards<\/i> to literary nonfiction (e.g., &ldquo;Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient; recognize when irrelevant evidence is introduced&rdquo;).<\/li>      <\/ul>      "},{"title":"W.8.10","body":" Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two."}],"Speaking & Listening":[{"title":"SL.8.1","body":" Engage effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grade 8 topics, texts, and issues, building on others' ideas and expressing their own clearly."},{"title":"SL.8.2","body":" Analyze the purpose of information presented in diverse media and formats (e.g., visually, quantitatively, orally) and evaluate the motives (e.g., social, commercial, political) behind its presentation."},{"title":"SL.8.3","body":" Delineate a speaker's argument and specific claims, evaluating the soundness of the reasoning and relevance and sufficiency of the evidence and identifying when irrelevant evidence is introduced. "},{"title":"SL.8.4","body":" Present claims and findings, emphasizing salient points in a focused, coherent manner with relevant evidence, sound valid reasoning, and well-chosen details; use appropriate eye contact, adequate volume, and clear pronunciation."},{"title":"SL.8.5","body":" Integrate multimedia and visual displays into presentations to clarify information, strengthen claims and evidence, and add interest."},{"title":"SL.8.6","body":" Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate."}],"Language":[{"title":"L.8.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"title":"L.8.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"title":"L.8.3","body":" Use knowledge of language and its conventions when writing, speaking, reading, or listening."},{"title":"L.8.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words or phrases based on <em>grade 8 reading and content<\/em>, choosing flexibly from a range of strategies."},{"title":"L.8.5","body":" Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"title":"L.8.6","body":" Acquire and use accurately grade-appropriate general academic and domain-specific words and phrases; gather vocabulary knowledge when considering a word or phrase important to comprehension or expression."}]},"Grade 9-10":{"Reading: Literature":[{"title":"RL.9-10.1","body":" Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text. "},{"title":"RL.9-10.2","body":" Determine a theme or central idea of a text and analyze in detail its development over the course of the text, including how it emerges and is shaped and refined by specific details; provide an objective summary of the text."},{"title":"RL.9-10.3","body":" Analyze how complex characters (e.g., those with multiple or conflicting motivations) develop over the course of a text, interact with other characters, and advance the plot or develop the theme."},{"title":"RL.9-10.4","body":" Determine the meaning of words and phrases as they are used in the text, including figurative and connotative meanings; analyze the cumulative impact of specific word choices on meaning and tone (e.g., how the language evokes a sense of time and place; how it sets a formal or informal tone)."},{"title":"RL.9-10.5","body":" Analyze how an author's choices concerning how to structure a text, order events within it (e.g., parallel plots), and manipulate time (e.g., pacing, flashbacks) create such effects as mystery, tension, or surprise."},{"title":"RL.9-10.6","body":" Analyze a particular point of view or cultural experience reflected in a work of literature from outside the United States, drawing on a wide reading of world literature. "},{"title":"RL.9-10.7","body":" Analyze the representation of a subject or a key scene in two different artistic mediums, including what is emphasized or absent in each treatment (e.g., Auden's “Musée des Beaux Arts” and Breughel's Landscape with the Fall of Icarus)."},{"title":"RL.9-10.8","body":" (Not applicable to literature)"},{"title":"RL.9-10.9","body":" Analyze how an author draws on and transforms source material in a specific work (e.g., how Shakespeare treats a theme or topic from Ovid or the Bible or how a later author draws on a play by Shakespeare)."},{"title":"RL.9-10.10","body":" By the end of grade 9, read and comprehend literature, including stories, dramas, and poems, in the grades 9-10 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Reading: Informational Text":[{"title":"RI.9-10.1","body":" Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text."},{"title":"RI.9-10.2","body":" Determine a central idea of a text and analyze its development over the course of the text, including how it emerges and is shaped and refined by specific details; provide an objective summary of the text."},{"title":"RI.9-10.3","body":" Analyze how the author unfolds an analysis or series of ideas or events, including the order in which the points are made, how they are introduced and developed, and the connections that are drawn between them."},{"title":"RI.9-10.4","body":" Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze the cumulative impact of specific word choices on meaning and tone (e.g., how the language of a court opinion differs from that of a newspaper)."},{"title":"RI.9-10.5","body":" Analyze in detail how an author's ideas or claims are developed and refined by particular sentences, paragraphs, or larger portions of a text (e.g., a section or chapter)."},{"title":"RI.9-10.6","body":" Determine an author's point of view or purpose in a text and analyze how an author uses rhetoric to advance that point of view or purpose. "},{"title":"RI.9-10.7","body":" Analyze various accounts of a subject told in different mediums (e.g., a person's life story in both print and multimedia), determining which details are emphasized in each account."},{"title":"RI.9-10.8","body":" Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is valid and the evidence is relevant and sufficient; identify false statements and fallacious reasoning."},{"title":"RI.9-10.9","body":" Analyze seminal U.S. documents of historical and literary significance (e.g., Washington's Farewell Address, the Gettysburg Address, Roosevelt's Four Freedoms speech, King's “Letter from Birmingham Jail”), including how they address related themes and concepts."},{"title":"RI.9-10.10","body":" By the end of grade 9, read and comprehend literary nonfiction in the grades 9-10 text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Writing":[{"title":"W.9-10.1","body":" Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence.      <ul>          <li>Introduce precise claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that establishes clear relationships among claim(s), counterclaims, reasons, and evidence.<\/li>          <li>Develop claim(s) and counterclaims fairly, supplying evidence for each while pointing out the strengths and limitations of both in a manner that anticipates the audience&rsquo;s knowledge level and concerns.<\/li>          <li>Use words, phrases, and clauses to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims.<\/li>          <li>Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.<\/li>          <li>Provide a concluding statement or section that follows from and supports the argument presented.<\/li>      <\/ul>      "},{"title":"W.9-10.2","body":" Write informative\/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content.      <ul>          <li>Introduce a topic; organize complex ideas, concepts, and information to make important connections and distinctions; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.<\/li>          <li>Develop the topic with well-chosen, relevant, and sufficient facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience&rsquo;s knowledge of the topic.<\/li>          <li>Use appropriate and varied transitions to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas and concepts.<\/li>          <li>Use precise language and domain-specific vocabulary to manage the complexity of the topic.<\/li>          <li>Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.<\/li>          <li>Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic).<\/li>      <\/ul>      "},{"title":"W.9-10.3","body":" Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences.      <ul>          <li>Engage and orient the reader by setting out a problem, situation, or observation, establishing one or multiple point(s) of view, and introducing a narrator and\/or characters; create a smooth progression of experiences or events.<\/li>          <li>Use narrative techniques, such as dialogue, pacing, description, reflection, and multiple plot lines, to develop experiences, events, and\/or characters.<\/li>          <li>Use a variety of techniques to sequence events so that they build on one another to create a coherent whole.<\/li>          <li>Use precise words and phrases, telling details, and sensory language to convey a vivid picture of the experiences, events, setting, and\/or characters.<\/li>          <li>Provide a conclusion that follows from and reflects on what is experienced, observed, or resolved over the course of the narrative.<\/li>      <\/ul>      "},{"title":"W.9-10.4","body":" Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1&ndash;3 above.)"},{"title":"W.9-10.5","body":" Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience."},{"title":"W.9-10.6","body":" Use technology, including the Internet, to produce, publish, and update individual or shared writing products, taking advantage of technology&rsquo;s capacity to link to other information and to display information flexibly and dynamically."},{"title":"W.9-10.7","body":" Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation."},{"title":"W.9-10.8","body":" Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the usefulness of each source in answering the research question; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and following a standard format for citation."},{"title":"W.9-10.9","body":" Draw evidence from literary or informational texts to support analysis, reflection, and research.      <ul>          <li>Apply <i>grades 9&ndash;10 Reading standards<\/i> to literature (e.g., &ldquo;Analyze how an author draws on and transforms source material in a specific work [e.g., how Shakespeare treats a theme or topic from Ovid or the Bible or how a later author draws on a play by Shakespeare]&rdquo;).<\/li>          <li>Apply <i>grades 9&ndash;10 Reading standards<\/i> to literary nonfiction (e.g., &ldquo;Delineate and evaluate the argument and specific claims in a text, assessing whether the reasoning is valid and the evidence is relevant and sufficient; identify false statements and fallacious reasoning&rdquo;).<\/li>      <\/ul>      "},{"title":"W.9-10.10","body":" Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences."}],"Speaking & Listening":[{"title":"SL.9-10.1","body":" Initiate and participate effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grades 9-10 topics, texts, and issues, building on others' ideas and expressing their own clearly and persuasively."},{"title":"SL.9-10.2","body":" Integrate multiple sources of information presented in diverse media or formats (e.g., visually, quantitatively, orally) evaluating the credibility and accuracy of each source. "},{"title":"SL.9-10.3","body":" Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric, identifying any fallacious reasoning or exaggerated or distorted evidence."},{"title":"SL.9-10.4","body":" Present information, findings, and supporting evidence clearly, concisely, and logically such that listeners can follow the line of reasoning and the organization, development, substance, and style are appropriate to purpose, audience, and task."},{"title":"SL.9-10.5","body":" Make strategic use of digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations to enhance understanding of findings, reasoning, and evidence and to add interest."},{"title":"SL.9-10.6","body":" Adapt speech to a variety of contexts and tasks, demonstrating command of formal English when indicated or appropriate."}],"Language":[{"title":"L.9-10.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"title":"L.9-10.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"title":"L.9-10.3","body":" Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."},{"title":"L.9-10.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on <em>grades 9-10 reading and content<\/em>, choosing flexibly from a range of strategies."},{"title":"L.9-10.5","body":" Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"title":"L.9-10.6","body":" Acquire and use accurately general academic and domain-specific words and phrases, sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression."}]},"Grade 11-12":{"Reading: Literature":[{"title":"RL.11-12.1","body":" Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text, including determining where the text leaves matters uncertain."},{"title":"RL.11-12.2","body":" Determine two or more themes or central ideas of a text and analyze their development over the course of the text, including how they interact and build on one another to produce a complex account; provide an objective summary of the text. "},{"title":"RL.11-12.3","body":" Analyze the impact of the author's choices regarding how to develop and relate elements of a story or drama (e.g., where a story is set, how the action is ordered, how the characters are introduced and developed)."},{"title":"RL.11-12.4","body":" Determine the meaning of words and phrases as they are used in the text, including figurative and connotative meanings; analyze the impact of specific word choices on meaning and tone, including words with multiple meanings or language that is particularly fresh, engaging, or beautiful. (Include Shakespeare as well as other authors.)"},{"title":"RL.11-12.5","body":" Analyze how an author's choices concerning how to structure specific parts of a text (e.g., the choice of where to begin or end a story, the choice to provide a comedic or tragic resolution) contribute to its overall structure and meaning as well as its aesthetic impact. "},{"title":"RL.11-12.6","body":" Analyze a case in which grasping a point of view requires distinguishing what is directly stated in a text from what is really meant (e.g., satire, sarcasm, irony, or understatement). "},{"title":"RL.11-12.7","body":" Analyze multiple interpretations of a story, drama, or poem (e.g., recorded or live production of a play or recorded novel or poetry), evaluating how each version interprets the source text. (Include at least one play by Shakespeare and one play by an American dramatist.)"},{"title":"RL.11-12.8","body":" (Not applicable to literature)"},{"title":"RL.11-12.9","body":" Demonstrate knowledge of eighteenth-, nineteenth- and early-twentieth-century foundational works of American literature, including how two or more texts from the same period treat similar themes or topics.  "},{"title":"RL.11-12.10","body":" By the end of grade 11, read and comprehend literature, including stories, dramas, and poems, in the grades 11-CCR text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Reading: Informational Text":[{"title":"RI.11-12.1","body":" Cite strong and thorough textual evidence to support analysis of what the text says explicitly as well as inferences drawn from the text, including determining where the text leaves matters uncertain."},{"title":"RI.11-12.2","body":" Determine two or more central ideas of a text and analyze their development over the course of the text, including how they interact and build on one another to provide a complex analysis; provide an objective summary of the text."},{"title":"RI.11-12.3","body":" Analyze a complex set of ideas or sequence of events and explain how specific individuals, ideas, or events interact and develop over the course of the text."},{"title":"RI.11-12.4","body":" Determine the meaning of words and phrases as they are used in a text, including figurative, connotative, and technical meanings; analyze how an author uses and refines the meaning of a key term or terms over the course of a text (e.g., how Madison defines faction in Federalist No. 10)."},{"title":"RI.11-12.5","body":" Analyze and evaluate the effectiveness of the structure an author uses in his or her exposition or argument, including whether the structure makes points clear, convincing, and engaging."},{"title":"RI.11-12.6","body":" Determine an author's point of view or purpose in a text in which the rhetoric is particularly effective, analyzing how style and content contribute to the power, persuasiveness or beauty of the text. "},{"title":"RI.11-12.7","body":" Integrate and evaluate multiple sources of information presented in different media or formats (e.g., visually, quantitatively) as well as in words in order to address a question or solve a problem."},{"title":"RI.11-12.8","body":" Delineate and evaluate the reasoning in seminal U.S. texts, including the application of constitutional principles and use of legal reasoning (e.g., in U.S. Supreme Court majority opinions and dissents) and the premises, purposes, and arguments in works of public advocacy (e.g., <em>The Federalist<\/em>, presidential addresses)."},{"title":"RI.11-12.9","body":" Analyze seventeenth-, eighteenth-, and nineteenth-century foundational U.S. documents of historical and literary significance (including The Declaration of Independence, the Preamble to the Constitution, the Bill of Rights, and Lincoln's Second Inaugural Address) for their themes, purposes, and rhetorical features."},{"title":"RI.11-12.10","body":" By the end of grade 11, read and comprehend literary nonfiction in the grades 11-CCR text complexity band proficiently, with scaffolding as needed at the high end of the range."}],"Writing":[{"title":"W.11-12.1","body":" Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence.      <ul>          <li>Introduce precise, knowledgeable claim(s), establish the significance of the claim(s), distinguish the claim(s) from alternate or opposing claims, and create an organization that logically sequences claim(s), counterclaims, reasons, and evidence.<\/li>          <li>Develop claim(s) and counterclaims fairly and thoroughly, supplying the most relevant evidence for each while pointing out the strengths and limitations of both in a manner that anticipates the audience&rsquo;s knowledge level, concerns, values, and possible biases.<\/li>          <li>Use words, phrases, and clauses as well as varied syntax to link the major sections of the text, create cohesion, and clarify the relationships between claim(s) and reasons, between reasons and evidence, and between claim(s) and counterclaims.<\/li>          <li>Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.<\/li>          <li>Provide a concluding statement or section that follows from and supports the argument presented.<\/li>      <\/ul>      "},{"title":"W.11-12.2","body":" Write informative\/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content.      <ul>          <li>Introduce a topic; organize complex ideas, concepts, and information so that each new element builds on that which precedes it to create a unified whole; include formatting (e.g., headings), graphics (e.g., figures, tables), and multimedia when useful to aiding comprehension.<\/li>          <li>Develop the topic thoroughly by selecting the most significant and relevant facts, extended definitions, concrete details, quotations, or other information and examples appropriate to the audience&rsquo;s knowledge of the topic.<\/li>          <li>Use appropriate and varied transitions and syntax to link the major sections of the text, create cohesion, and clarify the relationships among complex ideas and concepts.<\/li>          <li>Use precise language, domain-specific vocabulary, and techniques such as metaphor, simile, and analogy to manage the complexity of the topic.<\/li>          <li>Establish and maintain a formal style and objective tone while attending to the norms and conventions of the discipline in which they are writing.<\/li>          <li>Provide a concluding statement or section that follows from and supports the information or explanation presented (e.g., articulating implications or the significance of the topic).<\/li>      <\/ul>      "},{"title":"W.11-12.3","body":" Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences.      <ul>          <li>Engage and orient the reader by setting out a problem, situation, or observation and its significance, establishing one or multiple point(s) of view, and introducing a narrator and\/or characters; create a smooth progression of experiences or events.<\/li>          <li>Use narrative techniques, such as dialogue, pacing, description, reflection, and multiple plot lines, to develop experiences, events, and\/or characters.<\/li>          <li>Use a variety of techniques to sequence events so that they build on one another to create a coherent whole and build toward a particular tone and outcome (e.g., a sense of mystery, suspense, growth, or resolution).<\/li>          <li>Use precise words and phrases, telling details, and sensory language to convey a vivid picture of the experiences, events, setting, and\/or characters.<\/li>          <li>Provide a conclusion that follows from and reflects on what is experienced, observed, or resolved over the course of the narrative.<\/li>      <\/ul>      "},{"title":"W.11-12.4","body":" Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience. (Grade-specific expectations for writing types are defined in standards 1&ndash;3 above.)"},{"title":"W.11-12.5","body":" Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience."},{"title":"W.11-12.6","body":" Use technology, including the Internet, to produce, publish, and update individual or shared writing products in response to ongoing feedback, including new arguments or information."},{"title":"W.11-12.7","body":" Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation."},{"title":"W.11-12.8","body":" Gather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the strengths and limitations of each source in terms of the task, purpose, and audience; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and overreliance on any one source and following a standard format for citation."},{"title":"W.11-12.9","body":" Draw evidence from literary or informational texts to support analysis, reflection, and research.      <ul>          <li>Apply g<i>rades 11&ndash;12 Reading standards<\/i> to literature (e.g., &ldquo;Demonstrate knowledge of eighteenth-, nineteenth- and early-twentieth-century foundational works of American literature, including how two or more texts from the same period treat similar themes or topics&rdquo;).<\/li>          <li>Apply <i>grades 11&ndash;12 Reading standards<\/i> to literary nonfiction (e.g., &ldquo;Delineate and evaluate the reasoning in seminal U.S. texts, including the application of constitutional principles and use of legal reasoning [e.g., in U.S. Supreme Court Case majority opinions and dissents] and the premises, purposes, and arguments in works of public advocacy [e.g., <em>The Federalist<\/em>, presidential addresses]&rdquo;).<\/li>      <\/ul>      "},{"title":"W.11-12.10","body":" Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes"}],"Speaking & Listening":[{"title":"SL.11-12.1","body":" Initiate and participate effectively in a range of collaborative discussions (one-on-one, in groups, and teacher-led) with diverse partners on grades 11-12 topics, texts, and issues, building on others' ideas and expressing their own clearly and persuasively."},{"title":"SL.11-12.2","body":" Integrate multiple sources of information presented in diverse formats and media (e.g., visually, quantitatively, orally) in order to make informed decisions and solve problems, evaluating the credibility and accuracy of each source and noting any discrepancies among the data."},{"title":"SL.11-12.3","body":" Evaluate a speaker's point of view, reasoning, and use of evidence and rhetoric, assessing the stance, premises, links among ideas, word choice, points of emphasis, and tone used."},{"title":"SL.11-12.4","body":" Present information, findings, and supporting evidence, conveying a clear and distinct perspective, such that listeners can follow the line of reasoning, alternative or opposing perspectives are addressed, and the organization, development, substance, and style are appropriate to purpose, audience, and a range of formal and informal tasks."},{"title":"SL.11-12.5","body":" Make strategic use of digital media (e.g., textual, graphical, audio, visual, and interactive elements) in presentations to enhance understanding of findings, reasoning, and evidence and to add interest."},{"title":"SL.11-12.6","body":" Adapt speech to a variety of contexts and tasks, demonstrating a command of formal English when indicated or appropriate."}],"Language":[{"title":"L.11-12.1","body":" Demonstrate command of the conventions of standard English grammar and usage when writing or speaking."},{"title":"L.11-12.2","body":" Demonstrate command of the conventions of standard English capitalization, punctuation, and spelling when writing."},{"title":"L.11-12.3","body":" Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening."},{"title":"L.11-12.4","body":" Determine or clarify the meaning of unknown and multiple-meaning words and phrases based on <em>grades 11-12 reading and content<\/em>, choosing flexibly from a range of strategies."},{"title":"L.11-12.5","body":" Demonstrate understanding of figurative language, word relationships, and nuances in word meanings."},{"title":"L.11-12.6","body":" Acquire and use accurately general academic and domain-specific words and phrases, sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when considering a word or phrase important to comprehension or expression."}]},"Grades 6-8":{"History\/Social Studies":[{"title":"RH.6-8.1","body":"\tCite specific textual evidence to support analysis of primary and secondary sources."},{"title":"RH.6-8.2","body":"\tDetermine the central ideas or information of a primary or secondary source; provide an accurate summary of the source distinct from prior knowledge or opinions."},{"title":"RH.6-8.3","body":"\tIdentify key steps in a text's description of a process related to history\/social studies (e.g., how a bill becomes law, how interest rates are raised or lowered)."},{"title":"RH.6-8.4","body":"\tDetermine the meaning of words and phrases as they are used in a text, including vocabulary specific to domains related to history\/social studies."},{"title":"RH.6-8.5","body":"\tDescribe how a text presents information (e.g., sequentially, comparatively, causally). "},{"title":"RH.6-8.6","body":"\tIdentify aspects of a text that reveal an author's point of view or purpose (e.g., loaded language, inclusion or avoidance of particular facts)."},{"title":"RH.6-8.7","body":"\tIntegrate visual information (e.g., in charts, graphs, photographs, videos, or maps) with other information in print and digital texts."},{"title":"RH.6-8.8","body":"\tDistinguish among fact, opinion, and reasoned judgment in a text."},{"title":"RH.6-8.9","body":"\tAnalyze the relationship between a primary and secondary source on the same topic."},{"title":"RH.6-8.10","body":" By the end of grade 8, read and comprehend history\/social studies texts in the grades 6-8 text complexity band independently and proficiently."}],"Science & Technical Subjects":[{"title":"RST.6-8.1","body":"\tCite specific textual evidence to support analysis of science and technical texts."},{"title":"RST.6-8.2","body":"\tDetermine the central ideas or conclusions of a text; provide an accurate summary of the text distinct from prior knowledge or opinions."},{"title":"RST.6-8.3","body":"\tFollow precisely a multistep procedure when carrying out experiments, taking measurements, or performing technical tasks."},{"title":"RST.6-8.4","body":"\tDetermine the meaning of symbols, key terms, and other domain-specific words and phrases as they are used in a specific scientific or technical context relevant to <em>grades 6-8 texts and topics<\/em>."},{"title":"RST.6-8.5","body":"\tAnalyze the structure an author uses to organize a text, including how the major sections contribute to the whole and to an understanding of the topic."},{"title":"RST.6-8.6","body":"\tAnalyze the author's purpose in providing an explanation, describing a procedure, or discussing an experiment in a text."},{"title":"RST.6-8.7","body":"\tIntegrate quantitative or technical information expressed in words in a text with a version of that information expressed visually (e.g., in a flowchart, diagram, model, graph, or table)."},{"title":"RST.6-8.8","body":"\tDistinguish among facts, reasoned judgment based on research findings, and speculation in a text."},{"title":"RST.6-8.9","body":"\tCompare and contrast the information gained from experiments, simulations, video, or multimedia sources with that gained from reading a text on the same topic."},{"title":"RST.6-8.10","body":" By the end of grade 8, read and comprehend science\/technical texts in the grades 6-8 text complexity band independently and proficiently."}],"Writing":[{"title":"WHST.6-8.1","body":" Write arguments focused on <em>discipline-specific content<\/em>.      <ul>          <li>Introduce claim(s) about a topic or issue, acknowledge and distinguish the claim(s) from alternate or opposing claims, and organize the reasons and evidence logically.<\/li>          <li>Support claim(s) with logical reasoning and relevant, accurate data and evidence that demonstrate an understanding of the topic or text, using credible sources.<\/li>          <li>Use words, phrases, and clauses to create cohesion and clarify the relationships among claim(s), counterclaims, reasons, and evidence.<\/li>          <li>Establish and maintain a formal style.<\/li>          <li>Provide a concluding statement or section that follows from and supports the argument presented.<\/li>      <\/ul>      "},{"title":"WHST.6-8.2","body":" Write informative\/explanatory texts, including the narration of historical events, scientific procedures\/ experiments, or technical processes.      <ul>          <li>Introduce a topic clearly, previewing what is to follow; organize ideas, concepts, and information into broader categories as appropriate to achieving purpose; include formatting (e.g., headings), graphics (e.g., charts, tables), and multimedia when useful to aiding comprehension.<\/li>          <li>Develop the topic with relevant, well-chosen facts, definitions, concrete details, quotations, or other information and examples.<\/li>          <li>Use appropriate and varied transitions to create cohesion and clarify the relationships among ideas and concepts.<\/li>          <li>Use precise language and domain-specific vocabulary to inform about or explain the topic.<\/li>          <li>Establish and maintain a formal style and objective tone.<\/li>          <li>Provide a concluding statement or section that follows from and supports the information or explanation presented.<\/li>      <\/ul>      "},{"title":"WHST.6-8.3","body":" (See note; not applicable as a separate requirement)"},{"title":"WHST.6-8.4","body":" Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."},{"title":"WHST.6-8.5","body":" With some guidance and support from peers and adults, develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on how well purpose and audience have been addressed."},{"title":"WHST.6-8.6","body":" Use technology, including the Internet, to produce and publish writing and present the relationships between information and ideas clearly and efficiently."},{"title":"WHST.6-8.7","body":" Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration."},{"title":"WHST.6-8.8","body":" Gather relevant information from multiple print and digital sources, using search terms effectively; assess the credibility and accuracy of each source; and quote or paraphrase the data and conclusions of others while avoiding plagiarism and following a standard format for citation."},{"title":"WHST.6-8.9","body":" Draw evidence from informational texts to support analysis reflection, and research."},{"title":"WHST.6-8.10","body":" Write routinely over extended time frames (time for reflection and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."}]},"Grades 9-10":{"History\/Social Studies":[{"title":"RH.9-10.1","body":"\tCite specific textual evidence to support analysis of primary and secondary sources, attending to such features as the date and origin of the information."},{"title":"RH.9-10.2","body":"\tDetermine the central ideas or information of a primary or secondary source; provide an accurate summary of how key events or ideas develop over the course of the text."},{"title":"RH.9-10.3","body":"\tAnalyze in detail a series of events described in a text; determine whether earlier events caused later ones or simply preceded them.  "},{"title":"RH.9-10.4","body":"\tDetermine the meaning of words and phrases as they are used in a text, including vocabulary describing political, social, or economic aspects of history\/social science."},{"title":"RH.9-10.5","body":"\tAnalyze how a text uses structure to emphasize key points or advance an explanation or analysis."},{"title":"RH.9-10.6","body":"\tCompare the point of view of two or more authors for how they treat the same or similar topics, including which details they include and emphasize in their respective accounts."},{"title":"RH.9-10.7","body":"\tIntegrate quantitative or technical analysis (e.g., charts, research data) with qualitative analysis in print or digital text."},{"title":"RH.9-10.8","body":"\tAssess the extent to which the reasoning and evidence in a text support the author's claims."},{"title":"RH.9-10.9","body":"\tCompare and contrast treatments of the same topic in several primary and secondary sources."},{"title":"RH.9-10.10","body":"\tBy the end of grade 10, read and comprehend history\/social studies texts in the grades 9-10 text complexity band independently and proficiently."}],"Science & Technical Subjects":[{"title":"RST.9-10.1","body":"\tCite specific textual evidence to support analysis of science and technical texts, attending to the precise details of explanations or descriptions."},{"title":"RST.9-10.2","body":"\tDetermine the central ideas or conclusions of a text; trace the text's explanation or depiction of a complex process, phenomenon, or concept; provide an accurate summary of the text."},{"title":"RST.9-10.3","body":"\tFollow precisely a complex multistep procedure when carrying out experiments, taking measurements, or performing technical tasks, attending to special cases or exceptions defined in the text. "},{"title":"RST.9-10.4","body":"\tDetermine the meaning of symbols, key terms, and other domain-specific words and phrases as they are used in a specific scientific or technical context relevant to <em>grades 9-10 texts and topics<\/em>."},{"title":"RST.9-10.5","body":"\tAnalyze the structure of the relationships among concepts in a text, including relationships among key terms (e.g., <em>force, friction, reaction force, energy<\/em>). "},{"title":"RST.9-10.6","body":"\tAnalyze the author's purpose in providing an explanation, describing a procedure, or discussing an experiment in a text, defining the question the author seeks to address."},{"title":"RST.9-10.7","body":" Translate quantitative or technical information expressed in words in a text into visual form (e.g., a table or chart) and translate information expressed visually or mathematically (e.g., in an equation) into words."},{"title":"RST.9-10.8","body":"\tAssess the extent to which the reasoning and evidence in a text support the author's claim or a recommendation for solving a scientific or technical problem."},{"title":"RST.9-10.9","body":"\tCompare and contrast findings presented in a text to those from other sources (including their own experiments), noting when the findings support or contradict previous explanations or accounts."},{"title":"RST.9-10.10","body":"\tBy the end of grade 10, read and comprehend science\/technical texts in the grades 9-10 text complexity band independently and proficiently."}],"Writing":[{"title":"WHST.9-10.1","body":"\tWrite arguments focused on <em>discipline-specific content<\/em>."},{"title":"WHST.9-10.2","body":"\tWrite informative\/explanatory texts, including the narration of historical events, scientific procedures\/ experiments, or technical processes."},{"title":"WHST.9-10.3","body":"\t(See note; not applicable as a separate requirement) "},{"title":"WHST.9-10.4","body":"\tProduce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."},{"title":"WHST.9-10.5","body":"\tDevelop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience."},{"title":"WHST.9-10.6","body":"\tUse technology, including the Internet, to produce, publish, and update individual or shared writing products, taking advantage of technology's capacity to link to other information and to display information flexibly and dynamically."},{"title":"WHST.9-10.7","body":"\tConduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation."},{"title":"WHST.9-10.8","body":"\tGather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the usefulness of each source in answering the research question; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and following a standard format for citation."},{"title":"WHST.9-10.9","body":"\tDraw evidence from informational texts to support analysis, reflection, and research."},{"title":"WHST.9-10.10","body":"\tWrite routinely over extended time frames (time for reflection and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."}]},"Grades 11-12":{"History\/Social Studies":[{"title":"RH.11-12.1","body":"\tCite specific textual evidence to support analysis of primary and secondary sources, connecting insights gained from specific details to an understanding of the text as a whole."},{"title":"RH.11-12.2","body":"\tDetermine the central ideas or information of a primary or secondary source; provide an accurate summary that makes clear the relationships among the key details and ideas."},{"title":"RH.11-12.3","body":"\tEvaluate various explanations for actions or events and determine which explanation best accords with textual evidence, acknowledging where the text leaves matters uncertain."},{"title":"RH.11-12.4","body":"\tDetermine the meaning of words and phrases as they are used in a text, including analyzing how an author uses and refines the meaning of a key term over the course of a text (e.g., how Madison defines <em>faction<\/em> in <em>Federalist<\/em> No. 10)."},{"title":"RH.11-12.5","body":"\tAnalyze in detail how a complex primary source is structured, including how key sentences, paragraphs, and larger portions of the text contribute to the whole.  "},{"title":"RH.11-12.6","body":"\tEvaluate authors' differing points of view on the same historical event or issue by assessing the authors' claims, reasoning, and evidence."},{"title":"RH.11-12.7","body":"\tIntegrate and evaluate multiple sources of information presented in diverse formats and media (e.g., visually, quantitatively, as well as in words) in order to address a question or solve a problem."},{"title":"RH.11-12.8","body":"\tEvaluate an author's premises, claims, and evidence by corroborating or challenging them with other information.   "},{"title":"RH.11-12.9","body":"\tIntegrate information from diverse sources, both primary and secondary, into a coherent understanding of an idea or event, noting discrepancies among sources."},{"title":"RH.11-12.10","body":"\tBy the end of grade 12, read and comprehend history\/social studies texts in the grades 11-CCR text complexity band independently and proficiently."}],"Science & Technical Subjects":[{"title":"RST.11-12.1","body":"\tCite specific textual evidence to support analysis of science and technical texts, attending to important distinctions the author makes and to any gaps or inconsistencies in the account."},{"title":"RST.11-12.2","body":"\tDetermine the central ideas or conclusions of a text; summarize complex concepts, processes, or information presented in a text by paraphrasing them in simpler but still accurate terms."},{"title":"RST.11-12.3","body":"\tFollow precisely a complex multistep procedure when carrying out experiments, taking measurements, or performing technical tasks; analyze the specific results based on explanations in the text."},{"title":"RST.11-12.4","body":"\tDetermine the meaning of symbols, key terms, and other domain-specific words and phrases as they are used in a specific scientific or technical context relevant to <em>grades 11-12 texts and topics<\/em>."},{"title":"RST.11-12.5","body":"\tAnalyze how the text structures information or ideas into categories or hierarchies, demonstrating understanding of the information or ideas."},{"title":"RST.11-12.6","body":"\tAnalyze the author's purpose in providing an explanation, describing a procedure, or discussing an experiment in a text, identifying important issues that remain unresolved."},{"title":"RST.11-12.7","body":"\tIntegrate and evaluate multiple sources of information presented in diverse formats and media (e.g., quantitative data, video, multimedia) in order to address a question or solve a problem."},{"title":"RST.11-12.8","body":"\tEvaluate the hypotheses, data, analysis, and conclusions in a science or technical text, verifying the data when possible and corroborating or challenging conclusions with other sources of information."},{"title":"RST.11-12.9","body":"\tSynthesize information from a range of sources (e.g., texts, experiments, simulations) into a coherent understanding of a process, phenomenon, or concept, resolving conflicting information when possible."},{"title":"RST.11-12.10","body":"\tBy the end of grade 12, read and comprehend science\/technical texts in the grades 11-12 text complexity band independently and proficiently."}],"Writing":[{"title":"WHST.11-12.1","body":"\tWrite arguments focused on <em>discipline-specific content<\/em>."},{"title":"WHST.11-12.2","body":"\tWrite informative\/explanatory texts, including the narration of historical events, scientific procedures\/ experiments, or technical processes."},{"title":"WHST.11-12.3","body":"\t(See note; not applicable as a separate requirement)"},{"title":"WHST.11-12.4","body":"\tProduce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience."},{"title":"WHST.11-12.5","body":"\tDevelop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach, focusing on addressing what is most significant for a specific purpose and audience."},{"title":"WHST.11-12.6","body":"\tUse technology, including the Internet, to produce, publish, and update individual or shared writing products in response to ongoing feedback, including new arguments or information."},{"title":"WHST.11-12.7","body":"\tConduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation."},{"title":"WHST.11-12.8","body":"\tGather relevant information from multiple authoritative print and digital sources, using advanced searches effectively; assess the strengths and limitations of each source in terms of the specific task, purpose, and audience; integrate information into the text selectively to maintain the flow of ideas, avoiding plagiarism and overreliance on any one source and following a standard format for citation."},{"title":"WHST.11-12.9","body":"\tDraw evidence from informational texts to support analysis, reflection, and research."},{"title":"WHST.11-12.10","body":"\tWrite routinely over extended time frames (time for reflection and revision) and shorter time frames (a single sitting or a day or two) for a range of discipline-specific tasks, purposes, and audiences."}]}},"Mathematics":{"Kindergarten":{"Counting & Cardinality":[{"title":"K.CC.1","body":" Count to 100 by ones and by tens."},{"title":"K.CC.2","body":" Count forward beginning from a given number within the known sequence (instead of having to begin at 1)."},{"title":"K.CC.3","body":" Write numbers from 0 to 20. Represent a number of objects with a written numeral 0-20 (with 0 representing a count of no objects)."},{"title":"K.CC.4","body":" Understand the relationship between numbers and quantities; connect counting to cardinality.      <ul>          <li>When counting objects, say the number names in the standard order, pairing each object with one and only one number name and each number name with one and only one object.<\/li>          <li>Understand that the last number name said tells the number of objects counted. The number of objects is the same regardless of their arrangement or the order in which they were counted.<\/li>          <li>Understand that each successive number name refers to a quantity that is one larger.<\/li>      <\/ul>      "},{"title":"K.CC.5","body":" Count to answer &ldquo;how many?&rdquo; questions about as many as 20 things arranged in a line, a rectangular array, or a circle, or as many as 10 things in a scattered configuration; given a number from 1&ndash;20, count out that many objects."},{"title":"K.CC.6","body":" Identify whether the number of objects in one group is greater than, less than, or equal to the number of objects in another group, e.g., by using matching and counting strategies.<sup>1<\/sup>"},{"title":"K.CC.7","body":" Compare two numbers between 1 and 10 presented as written numerals."}],"Operations & Algebraic Thinking":[{"title":"K.OA.1","body":" Represent addition and subtraction with objects, fingers, mental images, drawings<sup>1<\/sup>, sounds (e.g., claps), acting out situations, verbal explanations, expressions, or equations."},{"title":"K.OA.2","body":" Solve addition and subtraction word problems, and add and subtract within 10, e.g., by using objects or drawings to represent the problem."},{"title":"K.OA.3","body":" Decompose numbers less than or equal to 10 into pairs in more than one way, e.g., by using objects or drawings, and record each decomposition by a drawing or equation (e.g., 5 = 2 + 3 and 5 = 4 + 1)."},{"title":"K.OA.4","body":" For any number from 1 to 9, find the number that makes 10 when added to the given number, e.g., by using objects or drawings, and record the answer with a drawing or equation."},{"title":"K.OA.5","body":" Fluently add and subtract within 5."}],"Number & Operations in Base Ten":[{"title":"K.NBT.1","body":" Compose and decompose numbers from 11 to 19 into ten ones and some further ones, e.g., by using objects or drawings, and record each composition or decomposition by a drawing or equation (such as 18 = 10 + 8); understand that these numbers are composed of ten ones and one, two, three, four, five, six, seven, eight, or nine ones.\f"}],"Measurement & Data":[{"title":"K.MD.1","body":" Describe measurable attributes of objects, such as length or weight. Describe several measurable attributes of a single object."},{"title":"K.MD.2","body":" Directly compare two objects with a measurable attribute in common, to see which object has &ldquo;more of&rdquo;\/&ldquo;less of&rdquo; the attribute, and describe the difference. <i>For example, directly compare the heights of two children and describe one child as taller\/shorter.<\/i>"},{"title":"K.MD.3","body":" Classify objects into given categories; count the numbers of objects in each category and sort the categories by count.<sup>1<\/sup>"}],"Geometry":[{"title":"K.G.1","body":" Describe objects in the environment using names of shapes, and describe the relative positions of these objects using terms such as <i>above<\/i>, <i>below<\/i>, <i>beside<\/i>, <i>in front of<\/i>, <i>behind<\/i>, and <i>next to<\/i>."},{"title":"K.G.2","body":" Correctly name shapes regardless of their orientations or overall size."},{"title":"K.G.3","body":" Identify shapes as two-dimensional (lying in a plane, &ldquo;flat&rdquo;) or three-dimensional (&ldquo;solid&rdquo;)."},{"title":"K.G.4","body":" Analyze and compare two- and three-dimensional shapes, in different sizes and orientations, using informal language to describe their similarities, differences, parts (e.g., number of sides and vertices\/&ldquo;corners&rdquo;) and other attributes (e.g., having sides of equal length)."},{"title":"K.G.5","body":" Model shapes in the world by building shapes from components (e.g., sticks and clay balls) and drawing shapes."},{"title":"K.G.6","body":" Compose simple shapes to form larger shapes. <i>For example, &ldquo;Can you join these two triangles with full sides touching to make a rectangle?&rdquo;<\/i>"}]},"Grade 1":{"Operations & Algebraic Thinking":[{"title":"1.OA.1","body":" Use addition and subtraction within 20 to solve word problems involving situations of adding to, taking from, putting together, taking apart, and comparing, with unknowns in all positions, e.g., by using objects, drawings, and equations with a symbol for the unknown number to represent the problem.<sup>1<\/sup>"},{"title":"1.OA.2","body":" Solve word problems that call for addition of three whole numbers whose sum is less than or equal to 20, e.g., by using objects, drawings, and equations with a symbol for the unknown number to represent the problem."},{"title":"1.OA.3","body":" Apply properties of operations as strategies to add and subtract.<sup>2<\/sup> <i>Examples: If 8 + 3 = 11 is known, then 3 + 8 = 11 is also known. (Commutative property of addition.) To add 2 + 6 + 4, the second two numbers can be added to make a ten, so 2 + 6 + 4 = 2 + 10 = 12. (Associative property of addition.) <\/i>"},{"title":"1.OA.4","body":"Understand subtraction as an unknown-addend problem. <i>For example, subtract 10 &ndash; 8 by finding the number that makes 10 when added to 8. Add and subtract within 20. <\/i>"},{"title":"1.OA.5","body":" Relate counting to addition and subtraction (e.g., by counting on 2 to add 2)."},{"title":"1.OA.6","body":" Add and subtract within 20, demonstrating fluency for addition and subtraction within 10. Use strategies such as counting on; making ten (e.g., 8 + 6 = 8 + 2 + 4 = 10 + 4 = 14); decomposing a number leading to a ten (e.g., 13 &ndash; 4 = 13 &ndash; 3 &ndash; 1 = 10 &ndash; 1 = 9); using the relationship between addition and subtraction (e.g., knowing that 8 + 4 = 12, one knows 12 &ndash; 8 = 4); and creating equivalent but easier or known sums (e.g., adding 6 + 7 by creating the known equivalent 6 + 6 + 1 = 12 + 1 = 13)."},{"title":"1.OA.7","body":" Understand the meaning of the equal sign, and determine if equations involving addition and subtraction are true or false. For example, which of the following equations are true and which are false? 6 = 6, 7 = 8 &ndash; 1, 5 + 2 = 2 + 5, 4 + 1 = 5 + 2."},{"title":"1.OA.8","body":" Determine the unknown whole number in an addition or subtraction equation relating three whole numbers. <i>For example, determine the unknown number that makes the equation true in each of the equations 8 + ? = 11, 5 = _ &ndash; 3, 6 + 6 = _.<\/i>"}],"Number & Operations in Base Ten":[{"title":"1.NBT.1","body":" Count to 120, starting at any number less than 120. In this range, read and write numerals and represent a number of objects with a written numeral."},{"title":"1.NBT.2","body":" Understand that the two digits of a two-digit number represent amounts of tens and ones. Understand the following as special cases:      <ul>          <li>10 can be thought of as a bundle of ten ones &mdash; called a &ldquo;ten.&rdquo;<\/li>          <li>The numbers from 11 to 19 are composed of a ten and one, two, three, four, five, six, seven, eight, or nine ones.<\/li>          <li>The numbers 10, 20, 30, 40, 50, 60, 70, 80, 90 refer to one, two, three, four, five, six, seven, eight, or nine tens (and 0 ones).<\/li>      <\/ul>      "},{"title":"1.NBT.3","body":" Compare two two-digit numbers based on meanings of the tens and ones digits, recording the results of comparisons with the symbols &gt;, =, and &lt;."},{"title":"1.NBT.4","body":" Add within 100, including adding a two-digit number and a one-digit number, and adding a two-digit number and a multiple of 10, using concrete models or drawings and strategies based on place value, properties of operations, and\/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used. Understand that in adding two-digit numbers, one adds tens and tens, ones and ones; and sometimes it is necessary to compose a ten."},{"title":"1.NBT.5","body":" Given a two-digit number, mentally find 10 more or 10 less than the number, without having to count; explain the reasoning used."},{"title":"1.NBT.6","body":" Subtract multiples of 10 in the range 10-90 from multiples of 10 in the range 10-90 (positive or zero differences), using concrete models or drawings and strategies based on place value, properties of operations, and\/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used."}],"Measurement & Data":[{"title":"1.MD.1","body":" Order three objects by length; compare the lengths of two objects indirectly by using a third object."},{"title":"1.MD.2","body":" Express the length of an object as a whole number of length units, by laying multiple copies of a shorter object (the length unit) end to end; understand that the length measurement of an object is the number of same-size length units that span it with no gaps or overlaps. <i>Limit to contexts where the object being measured is spanned by a whole number of length units with no gaps or overlaps.<\/i>"},{"title":"1.MD.3","body":" Tell and write time in hours and half-hours using analog and digital clocks."},{"title":"1.MD.4","body":" Organize, represent, and interpret data with up to three categories; ask and answer questions about the total number of data points, how many in each category, and how many more or less are in one category than in another."}],"Geometry":[{"title":"1.G.1","body":" Distinguish between defining attributes (e.g., triangles are closed and three-sided) versus non-defining attributes (e.g., color, orientation, overall size) ; build and draw shapes to possess defining attributes."},{"title":"1.G.2","body":" Compose two-dimensional shapes (rectangles, squares, trapezoids, triangles, half-circles, and quarter-circles) or three-dimensional shapes (cubes, right rectangular prisms, right circular cones, and right circular cylinders) to create a composite shape, and compose new shapes from the composite shape.<sup>1<\/sup>"},{"title":"1.G.3","body":" Partition circles and rectangles into two and four equal shares, describe the shares using the words <i>halves<\/i>, <i>fourths<\/i>, and <i>quarters<\/i>, and use the phrases <i>half of<\/i>, <i>fourth of<\/i>, and <i>quarter of<\/i>. Describe the whole as two of, or four of the shares. Understand for these examples that decomposing into more equal shares creates smaller shares."}]},"Grade 2":{"Operations & Algebraic Thinking":[{"title":"2.OA.1","body":" Use addition and subtraction within 100 to solve one- and two-step word problems involving situations of adding to, taking from, putting together, taking apart, and comparing, with unknowns in all positions, e.g., by using drawings and equations with a symbol for the unknown number to represent the problem.<sup>1<\/sup>"},{"title":"2.OA.2","body":" Fluently add and subtract within 20 using mental strategies.<sup>2<\/sup> By end of Grade 2, know from memory all sums of two one-digit numbers."},{"title":"2.OA.3","body":" Determine whether a group of objects (up to 20) has an odd or even number of members, e.g., by pairing objects or counting them by 2s; write an equation to express an even number as a sum of two equal addends."},{"title":"2.OA.4","body":" Use addition to find the total number of objects arranged in rectangular arrays with up to 5 rows and up to 5 columns; write an equation to express the total as a sum of equal addends."}],"Number & Operations in Base Ten":[{"title":"2.NBT.1","body":" Understand that the three digits of a three-digit number represent amounts of hundreds, tens, and ones; e.g., 706 equals 7 hundreds, 0 tens, and 6 ones. Understand the following as special cases:      <ul>          <li>100 can be thought of as a bundle of ten tens &mdash; called a &ldquo;hundred.&rdquo;<\/li>          <li>The numbers 100, 200, 300, 400, 500, 600, 700, 800, 900 refer to one, two, three, four, five, six, seven, eight, or nine hundreds (and 0 tens and 0 ones).<\/li>      <\/ul>      "},{"title":"2.NBT.2","body":" Count within 1000; skip-count by 5s, 10s, and 100s."},{"title":"2.NBT.3","body":" Read and write numbers to 1000 using base-ten numerals, number names, and expanded form."},{"title":"2.NBT.4","body":" Compare two three-digit numbers based on meanings of the hundreds, tens, and ones digits, using &gt;, =, and &lt; symbols to record the results of comparisons."},{"title":"2.NBT.5","body":" Fluently add and subtract within 100 using strategies based on place value, properties of operations, and\/or the relationship between addition and subtraction."},{"title":"2.NBT.6","body":" Add up to four two-digit numbers using strategies based on place value and properties of operations."},{"title":"2.NBT.7","body":" Add and subtract within 1000, using concrete models or drawings and strategies based on place value, properties of operations, and\/or the relationship between addition and subtraction; relate the strategy to a written method. Understand that in adding or subtracting three-digit numbers, one adds or subtracts hundreds and hundreds, tens and tens, ones and ones; and sometimes it is necessary to compose or decompose tens or hundreds."},{"title":"2.NBT.8","body":" Mentally add 10 or 100 to a given number 100&ndash;900, and mentally subtract 10 or 100 from a given number 100&ndash;900."},{"title":"2.NBT.9","body":" Explain why addition and subtraction strategies work, using place value and the properties of operations.<sup>1<\/sup>"}],"Measurement & Data":[{"title":"2.MD.1","body":" Measure the length of an object by selecting and using appropriate tools such as rulers, yardsticks, meter sticks, and measuring tapes."},{"title":"2.MD.2","body":" Measure the length of an object twice, using length units of different lengths for the two measurements; describe how the two measurements relate to the size of the unit chosen."},{"title":"2.MD.3","body":" Estimate lengths using units of inches, feet, centimeters, and meters."},{"title":"2.MD.4","body":" Measure to determine how much longer one object is than another, expressing the length difference in terms of a standard length unit."},{"title":"2.MD.5","body":" Use addition and subtraction within 100 to solve word problems involving lengths that are given in the same units, e.g., by using drawings (such as drawings of rulers) and equations with a symbol for the unknown number to represent the problem."},{"title":"2.MD.6","body":" Represent whole numbers as lengths from 0 on a number line diagram with equally spaced points corresponding to the numbers 0, 1, 2, ..., and represent whole-number sums and differences within 100 on a number line diagram."},{"title":"2.MD.7","body":" Tell and write time from analog and digital clocks to the nearest five minutes, using a.m. and p.m."},{"title":"2.MD.8","body":" Solve word problems involving dollar bills, quarters, dimes, nickels, and pennies, using $ and &cent; symbols appropriately. Example: If you have 2 dimes and 3 pennies, how many cents do you have?"},{"title":"2.MD.9","body":" Generate measurement data by measuring lengths of several objects to the nearest whole unit, or by making repeated measurements of the same object. Show the measurements by making a line plot, where the horizontal scale is marked off in whole-number units."},{"title":"2.MD.10","body":" Draw a picture graph and a bar graph (with single-unit scale) to represent a data set with up to four categories. Solve simple put-together, take-apart, and compare problems<sup>1<\/sup> using information presented in a bar graph."}],"Geometry":[{"title":"2.G.1","body":" Recognize and draw shapes having specified attributes, such as a given number of angles or a given number of equal faces.<sup>1<\/sup> Identify triangles, quadrilaterals, pentagons, hexagons, and cubes."},{"title":"2.G.2","body":" Partition a rectangle into rows and columns of same-size squares and count to find the total number of them."},{"title":"2.G.3","body":" Partition circles and rectangles into two, three, or four equal shares, describe the shares using the words halves, thirds, half of, a third of, etc., and describe the whole as two halves, three thirds, four fourths. Recognize that equal shares of identical wholes need not have the same shape."}]},"Grade 3":{"Operations & Algebraic Thinking":[{"title":"3.OA.1","body":"Interpret products of whole numbers, e.g., interpret 5 &times; 7 as the total number of objects in 5 groups of 7 objects each. <i>For example, describe a context in which a total number of objects can be expressed as 5 &times; 7.<\/i>"},{"title":"3.OA.2","body":" Interpret whole-number quotients of whole numbers, e.g., interpret 56 &divide; 8 as the number of objects in each share when 56 objects are partitioned equally into 8 shares, or as a number of shares when 56 objects are partitioned into equal shares of 8 objects each. <i>For example, describe a context in which a number of&nbsp; shares or a number of groups can be expressed as 56 &divide; 8.<\/i>"},{"title":"3.OA.3","body":" Use multiplication and division within 100 to solve word problems in situations involving equal groups, arrays, and measurement quantities, e.g., by using drawings and equations with a symbol for the unknown number to represent the problem.<sup>1<\/sup>"},{"title":"3.OA.4","body":" Determine the unknown whole number in a multiplication or division equation relating three whole numbers. <i>For example, determine the unknown number that makes the equation true in each of the equations 8 &times; ? = 48, 5 = _ &divide; 3, 6 &times; 6 = ?<\/i>"},{"title":"3.OA.5","body":" Apply properties of operations as strategies to multiply and divide.<sup>2<\/sup> <i>Examples: If 6 &times; 4 = 24 is known, then 4 &times; 6 = 24 is also known. (Commutative property of multiplication.) 3 &times; 5 &times; 2 can be found by 3 &times; 5 = 15, then 15 &times; 2 = 30, or by 5 &times; 2 = 10, then 3 &times; 10 = 30. (Associative property of multiplication.) Knowing that 8 &times; 5 = 40 and 8 &times; 2 = 16, one can find 8 &times; 7 as 8 &times; (5 + 2) = (8 &times; 5) + (8 &times; 2) = 40 + 16 = 56. (Distributive property.)<\/i>"},{"title":"3.OA.6","body":" Understand division as an unknown-factor problem. <i>For example, find 32 &divide; 8 by finding the number that makes 32 when multiplied by 8.<\/i>"},{"title":"3.OA.7","body":"Fluently multiply and divide within 100, using strategies such as the relationship between multiplication and division (e.g., knowing that 8 &times; 5 = 40, one knows 40 &divide; 5 = 8) or properties of operations. By the end of Grade 3, know from memory all products of two one-digit numbers."},{"title":"3.OA.8","body":" Solve two-step word problems using the four operations. Represent these problems using equations with a letter standing for the unknown quantity. Assess the reasonableness of answers using mental computation and estimation strategies including rounding.<sup>3<\/sup>"},{"title":"3.OA.9","body":" Identify arithmetic patterns (including patterns in the addition table or multiplication table), and explain them using properties of operations. <i>For example, observe that 4 times a number is always even, and explain why 4 times a number can be decomposed into two equal addends.<\/i>"}],"Number & Operations in Base Ten":[{"title":"3.NBT.1","body":" Use place value understanding to round whole numbers to the nearest 10 or 100."},{"title":"3.NBT.2","body":" Fluently add and subtract within 1000 using strategies and algorithms based on place value, properties of operations, and\/or the relationship between addition and subtraction."},{"title":"3.NBT.3","body":" Multiply one-digit whole numbers by multiples of 10 in the range 10&ndash;90 (e.g., 9 &times; 80, 5 &times; 60) using strategies based on place value and properties of operations."}],"Number & Operations—Fractions&sup1;":[{"title":"3.NF.1","body":" Understand a fraction 1\/<i>b<\/i> as the quantity formed by 1 part when <i>a<\/i> whole is partitioned into <i>b<\/i> equal parts; understand a fraction <i>a<\/i>\/<i>b<\/i> as the quantity formed by a parts of size 1\/<i>b<\/i>."},{"title":"3.NF.2","body":" Understand a fraction as a number on the number line; represent fractions on a number line diagram.      <ul>          <li>Represent a fraction 1\/<i>b<\/i> on a number line diagram by defining the interval from 0 to 1 as the whole and partitioning it into <i>b<\/i> equal parts. Recognize that each part has size 1\/<i>b<\/i> and that the endpoint of the part based at 0 locates the number 1\/<i>b<\/i> on the number line.<\/li>          <li>Represent a fraction <i>a<\/i>\/<i>b<\/i> on a number line diagram by marking off a lengths 1\/<i>b<\/i> from 0. Recognize that the resulting interval has size <i>a<\/i>\/<i>b<\/i> and that its endpoint locates the number <i>a<\/i>\/<i>b<\/i> on the number line.<\/li>      <\/ul>      "},{"title":"3.NF.3","body":" Explain equivalence of fractions in special cases, and compare fractions by reasoning about their size.      <ul>          <li>Understand two fractions as equivalent (equal) if they are the same size, or the same point on a number line.<\/li>          <li>Recognize and generate simple equivalent fractions, e.g., 1\/2 = 2\/4, 4\/6 = 2\/3). Explain why the fractions are equivalent, e.g., by using a visual fraction model.<\/li>          <li>Express whole numbers as fractions, and recognize fractions that are equivalent to whole numbers. <i>Examples: Express 3 in the form 3 = 3\/1; recognize that 6\/1 = 6; locate 4\/4 and 1 at the same point of a number line diagram.<\/i><\/li>          <li>Compare two fractions with the same numerator or the same denominator by reasoning about their size. Recognize that comparisons are valid only when the two fractions refer to the same whole. Record the results of comparisons with the symbols &gt;, =, or &lt;, and justify the conclusions, e.g., by using a visual fraction model.<\/li>      <\/ul>      "}],"Measurement & Data":[{"title":"3.MD.1","body":" Tell and write time to the nearest minute and measure time intervals in minutes. Solve word problems involving addition and subtraction of time intervals in minutes, e.g., by representing the problem on a number line diagram."},{"title":"3.MD.2","body":" Measure and estimate liquid volumes and masses of objects using standard units of grams (g), kilograms (kg), and liters (l).<sup>1<\/sup> Add, subtract, multiply, or divide to solve one-step word problems involving masses or volumes that are given in the same units, e.g., by using drawings (such as a beaker with a measurement scale) to represent the problem.<sup>2<\/sup>"},{"title":"3.MD.3","body":" Draw a scaled picture graph and a scaled bar graph to represent a data set with several categories. Solve one- and two-step &ldquo;how many more&rdquo; and &ldquo;how many less&rdquo; problems using information presented in scaled bar graphs. <i>For example, draw a bar graph in which each square in the bar graph might represent 5 pets.<\/i><br \/>      &nbsp;"},{"title":"3.MD.4","body":" Generate measurement data by measuring lengths using rulers marked with halves and fourths of an inch. Show the data by making a line plot, where the horizontal scale is marked off in appropriate units&mdash; whole numbers, halves, or quarters."},{"title":"3.MD.5","body":" Recognize area as an attribute of plane figures and understand concepts of area measurement.      <ul>          <li>A square with side length 1 unit, called &ldquo;a unit square,&rdquo; is said to have &ldquo;one square unit&rdquo; of area, and can be used to measure area.<\/li>          <li>A plane figure which can be covered without gaps or overlaps by <i>n<\/i> unit squares is said to have an area of <i>n<\/i> square units.<\/li>      <\/ul>      "},{"title":"3.MD.6","body":" Measure areas by counting unit squares (square cm, square m, square in, square ft, and improvised units)."},{"title":"3.MD.7","body":" Relate area to the operations of multiplication and addition.      <ul>          <li>Find the area of a rectangle with whole-number side lengths by tiling it, and show that the area is the same as would be found by multiplying the side lengths.<\/li>          <li>Multiply side lengths to find areas of rectangles with whole-number side lengths in the context of solving real world and mathematical problems, and represent whole-number products as rectangular areas in mathematical reasoning.<\/li>          <li>Use tiling to show in a concrete case that the area of a rectangle with whole-number side lengths <i>a<\/i> and <i>b<\/i> + <i>c<\/i> is the sum of <i>a<\/i> &times; <i>b<\/i> and <i>a<\/i> &times; <i>c<\/i>. Use area models to represent the distributive property in mathematical reasoning.<\/li>          <li>Recognize area as additive. Find areas of rectilinear figures by decomposing them into non-overlapping rectangles and adding the areas of the non-overlapping parts, applying this technique to solve real world problems.<\/li>      <\/ul>      "},{"title":"3.MD.8","body":" Solve real world and mathematical problems involving perimeters of polygons, including finding the perimeter given the side lengths, finding an unknown side length, and exhibiting rectangles with the same perimeter and different areas or with the same area and different perimeters."}],"Geometry":[{"title":"3.G.1","body":" Understand that shapes in different categories (e.g., rhombuses, rectangles, and others) may share attributes (e.g., having four sides), and that the shared attributes can define a larger category (e.g., quadrilaterals). Recognize rhombuses, rectangles, and squares as examples of quadrilaterals, and draw examples of quadrilaterals that do not belong to any of these subcategories."},{"title":"3.G.2","body":" Partition shapes into parts with equal areas. Express the area of each part as a unit fraction of the whole. <i>For example, partition a shape into 4 parts with equal area, and describe the area of each part as 1\/4 of the area of the shape.<\/i>"}]},"Grade 4":{"Operations & Algebraic Thinking":[{"title":"4.OA.1","body":" Interpret a multiplication equation as a comparison, e.g., interpret 35 = 5 &times; 7 as a statement that 35 is 5 times as many as 7 and 7 times as many as 5. Represent verbal statements of multiplicative comparisons as multiplication equations."},{"title":"4.OA.2","body":" Multiply or divide to solve word problems involving multiplicative comparison, e.g., by using drawings and equations with a symbol for the unknown number to represent the problem, distinguishing multiplicative comparison from additive comparison.<sup>1<\/sup>"},{"title":"4.OA.3","body":" Solve multistep word problems posed with whole numbers and having whole-number answers using the four operations, including problems in which remainders must be interpreted. Represent these problems using equations with a letter standing for the unknown quantity. Assess the reasonableness of answers using mental computation and estimation strategies including rounding."},{"title":"4.OA.4","body":" Find all factor pairs for a whole number in the range 1&ndash;100. Recognize that a whole number is a multiple of each of its factors. Determine whether a given whole number in the range 1&ndash;100 is a multiple of a given one-digit number. Determine whether a given whole number in the range 1&ndash;100 is prime or composite."},{"title":"4.OA.5","body":" Generate a number or shape pattern that follows a given rule. Identify apparent features of the pattern that were not explicit in the rule itself. <i>For example, given the rule &ldquo;Add 3&rdquo; and the starting number 1, generate terms in the resulting sequence and observe that the terms appear to alternate between odd and even numbers. Explain informally why the numbers will continue to alternate in this way.<\/i>"}],"Number & Operations in Base Ten&sup1;":[{"title":"4.NBT.1","body":" Recognize that in a multi-digit whole number, a digit in one place represents ten times what it represents in the place to its right.<i> For example, recognize that 700 &divide; 70 = 10 by applying concepts of place value and division.<\/i>"},{"title":"4.NBT.2","body":" Read and write multi-digit whole numbers using base-ten numerals, number names, and expanded form. Compare two multi-digit numbers based on meanings of the digits in each place, using &gt;, =, and &lt; symbols to record the results of comparisons."},{"title":"4.NBT.3","body":" Use place value understanding to round multi-digit whole numbers to any place."},{"title":"4.NBT.4","body":" Fluently add and subtract multi-digit whole numbers using the standard algorithm."},{"title":"4.NBT.5","body":" Multiply a whole number of up to four digits by a one-digit whole number, and multiply two two-digit numbers, using strategies based on place value and the properties of operations. Illustrate and explain the calculation by using equations, rectangular arrays, and\/or area models."},{"title":"4.NBT.6","body":" Find whole-number quotients and remainders with up to four-digit dividends and one-digit divisors, using strategies based on place value, the properties of operations, and\/or the relationship between multiplication and division. Illustrate and explain the calculation by using equations, rectangular arrays, and\/or area models."}],"Number & Operations—Fractions&sup1;":[{"title":"4.NF.1","body":" Explain why a fraction <i>a<\/i>\/<i>b<\/i> is equivalent to a fraction (<i>n<\/i> &times; <i>a<\/i>)\/(<i>n<\/i> &times; <i>b<\/i>) by using visual fraction models, with attention to how the number and size of the parts differ even though the two fractions themselves are the same size. Use this principle to recognize and generate equivalent fractions."},{"title":"4.NF.2","body":" Compare two fractions with different numerators and different denominators, e.g., by creating common denominators or numerators, or by comparing to a benchmark fraction such as 1\/2. Recognize that comparisons are valid only when the two fractions refer to the same whole. Record the results of comparisons with symbols &gt;, =, or &lt;, and justify the conclusions, e.g., by using a visual fraction model."},{"title":"4.NF.3","body":" Understand a fraction <i>a<\/i>\/<i>b<\/i> with <i>a<\/i> &gt; 1 as a sum of fractions 1\/<i>b<\/i>.      <ul>          <li>Understand addition and subtraction of fractions as joining and separating parts referring to the same whole.<\/li>          <li>Decompose a fraction into a sum of fractions with the same denominator in more than one way, recording each decomposition by an equation. Justify decompositions, e.g., by using a visual fraction model. <i>Examples: 3\/8 = 1\/8 + 1\/8 + 1\/8 ; 3\/8 = 1\/8 + 2\/8 ; 2 1\/8 = 1 + 1 + 1\/8 = 8\/8 + 8\/8 + 1\/8.<\/i><\/li>          <li>Add and subtract mixed numbers with like denominators, e.g., by replacing each mixed number with an equivalent fraction, and\/or by using properties of operations and the relationship between addition and subtraction.<\/li>          <li>Solve word problems involving addition and subtraction of fractions referring to the same whole and having like denominators, e.g., by using visual fraction models and equations to represent the problem.<\/li>      <\/ul>      "},{"title":"4.NF.4","body":" Apply and extend previous understandings of multiplication to multiply a fraction by a whole number.      <ul>          <li>Understand a fraction <i>a<\/i>\/<i>b<\/i> as a multiple of 1\/<i>b<\/i>. <i>For example, use a visual fraction model to represent 5\/4 as the product 5 &times; (1\/4), recording the conclusion by the equation 5\/4 = 5 &times; (1\/4).<\/i><\/li>          <li>Understand a multiple of a\/b as a multiple of 1\/b, and use this understanding to multiply a fraction by a whole number. <i>For example, use a visual fraction model to express 3 &times; (2\/5) as 6 &times; (1\/5), recognizing this product as 6\/5. (In general, n &times; (a\/b) = (n &times; a)\/b.) <\/i><\/li>          <li>Solve word problems involving multiplication of a fraction by a whole number, e.g., by using visual fraction models and equations to represent the problem. <i>For example, if each person at a party will eat 3\/8 of a pound of roast beef, and there will be 5 people at the party, how many pounds of roast beef will be needed? Between what two whole numbers does your answer lie?<\/i><\/li>      <\/ul>      "},{"title":"4.NF.5","body":" Express a fraction with denominator 10 as an equivalent fraction with denominator 100, and use this technique to add two fractions with respective denominators 10 and 100.<sup>2<\/sup> <i>For example, express 3\/10 as 30\/100, and add 3\/10 + 4\/100 = 34\/100. <\/i>"},{"title":"4.NF.6","body":" Use decimal notation for fractions with denominators 10 or 100. <i>For example, rewrite 0.62 as 62\/100; describe a length as 0.62 meters; locate 0.62 on a number line diagram.<\/i>"},{"title":"4.NF.7","body":" Compare two decimals to hundredths by reasoning about their size. Recognize that comparisons are valid only when the two decimals refer to the same whole. Record the results of comparisons with the symbols &gt;, =, or &lt;, and justify the conclusions, e.g., by using a visual model.      <p>&nbsp;<\/p>      "}],"Measurement & Data":[{"title":"4.MD.1","body":" Know relative sizes of measurement units within one system of units including km, m, cm; kg, g; lb, oz.; l, ml; hr, min, sec. Within a single system of measurement, express measurements in a larger unit in terms of a smaller unit. Record measurement equivalents in a two-column table. <i>For example, know that 1 ft is 12 times as long as 1 in. Express the length of a 4 ft snake as 48 in. Generate a conversion table for feet and inches listing the number pairs (1, 12), (2, 24), (3, 36), ...<\/i>"},{"title":"4.MD.2","body":" Use the four operations to solve word problems involving distances, intervals of time, liquid volumes, masses of objects, and money, including problems involving simple fractions or decimals, and problems that require expressing measurements given in a larger unit in terms of a smaller unit. Represent measurement quantities using diagrams such as number line diagrams that feature a measurement scale."},{"title":"4.MD.3","body":" Apply the area and perimeter formulas for rectangles in real world and mathematical problems. <i>For example, find the width of a rectangular room given the area of the flooring and the length, by viewing the area formula as a multiplication equation with an unknown factor.<\/i>"},{"title":"4.MD.4","body":" Make a line plot to display a data set of measurements in fractions of a unit (1\/2, 1\/4, 1\/8). Solve problems involving addition and subtraction of fractions by using information presented in line plots. <i>For example, from a line plot find and interpret the difference in length between the longest and shortest specimens in an insect collection.<\/i>"},{"title":"4.MD.5","body":" Recognize angles as geometric shapes that are formed wherever two rays share a common endpoint, and understand concepts of angle measurement:      <ul>          <li>An angle is measured with reference to a circle with its center at the common endpoint of the rays, by considering the fraction of the circular arc between the points where the two rays intersect the circle. An angle that turns through 1\/360 of a circle is called a &ldquo;one-degree angle,&rdquo; and can be used to measure angles.<\/li>          <li>An angle that turns through <i>n<\/i> one-degree angles is said to have an angle measure of <i>n<\/i> degrees.<\/li>      <\/ul>      "},{"title":"4.MD.6","body":" Measure angles in whole-number degrees using a protractor. Sketch angles of specified measure."},{"title":"4.MD.7","body":" Recognize angle measure as additive. When an angle is decomposed into non-overlapping parts, the angle measure of the whole is the sum of the angle measures of the parts. Solve addition and subtraction problems to find unknown angles on a diagram in real world and mathematical problems, e.g., by using an equation with a symbol for the unknown angle measure."}],"Geometry":[{"title":"4.G.1","body":" Draw points, lines, line segments, rays, angles (right, acute, obtuse), and perpendicular and parallel lines. Identify these in two-dimensional figures."},{"title":"4.G.2","body":" Classify two-dimensional figures based on the presence or absence of parallel or perpendicular lines, or the presence or absence of angles of a specified size. Recognize right triangles as a category, and identify right triangles."},{"title":"4.G.3","body":" Recognize a line of symmetry for a two-dimensional figure as a line across the figure such that the figure can be folded along the line into matching parts. Identify line-symmetric figures and draw lines of symmetry."}]},"Grade 5":{"Operations & Algebraic Thinking":[{"title":"5.OA.1","body":" Use parentheses, brackets, or braces in numerical expressions, and evaluate expressions with these symbols."},{"title":"5.OA.2","body":" Write simple expressions that record calculations with numbers, and interpret numerical expressions without evaluating them. <i>For example, express the calculation &ldquo;add 8 and 7, then multiply by 2&rdquo; as 2 &times; (8 + 7). Recognize that 3 &times; (18932 + 921) is three times as large as 18932 + 921, without having to calculate the indicated sum or product.<\/i>"},{"title":"5.OA.3","body":" Generate two numerical patterns using two given rules. Identify apparent relationships between corresponding terms. Form ordered pairs consisting of corresponding terms from the two patterns, and graph the ordered pairs on a coordinate plane. <i>For example, given the rule &ldquo;Add 3&rdquo; and the starting number 0, and given the rule &ldquo;Add 6&rdquo; and the starting number 0, generate terms in the resulting sequences, and observe that the terms in one sequence are twice the corresponding terms in the other sequence. Explain informally why this is so.<\/i>"}],"Number & Operations in Base Ten":[{"title":"5.NBT.1","body":" Recognize that in a multi-digit number, a digit in one place represents 10 times as much as it represents in the place to its right and 1\/10 of what it represents in the place to its left."},{"title":"5.NBT.2","body":" Explain patterns in the number of zeros of the product when multiplying a number by powers of 10, and explain patterns in the placement of the decimal point when a decimal is multiplied or divided by a power of 10. Use whole-number exponents to denote powers of 10."},{"title":"5.NBT.3","body":" Read, write, and compare decimals to thousandths.      <ul>          <li>Read and write decimals to thousandths using base-ten numerals, number names, and expanded form, e.g., 347.392 = 3 &times; 100 + 4 &times; 10 + 7 &times; 1 + 3 &times; (1\/10) + 9 &times; (1\/100) + 2 &times; (1\/1000).<\/li>          <li>Compare two decimals to thousandths based on meanings of the digits in each place, using &gt;, =, and &lt; symbols to record the results of comparisons.<\/li>      <\/ul>      "},{"title":"5.NBT.4","body":" Use place value understanding to round decimals to any place."},{"title":"5.NBT.5","body":" Fluently multiply multi-digit whole numbers using the standard algorithm."},{"title":"5.NBT.6","body":" Find whole-number quotients of whole numbers with up to four-digit dividends and two-digit divisors, using strategies based on place value, the properties of operations, and\/or the relationship between multiplication and division. Illustrate and explain the calculation by using equations, rectangular arrays, and\/or area models."},{"title":"5.NBT.7","body":" Add, subtract, multiply, and divide decimals to hundredths, using concrete models or drawings and strategies based on place value, properties of operations, and\/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used."}],"Number & Operations—Fractions":[{"title":"5.NF.1","body":" Add and subtract fractions with unlike denominators (including mixed numbers) by replacing given fractions with equivalent fractions in such a way as to produce an equivalent sum or difference of fractions with like denominators. <i>For example, 2\/3 + 5\/4 = 8\/12 + 15\/12 = 23\/12. (In general, a\/b + c\/d = (ad + bc)\/bd.)<\/i>"},{"title":"5.NF.2","body":" Solve word problems involving addition and subtraction of fractions referring to the same whole, including cases of unlike denominators, e.g., by using visual fraction models or equations to represent the problem. Use benchmark fractions and number sense of fractions to estimate mentally and assess the reasonableness of answers. <i>For example, recognize an incorrect result 2\/5 + 1\/2 = 3\/7, by observing that 3\/7 &lt; 1\/2.<\/i>"},{"title":"5.NF.3","body":" Interpret a fraction as division of the numerator by the denominator (<i>a<\/i>\/<i>b<\/i> = <i>a<\/i> &divide; <i>b<\/i>). Solve word problems involving division of whole numbers leading to answers in the form of fractions or mixed numbers, e.g., by using visual fraction models or equations to represent the problem. <i>For example, interpret 3\/4 as the result of dividing 3 by 4, noting that 3\/4 multiplied by 4 equals 3, and that when 3 wholes are shared equally among 4 people each person has a share of size 3\/4. If 9 people want to share a 50-pound sack of rice equally by weight, how many pounds of rice should each person get? Between what two whole numbers does your answer lie?<\/i>"},{"title":"5.NF.4","body":" Apply and extend previous understandings of multiplication to multiply a fraction or whole number by a fraction.      <ul>          <li>Interpret the product (<i>a<\/i>\/<i>b<\/i>) &times; <i>q<\/i> as a parts of a partition of <i>q<\/i> into <i>b<\/i> equal parts; equivalently, as the result of a sequence of operations<i> a<\/i> &times; <i>q<\/i> &divide; <i>b<\/i>. <i>For example, use a visual fraction model to show (2\/3) &times; 4 = 8\/3, and create a story context for this equation. Do the same with (2\/3) &times; (4\/5) = 8\/15. (In general, (a\/b) &times; (c\/d) = ac\/bd.) <\/i><\/li>          <li>Find the area of a rectangle with fractional side lengths by tiling it with unit squares of the appropriate unit fraction side lengths, and show that the area is the same as would be found by multiplying the side lengths. Multiply fractional side lengths to find areas of rectangles, and represent fraction products as rectangular areas.<\/li>      <\/ul>      "},{"title":"5.NF.5","body":" Interpret multiplication as scaling (resizing), by:      <ul>          <li>Comparing the size of a product to the size of one factor on the basis of the size of the other factor, without performing the indicated multiplication.<\/li>          <li>Explaining why multiplying a given number by a fraction greater than 1 results in a product greater than the given number (recognizing multiplication by whole numbers greater than 1 as a familiar case); explaining why multiplying a given number by a fraction less than 1 results in a product smaller than the given number; and relating the principle of fraction equivalence <i>a<\/i>\/<i>b<\/i> = (<i>n<\/i> &times; <i>a<\/i>)\/(<i>n<\/i> &times; <i>b<\/i>) to the effect of multiplying <i>a<\/i>\/<i>b<\/i> by 1.<\/li>      <\/ul>      "},{"title":"5.NF.6","body":" Solve real world problems involving multiplication of fractions and mixed numbers, e.g., by using visual fraction models or equations to represent the problem."},{"title":"5.NF.7","body":" Apply and extend previous understandings of division to divide unit fractions by whole numbers and whole numbers by unit fractions.<sup>1<\/sup>      <ul>          <li>Interpret division of a unit fraction by a non-zero whole number, and compute such quotients. <i>For example, create a story context for (1\/3) &divide; 4, and use a visual fraction model to show the quotient. Use the relationship between multiplication and division to explain that (1\/3) &divide; 4 = 1\/12 because (1\/12) &times; 4 = 1\/3.<\/i><\/li>          <li>Interpret division of a whole number by a unit fraction, and compute such quotients. <i>For example, create a story context for 4 &divide; (1\/5), and use a visual fraction model to show the quotient. Use the relationship between multiplication and division to explain that 4 &divide; (1\/5) = 20 because 20 &times; (1\/5) = 4. <\/i><\/li>          <li>Solve real world problems involving division of unit fractions by non-zero whole numbers and division of whole numbers by unit fractions, e.g., by using visual fraction models and equations to represent the problem. <i>For example, how much chocolate will each person get if 3 people share 1\/2 lb of chocolate equally? How many 1\/3-cup servings are in 2 cups of raisins?<\/i><\/li>      <\/ul>      "}],"Measurement & Data":[{"title":"5.MD.1","body":" Convert among different-sized standard measurement units within a given measurement system (e.g., convert 5 cm to 0.05 m), and use these conversions in solving multi-step, real world problems."},{"title":"5.MD.2","body":" Make a line plot to display a data set of measurements in fractions of a unit (1\/2, 1\/4, 1\/8). Use operations on fractions for this grade to solve problems involving information presented in line plots. <i>For example, given different measurements of liquid in identical beakers, find the amount of liquid each beaker would contain if the total amount in all the beakers were redistributed equally.<\/i>"},{"title":"5.MD.3","body":" Recognize volume as an attribute of solid figures and understand concepts of volume measurement.      <ul>          <li>A cube with side length 1 unit, called a &ldquo;unit cube,&rdquo; is said to have &ldquo;one cubic unit&rdquo; of volume, and can be used to measure volume.<\/li>          <li>A solid figure which can be packed without gaps or overlaps using <i>n<\/i> unit cubes is said to have a volume of <i>n<\/i> cubic units.<\/li>      <\/ul>      "},{"title":"5.MD.4","body":" Measure volumes by counting unit cubes, using cubic cm, cubic in, cubic ft, and improvised units."}],"Geometry":[{"title":"5.G.1","body":" Use a pair of perpendicular number lines, called axes, to define a coordinate system, with the intersection of the lines (the origin) arranged to coincide with the 0 on each line and a given point in the plane located by using an ordered pair of numbers, called its coordinates. Understand that the first number indicates how far to travel from the origin in the direction of one axis, and the second number indicates how far to travel in the direction of the second axis, with the convention that the names of the two axes and the coordinates correspond (e.g., <i>x<\/i>-axis and <i>x<\/i>-coordinate, <i>y<\/i>-axis and<i> y<\/i>-coordinate)."},{"title":"5.G.2","body":" Represent real world and mathematical problems by graphing points in the first quadrant of the coordinate plane, and interpret coordinate values of points in the context of the situation."},{"title":"5.G.3","body":" Understand that attributes belonging to a category of two-dimensional figures also belong to all subcategories of that category. For example, all rectangles have four right angles and squares are rectangles, so all squares have four right angles."},{"title":"5.G.4","body":" Classify two-dimensional figures in a hierarchy based on properties."}]},"Grade 6":{"Ratios & Proportional Relationships":[{"title":"6.RP.1","body":" Understand the concept of a ratio and use ratio language to describe a ratio relationship between two quantities. <i>For example, &ldquo;The ratio of wings to beaks in the bird house at the zoo was 2:1, because for every 2 wings there was 1 beak.&rdquo; &ldquo;For every vote candidate A received, candidate C received nearly three votes.&rdquo; <\/i>"},{"title":"6.RP.2","body":" Understand the concept of a unit rate a\/b associated with a ratio a:b with b &ne; 0, and use rate language in the context of a ratio relationship. <i>For example, &ldquo;This recipe has a ratio of 3 cups of flour to 4 cups of sugar, so there is 3\/4 cup of flour for each cup of sugar.&rdquo; &ldquo;We paid $75 for 15 hamburgers, which is a rate of $5 per hamburger.&rdquo;<\/i><sup>1<\/sup>"},{"title":"6.RP.3","body":" Use ratio and rate reasoning to solve real-world and mathematical problems, e.g., by reasoning about tables of equivalent ratios, tape diagrams, double number line diagrams, or equations.      <ul>          <li>Make tables of equivalent ratios relating quantities with whole-number measurements, find missing values in the tables, and plot the pairs of values on the coordinate plane. Use tables to compare ratios.<\/li>          <li>Solve unit rate problems including those involving unit pricing and constant speed. <i>For example, if it took 7 hours to mow 4 lawns, then at that rate, how many lawns could be mowed in 35 hours? At what rate were lawns being mowed?<\/i><\/li>          <li>Find a percent of a quantity as a rate per 100 (e.g., 30% of a quantity means 30\/100 times the quantity); solve problems involving finding the whole, given a part and the percent.<\/li>          <li>Use ratio reasoning to convert measurement units; manipulate and transform units appropriately when multiplying or dividing quantities.<\/li>      <\/ul>      "}],"The Number System":[{"title":"6.NS.1","body":" Interpret and compute quotients of fractions, and solve word problems involving division of fractions by fractions, e.g., by using visual fraction models and equations to represent the problem. <i>For example, create a story context for (2\/3) &divide; (3\/4) and use a visual fraction model to show the quotient; use the relationship between multiplication and division to explain that (2\/3) &divide; (3\/4) = 8\/9 because 3\/4 of 8\/9 is 2\/3. (In general, (a\/b) &divide; (c\/d) = ad\/bc.) How much chocolate will each person get if 3 people share 1\/2 lb of chocolate equally? How many 3\/4-cup servings are in 2\/3 of a cup of yogurt? How wide is a rectangular strip of land with length 3\/4 mi and area 1\/2 square mi? Compute fluently with multi-digit numbers and find common factors and multiples.<\/i>"},{"title":"6.NS.2","body":" Fluently divide multi-digit numbers using the standard algorithm."},{"title":"6.NS.3","body":" Fluently add, subtract, multiply, and divide multi-digit decimals using the standard algorithm for each operation."},{"title":"6.NS.4","body":" Find the greatest common factor of two whole numbers less than or equal to 100 and the least common multiple of two whole numbers less than or equal to 12. Use the distributive property to express a sum of two whole numbers 1&ndash;100 with a common factor as a multiple of a sum of two whole numbers with no common factor. <i>For example, express 36 + 8 as 4 (9 + 2). Apply and extend previous understandings of numbers to the system of rational numbers.<\/i>"},{"title":"6.NS.5","body":" Understand that positive and negative numbers are used together to describe quantities having opposite directions or values (e.g., temperature above\/below zero, elevation above\/below sea level, credits\/debits, positive\/negative electric charge); use positive and negative numbers to represent quantities in real-world contexts, explaining the meaning of 0 in each situation."},{"title":"6.NS.6","body":" Understand a rational number as a point on the number line. Extend number line diagrams and coordinate axes familiar from previous grades to represent points on the line and in the plane with negative number coordinates.      <ul>          <li>Recognize opposite signs of numbers as indicating locations on opposite sides of 0 on the number line; recognize that the opposite of the opposite of a number is the number itself, e.g., &ndash;(&ndash;3) = 3, and that 0 is its own opposite.<\/li>          <li>Understand signs of numbers in ordered pairs as indicating locations in quadrants of the coordinate plane; recognize that when two ordered pairs differ only by signs, the locations of the points are related by reflections across one or both axes.<\/li>          <li>Find and position integers and other rational numbers on a horizontal or vertical number line diagram; find and position pairs of integers and other rational numbers on a coordinate plane.<\/li>      <\/ul>      "},{"title":"6.NS.7","body":" Understand ordering and absolute value of rational numbers.      <ul>          <li>Interpret statements of inequality as statements about the relative position of two numbers on a number line diagram. <i>For example, interpret &ndash;3 &gt; &ndash;7 as a statement that &ndash;3 is located to the right of &ndash;7 on a number line oriented from left to right.<\/i><\/li>          <li>Write, interpret, and explain statements of order for rational numbers in real-world contexts. <i>For example, write &ndash;3 <sup>o<\/sup>C &gt; &ndash;7 <sup>o<\/sup>C to express the fact that &ndash;3 <sup>o<\/sup>C is warmer than &ndash;7 <sup>o<\/sup>C. <\/i><\/li>          <li>Understand the absolute value of a rational number as its distance from 0 on the number line; interpret absolute value as magnitude for a positive or negative quantity in a real-world situation. <i>For example, for an account balance of &ndash;30 dollars, write |&ndash;30| = 30 to describe the size of the debt in dollars.<\/i><\/li>          <li>Distinguish comparisons of absolute value from statements about order. <i>For example, recognize that an account balance less than &ndash;30 dollars represents a debt greater than 30 dollars.<\/i><\/li>      <\/ul>      "},{"title":"6.NS.8","body":" Solve real-world and mathematical problems by graphing points in all four quadrants of the coordinate plane. Include use of coordinates and absolute value to find distances between points with the same first coordinate or the same second coordinate."}],"Expressions & Equations":[{"title":"6.EE.1","body":" Write and evaluate numerical expressions involving whole-number exponents."},{"title":"6.EE.2","body":" Write, read, and evaluate expressions in which letters stand for numbers.      <ul>          <li>Write expressions that record operations with numbers and with letters standing for numbers. <i>For example, express the calculation &ldquo;Subtract y from 5&rdquo; as 5 &ndash; y.<\/i><\/li>          <li>Identify parts of an expression using mathematical terms (sum, term, product, factor, quotient, coefficient); view one or more parts of an expression as a single entity. <i>For example, describe the expression 2 (8 + 7) as a product of two factors; view (8 + 7) as both a single entity and a sum of two terms.<\/i><\/li>          <li>Evaluate expressions at specific values of their variables. Include expressions that arise from formulas used in real-world problems. Perform arithmetic operations, including those involving whole-number exponents, in the conventional order when there are no parentheses to specify a particular order (Order of Operations). <i>For example, use the formulas V = s<sup>3<\/sup> and A = 6 s<sup>2<\/sup> to find the volume and surface area of a cube with sides of length s = 1\/2.<\/i><\/li>      <\/ul>      "},{"title":"6.EE.3","body":" Apply the properties of operations to generate equivalent expressions. <i>For example, apply the distributive property to the expression 3 (2 + x) to produce the equivalent expression 6 + 3x; apply the distributive property to the expression 24x + 18y to produce the equivalent expression 6 (4x + 3y); apply properties of operations to y + y + y to produce the equivalent expression 3y.<\/i>"},{"title":"6.EE.4","body":" Identify when two expressions are equivalent (i.e., when the two expressions name the same number regardless of which value is substituted into them). <i>For example, the expressions y + y + y and 3y are equivalent because they name the same number regardless of which number y stands for. Reason about and solve one-variable equations and inequalities.<\/i>"},{"title":"6.EE.5","body":" Understand solving an equation or inequality as a process of answering a question: which values from a specified set, if any, make the equation or inequality true? Use substitution to determine whether a given number in a specified set makes an equation or inequality true."},{"title":"6.EE.6","body":" Use variables to represent numbers and write expressions when solving a real-world or mathematical problem; understand that a variable can represent an unknown number, or, depending on the purpose at hand, any number in a specified set."},{"title":"6.EE.7","body":" Solve real-world and mathematical problems by writing and solving equations of the form <i>x<\/i> + <i>p<\/i> = <i>q<\/i> and<i> px<\/i> = <i>q<\/i> for cases in which <i>p<\/i>, <i>q<\/i> and <i>x<\/i> are all nonnegative rational numbers."},{"title":"6.EE.8","body":" Write an inequality of the form <i>x<\/i> &gt; <i>c<\/i> or <i>x<\/i> &lt; <i>c<\/i> to represent a constraint or condition in a real-world or mathematical problem. Recognize that inequalities of the form <i>x<\/i> &gt; <i>c<\/i> or<i> x<\/i> &lt; c have infinitely many solutions; represent solutions of such inequalities on number line diagrams."},{"title":"6.EE.9","body":"Use variables to represent two quantities in a real-world problem that change in relationship to one another; write an equation to express one quantity, thought of as the dependent variable, in terms of the other quantity, thought of as the independent variable. Analyze the relationship between the dependent and independent variables using graphs and tables, and relate these to the equation. For example, in a problem involving motion at constant speed, list and graph ordered pairs of distances and times, and write the equation d = 65t to represent the relationship between distance and time."}],"Geometry":[{"title":"6.G.1","body":" Find the area of right triangles, other triangles, special quadrilaterals, and polygons by composing into rectangles or decomposing into triangles and other shapes; apply these techniques in the context of solving real-world and mathematical problems."},{"title":"6.G.2","body":" Find the volume of a right rectangular prism with fractional edge lengths by packing it with unit cubes of the appropriate unit fraction edge lengths, and show that the volume is the same as would be found by multiplying the edge lengths of the prism. Apply the formulas <i>V = l w h<\/i> and <i>V = b h<\/i> to find volumes of right rectangular prisms with fractional edge lengths in the context of solving real-world and mathematical problems."},{"title":"6.G.3","body":" Draw polygons in the coordinate plane given coordinates for the vertices; use coordinates to find the length of a side joining points with the same first coordinate or the same second coordinate. Apply these techniques in the context of solving real-world and mathematical problems."},{"title":"6.G.4","body":" Represent three-dimensional figures using nets made up of rectangles and triangles, and use the nets to find the surface area of these figures. Apply these techniques in the context of solving real-world and mathematical problems."}],"Statistics & Probability":[{"title":"6.SP.1","body":" Recognize a statistical question as one that anticipates variability in the data related to the question and accounts for it in the answers. <i>For example, &ldquo;How old am I?&rdquo; is not a statistical question, but &ldquo;How old are the students in my school?&rdquo; is a statistical question because one anticipates variability in students&rsquo; ages.<\/i>"},{"title":"6.SP.2","body":" Understand that a set of data collected to answer a statistical question has a distribution which can be described by its center, spread, and overall shape."},{"title":"6.SP.3","body":" Recognize that a measure of center for a numerical data set summarizes all of its values with a single number, while a measure of variation describes how its values vary with a single number."},{"title":"6.SP.4","body":" Display numerical data in plots on a number line, including dot plots, histograms, and box plots."},{"title":"6.SP.5","body":" Summarize numerical data sets in relation to their context, such as by:      <ul>          <li>Reporting the number of observations.<\/li>          <li>Describing the nature of the attribute under investigation, including how it was measured and its units of measurement.<\/li>          <li>Giving quantitative measures of center (median and\/or mean) and variability (interquartile range and\/or mean absolute deviation), as well as describing any overall pattern and any striking deviations from the overall pattern with reference to the context in which the data were gathered.<\/li>          <li>Relating the choice of measures of center and variability to the shape of the data distribution and the context in which the data were gathered.<\/li>      <\/ul>      "}]},"Grade 7":{"Ratios & Proportional Relationships":[{"title":"7.RP.1","body":" Compute unit rates associated with ratios of fractions, including ratios of lengths, areas and other quantities measured in like or different units. <i>For example, if a person walks 1\/2 mile in each 1\/4 hour, compute the unit rate as the complex fraction <sup>1\/2<\/sup>\/<sub>1\/4<\/sub> miles per hour, equivalently 2 miles per hour.<\/i>"},{"title":"7.RP.2","body":" Recognize and represent proportional relationships between quantities.      <ul>          <li>Decide whether two quantities are in a proportional relationship, e.g., by testing for equivalent ratios in a table or graphing on a coordinate plane and observing whether the graph is a straight line through the origin.<\/li>          <li>Identify the constant of proportionality (unit rate) in tables, graphs, equations, diagrams, and verbal descriptions of proportional relationships.<\/li>          <li>Represent proportional relationships by equations. <i>For example, if total cost t is proportional to the number n of items purchased at a constant price p, the relationship between the total cost and the number of items can be expressed as t = pn.<\/i><\/li>          <li>Explain what a point (<i>x<\/i>, <i>y<\/i>) on the graph of a proportional relationship means in terms of the situation, with special attention to the points (0, 0) and (1, <i>r<\/i>) where r is the unit rate.<\/li>      <\/ul>      "},{"title":"7.RP.3","body":" Use proportional relationships to solve multistep ratio and percent problems. Examples: simple interest, tax, markups and markdowns, gratuities and commissions, fees, percent increase and decrease, percent error."}],"The Number System":[{"title":"7.NS.1","body":" Apply and extend previous understandings of addition and subtraction to add and subtract rational numbers; represent addition and subtraction on a horizontal or vertical number line diagram.      <ul>          <li>Describe situations in which opposite quantities combine to make 0. <i>For example, a hydrogen atom has 0 charge because its two constituents are oppositely charged.<\/i><\/li>          <li>Understand <i>p<\/i> + <i>q<\/i> as the number located a distance |<i>q<\/i>| from <i>p<\/i>, in the positive or negative direction depending on whether <i>q<\/i> is positive or negative. Show that a number and its opposite have a sum of 0 (are additive inverses). Interpret sums of rational numbers by describing real-world contexts.<\/li>          <li>Understand subtraction of rational numbers as adding the additive inverse, <i>p<\/i> &ndash; <i>q<\/i> = <i>p<\/i> + (&ndash;<i>q<\/i>). Show that the distance between two rational numbers on the number line is the absolute value of their difference, and apply this principle in real-world contexts.<\/li>          <li>Apply properties of operations as strategies to add and subtract rational numbers.<\/li>      <\/ul>      "},{"title":"7.NS.2","body":" Apply and extend previous understandings of multiplication and division and of fractions to multiply and divide rational numbers.      <ul>          <li>Understand that multiplication is extended from fractions to rational numbers by requiring that operations continue to satisfy the properties of operations, particularly the distributive property, leading to products such as (&ndash;1)(&ndash;1) = 1 and the rules for multiplying signed numbers. Interpret products of rational numbers by describing real-world contexts.<\/li>          <li>Understand that integers can be divided, provided that the divisor is not zero, and every quotient of integers (with non-zero divisor) is a rational number. If <i>p<\/i> and <i>q<\/i> are integers, then &ndash;(<i>p<\/i>\/<i>q<\/i>) = (&ndash;<i>p<\/i>)\/<i>q<\/i> = <i>p<\/i>\/(&ndash;<i>q<\/i>). Interpret quotients of rational numbers by describing real-world contexts.<\/li>          <li>Apply properties of operations as strategies to multiply and divide rational numbers.<\/li>          <li>Convert a rational number to a decimal using long division; know that the decimal form of a rational number terminates in 0s or eventually repeats.<\/li>      <\/ul>      "},{"title":"7.NS.3","body":" Solve real-world and mathematical problems involving the four operations with rational numbers.<sup>1<\/sup>"}],"Expressions & Equations":[{"title":"7.EE.1","body":" Apply properties of operations as strategies to add, subtract, factor, and expand linear expressions with rational coefficients."},{"title":"7.EE.2","body":" Understand that rewriting an expression in different forms in a problem context can shed light on the problem and how the quantities in it are related. <i>For example, a + 0.05a = 1.05a means that &ldquo;increase by 5%&rdquo; is the same as &ldquo;multiply by 1.05.&rdquo;<\/i>"},{"title":"7.EE.3","body":" Solve multi-step real-life and mathematical problems posed with positive and negative rational numbers in any form (whole numbers, fractions, and decimals), using tools strategically. Apply properties of operations to calculate with numbers in any form; convert between forms as appropriate; and assess the reasonableness of answers using mental computation and estimation strategies. <i>For example: If a woman making $25 an hour gets a 10% raise, she will make an additional 1\/10 of her salary an hour, or $2.50, for a new salary of $27.50. If you want to place a towel bar 9 3\/4 inches long in the center of a door that is 27 1\/2 inches wide, you will need to place the bar about 9 inches from each edge; this estimate can be used as a check on the exact computation. <\/i>"},{"title":"7.EE.4","body":" Use variables to represent quantities in a real-world or mathematical problem, and construct simple equations and inequalities to solve problems by reasoning about the quantities.      <ul>          <li>Solve word problems leading to equations of the form <i>px<\/i> + <i>q<\/i> = <i>r<\/i> and <i>p<\/i>(<i>x<\/i> + <i>q<\/i>) = <i>r<\/i>, where <i>p<\/i>, <i>q<\/i>, and <i>r<\/i> are specific rational numbers. Solve equations of these forms fluently. Compare an algebraic solution to an arithmetic solution, identifying the sequence of the operations used in each approach. <i>For example, the perimeter of a rectangle is 54 cm. Its length is 6 cm. What is its width? <\/i><\/li>          <li>Solve word problems leading to inequalities of the form <i>px<\/i> + <i>q<\/i> &gt; <i>r<\/i> or <i>px<\/i> + <i>q<\/i> &lt; <i>r<\/i>, where <i>p<\/i>, <i>q<\/i>, and <i>r<\/i> are specific rational numbers. Graph the solution set of the inequality and interpret it in the context of the problem. <i>For example: As a salesperson, you are paid $50 per week plus $3 per sale. This week you want your pay to be at least $100. Write an inequality for the number of sales you need to make, and describe the solutions.<\/i><\/li>      <\/ul>      "}],"Geometry":[{"title":"7.G.1","body":" Solve problems involving scale drawings of geometric figures, including computing actual lengths and areas from a scale drawing and reproducing a scale drawing at a different scale."},{"title":"7.G.2","body":" Draw (freehand, with ruler and protractor, and with technology) geometric shapes with given conditions. Focus on constructing triangles from three measures of angles or sides, noticing when the conditions determine a unique triangle, more than one triangle, or no triangle."},{"title":"7.G.3","body":" Describe the two-dimensional figures that result from slicing three-dimensional figures, as in plane sections of right rectangular prisms and right rectangular pyramids."},{"title":"7.G.4","body":" Know the formulas for the area and circumference of a circle and use them to solve problems; give an informal derivation of the relationship between the circumference and area of a circle."},{"title":"7.G.5","body":" Use facts about supplementary, complementary, vertical, and adjacent angles in a multi-step problem to write and solve simple equations for an unknown angle in a figure."},{"title":"7.G.6","body":" Solve real-world and mathematical problems involving area, volume and surface area of two- and three-dimensional objects composed of triangles, quadrilaterals, polygons, cubes, and right prisms."}],"Statistics & Probability":[{"title":"7.SP.1","body":" Understand that statistics can be used to gain information about a population by examining a sample of the population; generalizations about a population from a sample are valid only if the sample is representative of that population. Understand that random sampling tends to produce representative samples and support valid inferences."},{"title":"7.SP.2","body":" Use data from a random sample to draw inferences about a population with an unknown characteristic of interest. Generate multiple samples (or simulated samples) of the same size to gauge the variation in estimates or predictions. <i>For example, estimate the mean word length in a book by randomly sampling words from the book; predict the winner of a school election based on randomly sampled survey data. Gauge how far off the estimate or prediction might be.<\/i>"},{"title":"7.SP.3","body":" Informally assess the degree of visual overlap of two numerical data distributions with similar variabilities, measuring the difference between the centers by expressing it as a multiple of a measure of variability. <i>For example, the mean height of players on the basketball team is 10 cm greater than the mean height of players on the soccer team, about twice the variability (mean absolute deviation) on either team; on a dot plot, the separation between the two distributions of heights is noticeable.<\/i>"},{"title":"7.SP.4","body":" Use measures of center and measures of variability for numerical data from random samples to draw informal comparative inferences about two populations. <i>For example, decide whether the words in a chapter of a seventh-grade science book are generally longer than the words in a chapter of a fourth-grade science book.<\/i>"},{"title":"7.SP.5","body":" Understand that the probability of a chance event is a number between 0 and 1 that expresses the likelihood of the event occurring. Larger numbers indicate greater likelihood. A probability near 0 indicates an unlikely event, a probability around 1\/2 indicates an event that is neither unlikely nor likely, and a probability near 1 indicates a likely event."},{"title":"7.SP.5","body":" Understand that the probability of a chance event is a number between 0 and 1 that expresses the likelihood of the event occurring. Larger numbers indicate greater likelihood. A probability near 0 indicates an unlikely event, a probability around 1\/2 indicates an event that is neither unlikely nor likely, and a probability near 1 indicates a likely event."},{"title":"7.SP.6","body":" Approximate the probability of a chance event by collecting data on the chance process that produces it and observing its long-run relative frequency, and predict the approximate relative frequency given the probability. <i>For example, when rolling a number cube 600 times, predict that a 3 or 6 would be rolled roughly 200 times, but probably not exactly 200 times.<\/i>"},{"title":"7.SP.7","body":" Develop a probability model and use it to find probabilities of events. Compare probabilities from a model to observed frequencies; if the agreement is not good, explain possible sources of the discrepancy.      <ul>          <li>Develop a uniform probability model by assigning equal probability to all outcomes, and use the model to determine probabilities of events. <i>For example, if a student is selected at random from a class, find the probability that Jane will be selected and the probability that a girl will be selected. <\/i><\/li>          <li>Develop a probability model (which may not be uniform) by observing frequencies in data generated from a chance process. <i>For example, find the approximate probability that a spinning penny will land heads up or that a tossed paper cup will land open-end down. Do the outcomes for the spinning penny appear to be equally likely based on the observed frequencies?<\/i><\/li>      <\/ul>      "},{"title":"7.SP.8","body":" Find probabilities of compound events using organized lists, tables, tree diagrams, and simulation.      <ul>          <li>Understand that, just as with simple events, the probability of a compound event is the fraction of outcomes in the sample space for which the compound event occurs.<\/li>          <li>Represent sample spaces for compound events using methods such as organized lists, tables and tree diagrams. For an event described in everyday language (e.g., &ldquo;rolling double sixes&rdquo;), identify the outcomes in the sample space which compose the event.<\/li>          <li>Design and use a simulation to generate frequencies for compound events. <i>For example, use random digits as a simulation tool to approximate the answer to the question: If 40% of donors have type A blood, what is the probability that it will take at least 4 donors to find one with type A blood?<\/i><\/li>      <\/ul>      "}]},"Grade 8":{"The Number System":[{"title":"8.NS.1","body":" Know that numbers that are not rational are called irrational. Understand informally that every number has a decimal expansion; for rational numbers show that the decimal expansion repeats eventually, and convert a decimal expansion which repeats eventually into a rational number."},{"title":"8.NS.2","body":" Use rational approximations of irrational numbers to compare the size of irrational numbers, locate them approximately on a number line diagram, and estimate the value of expressions (e.g., &pi;<sup>2<\/sup>). <i>For example, by truncating the decimal expansion of &radic;2, show that &radic;2 is between 1 and 2, then between 1.4 and 1.5, and explain how to continue on to get better approximations.\f<\/i>"}],"Expressions & Equations":[{"title":"8.EE.1","body":" Know and apply the properties of integer exponents to generate equivalent numerical expressions. For example, 3<sup>2<\/sup>&nbsp;&times;&nbsp;3<sup>&ndash;5<\/sup> = 3<sup>&ndash;3<\/sup> = 1\/3<sup>3<\/sup> = 1\/27."},{"title":"8.EE.2","body":" Use square root and cube root symbols to represent solutions to equations of the form <i>x<\/i><sup>2<\/sup> = <i>p<\/i> and <i>x<\/i><sup>3<\/sup> = p, where <i>p<\/i> is a positive rational number. Evaluate square roots of small perfect squares and cube roots of small perfect cubes. Know that &radic;2 is irrational."},{"title":"8.EE.3","body":" Use numbers expressed in the form of a single digit times a whole-number power of 10 to estimate very large or very small quantities, and to express how many times as much one is than the other. <em>For example, estimate the population of the United States as 3 times 10<sup>8<\/sup> and the population of the world as 7 times 10<sup>9<\/sup>, and determine that the world population is more than 20 times larger.<\/em>"},{"title":"8.EE.4","body":" Perform operations with numbers expressed in scientific notation, including problems where both decimal and scientific notation are used. Use scientific notation and choose units of appropriate size for measurements of very large or very small quantities (e.g., use millimeters per year for seafloor spreading). Interpret scientific notation that has been generated by technology."},{"title":"8.EE.5","body":" Graph proportional relationships, interpreting the unit rate as the slope of the graph. Compare two different proportional relationships represented in different ways. For example, compare a distance-time graph to a distance-time equation to determine which of two moving objects has greater speed."},{"title":"8.EE.6","body":" Use similar triangles to explain why the slope m is the same between any two distinct points on a non-vertical line in the coordinate plane; derive the equation y = mx for a line through the origin and the equation <i>y<\/i> = <i>mx<\/i> + <i>b<\/i> for a line intercepting the vertical axis at <i>b<\/i>."},{"title":"8.EE.7","body":" Solve linear equations in one variable.      <ul>          <li>Give examples of linear equations in one variable with one solution, infinitely many solutions, or no solutions. Show which of these possibilities is the case by successively transforming the given equation into simpler forms, until an equivalent equation of the form <i>x<\/i> = <i>a<\/i>, <i>a<\/i> = <i>a<\/i>, or <i>a<\/i> = <i>b<\/i> results (where <i>a<\/i> and <i>b<\/i> are different numbers).<\/li>          <li>Solve linear equations with rational number coefficients, including equations whose solutions require expanding expressions using the distributive property and collecting like terms.<\/li>      <\/ul>      "},{"title":"8.EE.8","body":" Analyze and solve pairs of simultaneous linear equations.      <ul>          <li>Understand that solutions to a system of two linear equations in two variables correspond to points of intersection of their graphs, because points of intersection satisfy both equations simultaneously.<\/li>          <li>Solve systems of two linear equations in two variables algebraically, and estimate solutions by graphing the equations. Solve simple cases by inspection. <i>For example, 3x + 2y = 5 and 3x + 2y = 6 have no solution because 3x + 2y cannot simultaneously be 5 and 6.<\/i><\/li>          <li>Solve real-world and mathematical problems leading to two linear equations in two variables. <i>For example, given coordinates for two pairs of points, determine whether the line through the first pair of points intersects the line through the second pair.<\/i><\/li>      <\/ul>      "}],"Functions":[{"title":"8.F.1","body":" Understand that a function is a rule that assigns to each input exactly one output. The graph of a function is the set of ordered pairs consisting of an input and the corresponding output.<sup>1<\/sup>"},{"title":"8.F.2","body":" Compare properties of two functions each represented in a different way (algebraically, graphically, numerically in tables, or by verbal descriptions). <i>For example, given a linear function represented by a table of values and a linear function represented by an algebraic expression, determine which function has the greater rate of change.<\/i>"},{"title":"8.F.3","body":" Interpret the equation <i>y = mx + b<\/i> as defining a linear function, whose graph is a straight line; give examples of functions that are not linear. <i>For example, the function A = s<sup>2<\/sup> giving the area of a square as a function of its side length is not linear because its graph contains the points (1,1), (2,4) and (3,9), which are not on a straight line. <\/i>"},{"title":"8.F.4","body":" Construct a function to model a linear relationship between two quantities. Determine the rate of change&nbsp; and initial value of the function from a description of a relationship or from two (<i>x, y<\/i>) values, including reading these from a table or from a graph. Interpret the rate of change and initial value of a linear function in terms of the situation it models, and in terms of its graph or a table of values."},{"title":"8.F.5","body":" Describe qualitatively the functional relationship between two quantities by analyzing a graph (e.g., where the function is increasing or decreasing, linear or nonlinear). Sketch a graph that exhibits the qualitative features of a function that has been described verbally."}],"Geometry":[{"title":"8.G.1","body":" Verify experimentally the properties of rotations, reflections, and translations:      <ul>          <li>a. Lines are taken to lines, and line segments to line segments of the same length.<\/li>          <li>b. Angles are taken to angles of the same measure.<\/li>          <li>c. Parallel lines are taken to parallel lines.<\/li>      <\/ul>      "},{"title":"8.G.2","body":" Understand that a two-dimensional figure is congruent to another if the second can be obtained from the first by a sequence of rotations, reflections, and translations; given two congruent figures, describe a sequence that exhibits the congruence between them."},{"title":"8.G.3","body":" Describe the effect of dilations, translations, rotations, and reflections on two-dimensional figures using coordinates."},{"title":"8.G.4","body":" Understand that a two-dimensional figure is similar to another if the second can be obtained from the first by a sequence of rotations, reflections, translations, and dilations; given two similar two-dimensional figures, describe a sequence that exhibits the similarity between them."},{"title":"8.G.5","body":" Use informal arguments to establish facts about the angle sum and exterior angle of triangles, about the angles created when parallel lines are cut by a transversal, and the angle-angle criterion for similarity of triangles. <i>For example, arrange three copies of the same triangle so that the sum of the three angles appears to form a line, and give an argument in terms of transversals why this is so.<\/i>"},{"title":"8.G.6","body":" Explain a proof of the Pythagorean Theorem and its converse."},{"title":"8.G.7","body":" Apply the Pythagorean Theorem to determine unknown side lengths in right triangles in real-world and mathematical problems in two and three dimensions."},{"title":"8.G.8","body":" Apply the Pythagorean Theorem to find the distance between two points in a coordinate system."},{"title":"8.G.9","body":" Know the formulas for the volumes of cones, cylinders, and spheres and use them to solve real-world and mathematical problems."}],"Statistics & Probability":[{"title":"8.SP.1","body":" Construct and interpret scatter plots for bivariate measurement data to investigate patterns of association between two quantities. Describe patterns such as clustering, outliers, positive or negative association, linear association, and nonlinear association."},{"title":"8.SP.2","body":" Know that straight lines are widely used to model relationships between two quantitative variables. For scatter plots that suggest a linear association, informally fit a straight line, and informally assess the model fit by judging the closeness of the data points to the line."},{"title":"8.SP.3","body":" Use the equation of a linear model to solve problems in the context of bivariate measurement data, interpreting the slope and intercept. <i>For example, in a linear model for a biology experiment, interpret a slope of 1.5 cm\/hr as meaning that an additional hour of sunlight each day is associated with an additional 1.5 cm in mature plant height.<\/i>"},{"title":"8.SP.4","body":" Understand that patterns of association can also be seen in bivariate categorical data by displaying frequencies and relative frequencies in a two-way table. Construct and interpret a two-way table summarizing data on two categorical variables collected from the same subjects. Use relative frequencies calculated for rows or columns to describe possible association between the two variables. <i>For example, collect data from students in your class on whether or not they have a curfew on school nights and whether or not they have assigned chores at home. Is there evidence that those who have a curfew also tend to have chores?<\/i>"}]},"High School: Number & Quantity":{"The Real Number System":[{"title":"N-RN.1","body":" Explain how the definition of the meaning of rational exponents follows from extending the properties of integer exponents to those values, allowing for a notation for radicals in terms of rational exponents. <i>For example, we define 5<sup>1\/3<\/sup> to be the cube root of 5 because we want (5<sup>1\/3<\/sup>)<sup>3<\/sup> = 5<sup>(1\/3)3<\/sup> to hold, so (5<sup>1\/3<\/sup>)<sup>3<\/sup> must equal 5.<\/i>"},{"title":"N-RN.2","body":" Rewrite expressions involving radicals and rational exponents using the properties of exponents."},{"title":"N-RN.3","body":" Explain why the sum or product of two rational numbers is rational; that the sum of a rational number and an irrational number is irrational; and that the product of a nonzero rational number and an irrational number is irrational."}],"Quantities*":[{"title":"N-Q.1","body":" Use units as a way to understand problems and to guide the solution of multi-step problems; choose and interpret units consistently in formulas; choose and interpret the scale and the origin in graphs and data displays."},{"title":"N-Q.2","body":" Define appropriate quantities for the purpose of descriptive modeling."},{"title":"N-Q.3","body":" Choose a level of accuracy appropriate to limitations on measurement when reporting quantities."}],"The Complex Number System":[{"title":"N-CN.1","body":" Know there is a complex number <i>i<\/i> such that <i>i<\/i><sup>2<\/sup> = &ndash;1, and every complex number has the form <i>a + bi<\/i> with <i>a<\/i> and <i>b<\/i> real."},{"title":"N-CN.2","body":" Use the relation <i>i<\/i><sup>2<\/sup> = &ndash;1 and the commutative, associative, and distributive properties to add, subtract, and multiply complex numbers."},{"title":"N-CN.3","body":" (+) Find the conjugate of a complex number; use conjugates to find moduli and quotients of complex numbers."},{"title":"N-CN.4","body":" (+) Represent complex numbers on the complex plane in rectangular and polar form (including real and imaginary numbers), and explain why the rectangular and polar forms of a given complex number represent the same number."},{"title":"N-CN.5","body":" (+) Represent addition, subtraction, multiplication, and conjugation of complex numbers geometrically on the complex plane; use properties of this representation for computation. <i>For example, (-1 + &radic;3 i)<sup>3<\/sup> = 8 because (-1 + &radic;3 i) has modulus 2 and argument 120&deg;.<\/i>"},{"title":"N-CN.6","body":" (+) Calculate the distance between numbers in the complex plane as the modulus of the difference, and the midpoint of a segment as the average of the numbers at its endpoints."},{"title":"N-CN.7","body":" Solve quadratic equations with real coefficients that have complex solutions."},{"title":"N-CN.8","body":" (+) Extend polynomial identities to the complex numbers. <i>For example, rewrite x<sup>2<\/sup> + 4 as (x + 2i)(x &ndash; 2i).<\/i>"},{"title":"N-CN.9","body":" (+) Know the Fundamental Theorem of Algebra; show that it is true for quadratic polynomials."}],"Vector & Matrix Quantities":[{"title":"N-VM.1","body":" (+) Recognize vector quantities as having both magnitude and direction. Represent vector quantities by directed line segments, and use appropriate symbols for vectors and their magnitudes (e.g., <b><i>v<\/i><\/b>, |<b><i>v<\/i><\/b>|, ||<b><i>v<\/i><\/b>||, <i>v<\/i>)."},{"title":"N-VM.2","body":" (+) Find the components of a vector by subtracting the coordinates of an initial point from the coordinates of a terminal point."},{"title":"N-VM.3","body":" (+) Solve problems involving velocity and other quantities that can be represented by vectors."},{"title":"N-VM.4","body":" (+) Add and subtract vectors.      <ul>          <li>Add vectors end-to-end, component-wise, and by the parallelogram rule. Understand that the magnitude of a sum of two vectors is typically not the sum of the magnitudes.<\/li>          <li>Given two vectors in magnitude and direction form, determine the magnitude and direction of their sum.<\/li>          <li>Understand vector subtraction <b><i>v<\/i><\/b> &ndash; <b><i>w<\/i><\/b> as <b><i>v<\/i><\/b> + (&ndash;<b><i>w<\/i><\/b>), where &ndash;<b><i>w<\/i><\/b> is the additive inverse of <b><i>w<\/i><\/b>, with the same magnitude as <b><i>w<\/i><\/b> and pointing in the opposite direction. Represent vector subtraction graphically by connecting the tips in the appropriate order, and perform vector subtraction component-wise.<\/li>      <\/ul>      "},{"title":"N-VM.5","body":" (+) Multiply a vector by a scalar.      <ul>          <li>Represent scalar multiplication graphically by scaling vectors and possibly reversing their direction; perform scalar multiplication component-wise, e.g., as <i>c<\/i>(<i>v<\/i><sub><i>x<\/i><\/sub>, <i>v<\/i><sub><i>y<\/i><\/sub>) = (<i>cv<\/i><sub><i>x<\/i><\/sub>, <i>cv<\/i><sub><i>y<\/i><\/sub>).<\/li>          <li>Compute the magnitude of a scalar multiple <i>c<\/i><b><i>v<\/i><\/b> using ||<i>c<\/i><b><i>v<\/i><\/b>|| = |<i>c<\/i>|<b><i>v<\/i><\/b>. Compute the direction of <i>c<\/i><b><i>v<\/i><\/b> knowing that when |<i>c<\/i>|<b><i>v<\/i><\/b> &ne; 0, the direction of <i>c<\/i><b><i>v<\/i><\/b> is either along <b><i>v<\/i><\/b> (for <i>c<\/i> &gt; 0) or against <b><i>v<\/i><\/b> (for <i>c<\/i> &lt; 0).<\/li>      <\/ul>      "},{"title":"N-VM.6","body":" (+) Use matrices to represent and manipulate data, e.g., to represent payoffs or incidence relationships in a network."},{"title":"N-VM.7","body":" (+) Multiply matrices by scalars to produce new matrices, e.g., as when all of the payoffs in a game are doubled."},{"title":"N-VM.8","body":" (+) Add, subtract, and multiply matrices of appropriate dimensions."},{"title":"N-VM.9","body":" (+) Understand that, unlike multiplication of numbers, matrix multiplication for square matrices is not a commutative operation, but still satisfies the associative and distributive properties."},{"title":"N-VM.10","body":" (+) Understand that the zero and identity matrices play a role in matrix addition and multiplication similar to the role of 0 and 1 in the real numbers. The determinant of a square matrix is nonzero if and only if the matrix has a multiplicative inverse."},{"title":"N-VM.11","body":" (+) Multiply a vector (regarded as a matrix with one column) by a matrix of suitable dimensions to produce another vector. Work with matrices as transformations of vectors."},{"title":"N-VM.12","body":" (+) Work with 2 &times; 2 matrices as a transformations of the plane, and interpret the absolute value of the determinant in terms of area."}]},"High School: Algebra":{"Seeing Structure in Expressions":[{"title":"A-SSE.1","body":" Interpret expressions that represent a quantity in terms of its context.<sup>★<\/sup>      <ul>          <li>Interpret parts of an expression, such as terms, factors, and coefficients.<\/li>          <li>Interpret complicated expressions by viewing one or more of their parts as a single entity. <i>For example, interpret P(1+r)<sup>n<\/sup> as the product of P and a factor not depending on P.<\/i><\/li>      <\/ul>      "},{"title":"A-SSE.2","body":" Use the structure of an expression to identify ways to rewrite it. <i>For example, see x<sup>4<\/sup> &ndash; y<sup>4<\/sup> as (x<sup>2<\/sup>)<sup>2<\/sup> &ndash; (y<sup>2<\/sup>)<sup>2<\/sup>, thus recognizing it as a difference of squares that can be factored as (x<sup>2<\/sup> &ndash; y<sup>2<\/sup>)(x<sup>2<\/sup> + y<sup>2<\/sup>).<\/i>"},{"title":"A-SSE.3","body":" Choose and produce an equivalent form of an expression to reveal and explain properties of the quantity represented by the expression.<sup>★<\/sup><br \/>      <ul>          <li>a. Factor a quadratic expression to reveal the zeros of the function it defines.<\/li>          <li>b. Complete the square in a quadratic expression to reveal the maximum or minimum value of the function it defines.<\/li>          <li>c. Use the properties of exponents to transform expressions for exponential functions. <i>For example the expression 1.15<sup>t<\/sup> can be rewritten as (1.15<sup>1\/12<\/sup>)<sup>12t<\/sup> &asymp; 1.012<sup>12t<\/sup> to reveal the approximate equivalent monthly interest rate if the annual rate is 15%.<\/i><\/li>      <\/ul>      "},{"title":"A-SSE.4","body":" Derive the formula for the sum of a finite geometric series (when the common ratio is not 1), and use the formula to solve problems. <i>For example, calculate mortgage payments.<\/i><sup>★<\/sup>"}],"Arithmetic with Polynomials & Rational Expressions":[{"title":"A-APR.1","body":" Understand that polynomials form a system analogous to the integers, namely, they are closed under the operations of addition, subtraction, and multiplication; add, subtract, and multiply polynomials."},{"title":"A-APR.2","body":" Know and apply the Remainder Theorem: For a polynomial <i>p<\/i>(<i>x<\/i>) and a number <i>a<\/i>, the remainder on division by <i>x &ndash; a<\/i> is <i>p<\/i>(<i>a<\/i>), so <i>p<\/i>(<i>a<\/i>) = 0 if and only if (<i>x &ndash; a<\/i>) is a factor of <i>p<\/i>(<i>x<\/i>)."},{"title":"A-APR.3","body":" Identify zeros of polynomials when suitable factorizations are available, and use the zeros to construct a rough graph of the function defined by the polynomial."},{"title":"A-APR.4","body":" Prove polynomial identities and use them to describe numerical relationships. <i>For example, the polynomial identity (x<sup>2<\/sup> + y<sup>2<\/sup>)<sup>2<\/sup> = (x<sup>2<\/sup> &ndash; y<sup>2<\/sup>)<sup>2<\/sup> + (2xy)<sup>2<\/sup> can be used to generate Pythagorean triples.<\/i>"},{"title":"A-APR.5","body":" (+) Know and apply the Binomial Theorem for the expansion of (<i>x<\/i> + <i>y<\/i>)<sup><i>n<\/i><\/sup> in powers of <i>x<\/i> and <i>y<\/i> for a positive integer <i>n<\/i>, where <i>x<\/i> and <i>y<\/i> are any numbers, with coefficients determined for example by Pascal&rsquo;s Triangle.<sup>1<\/sup>"},{"title":"A-APR.6","body":" Rewrite simple rational expressions in different forms; write <sup><i>a<\/i>(<i>x<\/i>)<\/sup>\/<sub><i>b<\/i>(<i>x<\/i>)<\/sub> in the form <i>q<\/i>(<i>x<\/i>) + <sup><i>r<\/i>(<i>x<\/i>)<\/sup>\/<sub><i>b<\/i>(<i>x<\/i>)<\/sub>, where <i>a<\/i>(<i>x<\/i>), <i>b<\/i>(<i>x<\/i>), <i>q<\/i>(<i>x<\/i>), and <i>r<\/i>(<i>x<\/i>) are polynomials with the degree of <i>r<\/i>(<i>x<\/i>) less than the degree of <i>b<\/i>(<i>x<\/i>), using inspection, long division, or, for the more complicated examples, a computer algebra system."},{"title":"A-APR.7","body":" (+) Understand that rational expressions form a system analogous to the rational numbers, closed under addition, subtraction, multiplication, and division by a nonzero rational expression; add, subtract, multiply, and divide rational expressions."}],"Creating Equations*":[{"title":"A-CED.1","body":" Create equations and inequalities in one variable and use them to solve problems. <i>Include equations arising from linear and quadratic functions, and simple rational and exponential functions. <\/i>"},{"title":"A-CED.2","body":" Create equations in two or more variables to represent relationships between quantities; graph equations on coordinate axes with labels and scales."},{"title":"A-CED.3","body":" Represent constraints by equations or inequalities, and by systems of equations and\/or inequalities, and interpret solutions as viable or nonviable options in a modeling context. <i>For example, represent inequalities describing nutritional and cost constraints on combinations of different foods.<\/i>"},{"title":"A-CED.4","body":" Rearrange formulas to highlight a quantity of interest, using the same reasoning as in solving equations. <i>For example, rearrange Ohm&rsquo;s law V = IR to highlight resistance R.<\/i>"}],"Reasoning with Equations & Inequalities":[{"title":"A-REI.1","body":" Explain each step in solving a simple equation as following from the equality of numbers asserted at the previous step, starting from the assumption that the original equation has a solution. Construct a viable argument to justify a solution method."},{"title":"A-REI.2","body":" Solve simple rational and radical equations in one variable, and give examples showing how extraneous solutions may arise."},{"title":"A-REI.3","body":" Solve linear equations and inequalities in one variable, including equations with coefficients represented by letters."},{"title":"A-REI.4","body":" Solve quadratic equations in one variable.<br \/>      <ul>          <li>Use the method of completing the square to transform any quadratic equation in <i>x<\/i> into an equation of the form (<i>x<\/i> &ndash; <i>p<\/i>)<sup>2<\/sup> = <i>q<\/i> that has the same solutions. Derive the quadratic formula from this form.<\/li>          <li>Solve quadratic equations by inspection (e.g., for <i>x<\/i><sup>2<\/sup> = 49), taking square roots, completing the square, the quadratic formula and factoring, as appropriate to the initial form of the equation. Recognize when the quadratic formula gives complex solutions and write them as <i>a<\/i> &plusmn; <i>bi<\/i> for real numbers <i>a<\/i> and <i>b<\/i>.<\/li>      <\/ul>      "},{"title":"A-REI.5","body":" Prove that, given a system of two equations in two variables, replacing one equation by the sum of that equation and a multiple of the other produces a system with the same solutions."},{"title":"A-REI.6","body":" Solve systems of linear equations exactly and approximately (e.g., with graphs), focusing on pairs of linear equations in two variables."},{"title":"A-REI.7","body":" Solve a simple system consisting of a linear equation and a quadratic equation in two variables algebraically and graphically. For example, find the points of intersection between the line <i>y<\/i> = &ndash;3<i>x<\/i> and the circle <i>x<\/i><sup>2<\/sup> + <i>y<\/i><sup>2<\/sup> = 3."},{"title":"A-REI.8","body":" (+) Represent a system of linear equations as a single matrix equation in a vector variable."},{"title":"A-REI.9","body":" (+) Find the inverse of a matrix if it exists and use it to solve systems of linear equations (using technology for matrices of dimension 3 &times; 3 or greater)."},{"title":"A-REI.10","body":" Understand that the graph of an equation in two variables is the set of all its solutions plotted in the coordinate plane, often forming a curve (which could be a line)."},{"title":"A-REI.11","body":" Explain why the <i>x<\/i>-coordinates of the points where the graphs of the equations <i>y<\/i> = <i>f<\/i>(<i>x<\/i>) and <i>y<\/i> = <i>g<\/i>(<i>x<\/i>) intersect are the solutions of the equation <i>f<\/i>(<i>x<\/i>) = <i>g<\/i>(<i>x<\/i>); find the solutions approximately, e.g., using technology to graph the functions, make tables of values, or find successive approximations. Include cases where <i>f<\/i>(<i>x<\/i>) and\/or <i>g<\/i>(<i>x<\/i>) are linear, polynomial, rational, absolute value, exponential, and logarithmic functions.<sup>★<\/sup>"},{"title":"A-REI.12","body":" Graph the solutions to a linear inequality in two variables as a half-plane (excluding the boundary in the case of a strict inequality), and graph the solution set to a system of linear inequalities in two variables as the intersection of the corresponding half-planes."}]},"High School: Functions":{"Interpreting Functions":[{"title":"F-IF.1","body":" Understand that a function from one set (called the domain) to another set (called the range) assigns to each element of the domain exactly one element of the range. If <i>f<\/i> is a function and <i>x<\/i> is an element of its domain, then <i>f<\/i>(<i>x<\/i>) denotes the output of <i>f<\/i> corresponding to the input <i>x<\/i>. The graph of <i>f<\/i> is the graph of the equation <i>y<\/i> = <i>f<\/i>(<i>x<\/i>)."},{"title":"F-IF.2","body":" Use function notation, evaluate functions for inputs in their domains, and interpret statements that use function notation in terms of a context."},{"title":"F-IF.3","body":" Recognize that sequences are functions, sometimes defined recursively, whose domain is a subset of the integers. <i>For example, the Fibonacci sequence is defined recursively by f(0) = f(1) = 1, f(n+1) = f(n) + f(n-1) for n &ge; 1.<\/i>"},{"title":"F-IF.4","body":" For a function that models a relationship between two quantities, interpret key features of graphs and tables in terms of the quantities, and sketch graphs showing key features given a verbal description of the relationship. <i>Key features include: intercepts; intervals where the function is increasing, decreasing, positive, or negative; relative maximums and minimums; symmetries; end behavior; and periodicity<\/i>.<sup>★<\/sup>"},{"title":"F-IF.5","body":" Relate the domain of a function to its graph and, where applicable, to the quantitative relationship it describes. <i>For example, if the function h(n) gives the number of person-hours it takes to assemble n engines in a factory, then the positive integers would be an appropriate domain for the function.<\/i><sup>★<\/sup>"},{"title":"F-IF.6","body":" Calculate and interpret the average rate of change of a function (presented symbolically or as a table) over a specified interval. Estimate the rate of change from a graph.<sup>★<\/sup>"},{"title":"F-IF.7","body":" Graph functions expressed symbolically and show key features of the graph, by hand in simple cases and using technology for more complicated cases.<sup>★<\/sup>      <ul>          <li>a. Graph linear and quadratic functions and show intercepts, maxima, and minima.<\/li>          <li>b. Graph square root, cube root, and piecewise-defined functions, including step functions and absolute value functions.<\/li>          <li>c. Graph polynomial functions, identifying zeros when suitable factorizations are available, and showing end behavior.<\/li>          <li>d. (+) Graph rational functions, identifying zeros and asymptotes when suitable factorizations are available, and showing end behavior.<\/li>          <li>e. Graph exponential and logarithmic functions, showing intercepts and end behavior, and trigonometric functions, showing period, midline, and amplitude.<\/li>      <\/ul>      "},{"title":"F-IF.8","body":" Write a function defined by an expression in different but equivalent forms to reveal and explain different properties of the function.      <ul>          <li>a. Use the process of factoring and completing the square in a quadratic function to show zeros, extreme values, and symmetry of the graph, and interpret these in terms of a context.<\/li>          <li>b. Use the properties of exponents to interpret expressions for exponential functions. For example, identify percent rate of change in functions such as y = (1.02)t, y = (0.97)t, y = (1.01)12t, y = (1.2)t\/10, and classify them as representing exponential growth or decay.<\/li>      <\/ul>      "},{"title":"F-IF.9","body":" Compare properties of two functions each represented in a different way (algebraically, graphically, numerically in tables, or by verbal descriptions). <i>For example, given a graph of one quadratic function and an algebraic expression for another, say which has the larger maximum.<\/i>"}],"Building Functions":[{"title":"F-BF.1","body":" Write a function that describes a relationship between two quantities.<sup>★<\/sup>      <ul>          <li>Determine an explicit expression, a recursive process, or steps for calculation from a context.<\/li>          <li>Combine standard function types using arithmetic operations. <i>For example, build a function that models the temperature of a cooling body by adding a constant function to a decaying exponential, and relate these functions to the model.<\/i><\/li>          <li>(+) Compose functions. <i>For example, if T(y) is the temperature in the atmosphere as a function of height, and h(t) is the height of a weather balloon as a function of time, then T(h(t)) is the temperature at the location of the weather balloon as a function of time. <\/i><\/li>      <\/ul>      "},{"title":"F-BF.2","body":" Write arithmetic and geometric sequences both recursively and with an explicit formula, use them to model situations, and translate between the two forms.<sup>★<\/sup>"},{"title":"F-BF.3","body":" Identify the effect on the graph of replacing <i>f<\/i>(<i>x<\/i>) by <i>f<\/i>(<i>x<\/i>) + <i>k<\/i>,<i> k<\/i> <i>f<\/i>(<i>x<\/i>), <i>f<\/i>(<i>kx<\/i>), and <i>f<\/i>(<i>x<\/i> + <i>k<\/i>) for specific values of <i>k<\/i> (both positive and negative); find the value of <i>k<\/i> given the graphs. Experiment with cases and illustrate an explanation of the effects on the graph using technology. Include recognizing even and odd functions from their graphs and algebraic expressions for them."},{"title":"F-BF.4","body":" Find inverse functions.      <ul>          <li>Solve an equation of the form f(x) = c for a simple function f that has an inverse and write an expression for the inverse. <i>For example, f(x) =2 x<sup>3<\/sup> or f(x) = (x+1)\/(x&ndash;1) for x &ne; 1.<\/i><\/li>          <li>(+) Verify by composition that one function is the inverse of another.<\/li>          <li>(+) Read values of an inverse function from a graph or a table, given that the function has an inverse.<\/li>          <li>(+) Produce an invertible function from a non-invertible function by restricting the domain.<\/li>      <\/ul>      "},{"title":"F-BF.5","body":" (+) Understand the inverse relationship between exponents and logarithms and use this relationship to solve problems involving logarithms and exponents."}],"Linear, Quadratic, & Exponential Models*":[{"title":"F-LE.1","body":" Distinguish between situations that can be modeled with linear functions and with exponential functions.      <ul>          <li>Prove that linear functions grow by equal differences over equal intervals, and that exponential functions grow by equal factors over equal intervals.<\/li>          <li>Recognize situations in which one quantity changes at a constant rate per unit interval relative to another.<\/li>          <li>Recognize situations in which a quantity grows or decays by a constant percent rate per unit interval relative to another.<\/li>      <\/ul>      "},{"title":"F-LE.2","body":" Construct linear and exponential functions, including arithmetic and geometric sequences, given a graph, a description of a relationship, or two input-output pairs (include reading these from a table)."},{"title":"F-LE.3","body":" Observe using graphs and tables that a quantity increasing exponentially eventually exceeds a quantity increasing linearly, quadratically, or (more generally) as a polynomial function."},{"title":"F-LE.4","body":" For exponential models, express as a logarithm the solution to <i>ab<\/i><i><sup>ct<\/sup><\/i> = <i>d<\/i> where <i>a<\/i>, <i>c<\/i>, and <i>d<\/i> are numbers and the base <i>b<\/i> is 2, 10, or <i>e<\/i>; evaluate the logarithm using technology."},{"title":"F-LE.5","body":" Interpret the parameters in a linear or exponential function in terms of a context."}],"Trigonometric Functions":[{"title":"F-TF.1","body":" Understand radian measure of an angle as the length of the arc on the unit circle subtended by the angle."},{"title":"F-TF.2","body":" Explain how the unit circle in the coordinate plane enables the extension of trigonometric functions to all real numbers, interpreted as radian measures of angles traversed counterclockwise around the unit circle."},{"title":"F-TF.3","body":" (+) Use special triangles to determine geometrically the values of sine, cosine, tangent for &pi;\/3, &pi;\/4 and &pi;\/6, and use the unit circle to express the values of sine, cosines, and tangent for <i>x<\/i>, &pi; + <i>x<\/i>, and 2&pi; &ndash; <i>x<\/i> in terms of their values for <i>x<\/i>, where <i>x<\/i> is any real number."},{"title":"F-TF.4","body":" (+) Use the unit circle to explain symmetry (odd and even) and periodicity of trigonometric functions."},{"title":"F-TF.5","body":" Choose trigonometric functions to model periodic phenomena with specified amplitude, frequency, and midline.<sup>★<\/sup>"},{"title":"F-TF.6","body":" (+) Understand that restricting a trigonometric function to a domain on which it is always increasing or always decreasing allows its inverse to be constructed."},{"title":"F-TF.7","body":" (+) Use inverse functions to solve trigonometric equations that arise in modeling contexts; evaluate the solutions using technology, and interpret them in terms of the context.<sup>★<\/sup>"},{"title":"F-TF.8","body":" Prove the Pythagorean identity sin<sup>2<\/sup>(&theta;) + cos<sup>2<\/sup>(&theta;) = 1 and use it to find  sin(&theta;), cos(&theta;), or tan(&theta;) given sin(&theta;), cos(&theta;), or tan(&theta;) and the  quadrant of the angle."},{"title":"F-TF.9","body":" (+) Prove the addition and subtraction formulas for sine, cosine, and tangent and use them to solve problems."}]},"High School: Geometry":{"Congruence":[{"title":"G.CO.1","body":" Know precise definitions of angle, circle, perpendicular line, parallel line, and line segment, based on the undefined notions of point, line, distance along a line, and distance around a circular arc."},{"title":"G-CO.2","body":" Represent transformations in the plane using, e.g., transparencies and geometry software; describe transformations as functions that take points in the plane as inputs and give other points as outputs. Compare transformations that preserve distance and angle to those that do not (e.g., translation versus horizontal stretch)."},{"title":"G-CO.3","body":" Given a rectangle, parallelogram, trapezoid, or regular polygon, describe the rotations and reflections that carry it onto itself."},{"title":"G-CO.4","body":" Develop definitions of rotations, reflections, and translations in terms of angles, circles, perpendicular lines, parallel lines, and line segments."},{"title":"G-CO.5","body":" Given a geometric figure and a rotation, reflection, or translation, draw the transformed figure using, e.g., graph paper, tracing paper, or geometry software. Specify a sequence of transformations that will carry a given figure onto another."},{"title":"G-CO.6","body":" Use geometric descriptions of rigid motions to transform figures and to predict the effect of a given rigid motion on a given figure; given two figures, use the definition of congruence in terms of rigid motions to decide if they are congruent."},{"title":"G-CO.7","body":" Use the definition of congruence in terms of rigid motions to show that two triangles are congruent if and only if corresponding pairs of sides and corresponding pairs of angles are congruent."},{"title":"G-CO.8","body":" Explain how the criteria for triangle congruence (ASA, SAS, and SSS) follow from the definition of congruence in terms of rigid motions."},{"title":"G-CO.9","body":" Prove theorems about lines and angles. <i>Theorems include: vertical angles are congruent; when a transversal crosses parallel lines, alternate interior angles are congruent and corresponding angles are congruent; points on a perpendicular bisector of a line segment are exactly those equidistant from the segment&rsquo;s endpoints.<\/i>"},{"title":"G-CO.10","body":" Prove theorems about triangles. <i>Theorems include: measures of interior angles of a triangle sum to 180&deg;; base angles of isosceles triangles are congruent; the segment joining midpoints of two sides of a triangle is parallel to the third side and half the length; the medians of a triangle meet at a point.<\/i>"},{"title":"G-CO.11","body":" Prove theorems about parallelograms. <i>Theorems include: opposite sides are congruent, opposite angles are congruent, the diagonals of a parallelogram bisect each other, and conversely, rectangles are parallelograms with congruent diagonals.<\/i>"},{"title":"G-CO.12","body":" Make formal geometric constructions with a variety of tools and methods (compass and straightedge, string, reflective devices, paper folding, dynamic geometric software, etc.). <i>Copying a segment; copying an angle; bisecting a segment; bisecting an angle; constructing perpendicular lines, including the perpendicular bisector of a line segment; and constructing a line parallel to a given line through a point not on the line.<\/i>"},{"title":"G-CO.13","body":" Construct an equilateral triangle, a square, and a regular hexagon inscribed in a circle."}],"Similarity, Right Triangles, & Trigonometry":[{"title":"G-SRT.1","body":" Verify experimentally the properties of dilations given by a center and a scale factor:<br \/>      <ul>          <li>A dilation takes a line not passing through the center of the dilation to a parallel line, and leaves a line passing through the center unchanged.<\/li>          <li>The dilation of a line segment is longer or shorter in the ratio given by the scale factor.<\/li>      <\/ul>      "},{"title":"G-SRT.2","body":" Given two figures, use the definition of similarity in terms of similarity transformations to decide if they are similar; explain using similarity transformations the meaning of similarity for triangles as the equality of all corresponding pairs of angles and the proportionality of all corresponding pairs of sides."},{"title":"G-SRT.3","body":" Use the properties of similarity transformations to establish the AA criterion for two triangles to be similar."},{"title":"G-SRT.4","body":" Prove theorems about triangles. <i>Theorems include: a line parallel to one side of a triangle divides the other two proportionally, and conversely; the Pythagorean Theorem proved using triangle similarity.<\/i>"},{"title":"G-SRT.5","body":" Use congruence and similarity criteria for triangles to solve problems and to prove relationships in geometric figures."},{"title":"G-SRT.6","body":" Understand that by similarity, side ratios in right triangles are properties of the angles in the triangle, leading to definitions of trigonometric ratios for acute angles."},{"title":"G-SRT.7","body":" Explain and use the relationship between the sine and cosine of complementary angles."},{"title":"G-SRT.8","body":" Use trigonometric ratios and the Pythagorean Theorem to solve right triangles in applied problems.<sup>★<\/sup>"},{"title":"G-SRT.9","body":" (+) Derive the formula <i>A<\/i> = 1\/2 <i>ab<\/i> sin(C) for the area of a triangle by drawing an auxiliary line from a vertex perpendicular to the opposite side."},{"title":"G-SRT.10","body":" (+) Prove the Laws of Sines and Cosines and use them to solve problems."},{"title":"G-SRT.11","body":" (+) Understand and apply the Law of Sines and the Law of Cosines to find unknown measurements in right and non-right triangles (e.g., surveying problems, resultant forces)."}],"Circles":[{"title":"G-C.1","body":" Prove that all circles are similar."},{"title":"G-C.2","body":" Identify and describe relationships among inscribed angles, radii, and chords. <i>Include the relationship between central, inscribed, and circumscribed angles; inscribed angles on a diameter are right angles; the radius of a circle is perpendicular to the tangent where the radius intersects the circle.<\/i>"},{"title":"G-C.3","body":" Construct the inscribed and circumscribed circles of a triangle, and prove properties of angles for a quadrilateral inscribed in a circle."},{"title":"G-C.4","body":" (+) Construct a tangent line from a point outside a given circle to the circle."},{"title":"G-C.5","body":" Derive using similarity the fact that the length of the arc intercepted by an angle is proportional to the radius, and define the radian measure of the angle as the constant of proportionality; derive the formula for the area of a sector."}],"Expressing Geometric Properties with Equations":[{"title":"G-GPE.1","body":" Derive the equation of a circle of given center and radius using the Pythagorean Theorem; complete the square to find the center and radius of a circle given by an equation."},{"title":"G-GPE.2","body":" Derive the equation of a parabola given a focus and directrix."},{"title":"G-GPE.3","body":" (+) Derive the equations of ellipses and hyperbolas given the foci, using the fact that the sum or difference of distances from the foci is constant."},{"title":"G-GPE.4","body":" Use coordinates to prove simple geometric theorems algebraically. <i>For example, prove or disprove that a figure defined by four given points in the coordinate plane is a rectangle; prove or disprove that the point (1, &radic;3) lies on the circle centered at the origin and containing the point (0, 2).<\/i>"},{"title":"G-GPE.5","body":" Prove the slope criteria for parallel and perpendicular lines and use them to solve geometric problems (e.g., find the equation of a line parallel or perpendicular to a given line that passes through a given point)."},{"title":"G-GPE.6","body":" Find the point on a directed line segment between two given points that partitions the segment in a given ratio."},{"title":"G-GPE.7","body":" Use coordinates to compute perimeters of polygons and areas of triangles and rectangles, e.g., using the distance formula.<sup>★<\/sup>"}],"Geometric Measurement & Dimension":[{"title":"G-GMD.1","body":" Give an informal argument for the formulas for the circumference of a circle, area of a circle, volume of a cylinder, pyramid, and cone. <i>Use dissection arguments, Cavalieri&rsquo;s principle, and informal limit arguments.<\/i>"},{"title":"G-GMD.2","body":" (+) Give an informal argument using Cavalieri&rsquo;s principle for the formulas for the volume of a sphere and other solid figures."},{"title":"G-GMD.3","body":" Use volume formulas for cylinders, pyramids, cones, and spheres to solve problems.<sup>★<\/sup>"},{"title":"G-GMD.4","body":" Identify the shapes of two-dimensional cross-sections of three-dimensional objects, and identify three-dimensional objects generated by rotations of two-dimensional objects."}],"Modeling with Geometry":[{"title":"G-MG.1","body":" Use geometric shapes, their measures, and their properties to describe objects (e.g., modeling a tree trunk or a human torso as a cylinder).<sup>★<\/sup>"},{"title":"G-MG.2","body":" Apply concepts of density based on area and volume in modeling situations (e.g., persons per square mile, BTUs per cubic foot).<sup>★<\/sup>"},{"title":"G-MG.3","body":" Apply geometric methods to solve design problems (e.g., designing an object or structure to satisfy physical constraints or minimize cost; working with typographic grid systems based on ratios).<sup>★<\/sup>"}]},"High School: Statistics & Probability":{"Interpreting Categorical & Quantitative Data":[{"title":"S-ID.1","body":" Represent data with plots on the real number line (dot plots, histograms, and box plots)."},{"title":"S-ID.2","body":" Use statistics appropriate to the shape of the data distribution to compare center (median, mean) and spread (interquartile range, standard deviation) of two or more different data sets."},{"title":"S-ID.3","body":" Interpret differences in shape, center, and spread in the context of the data sets, accounting for possible effects of extreme data points (outliers)."},{"title":"S-ID.4","body":" Use the mean and standard deviation of a data set to fit it to a normal distribution and to estimate population percentages. Recognize that there are data sets for which such a procedure is not appropriate. Use calculators, spreadsheets, and tables to estimate areas under the normal curve."},{"title":"S-ID.5","body":" Summarize categorical data for two categories in two-way frequency tables. Interpret relative frequencies in the context of the data (including joint, marginal, and conditional relative frequencies). Recognize possible associations and trends in the data."},{"title":"S-ID.6","body":" Represent data on two quantitative variables on a scatter plot, and describe how the variables are related.      <ul>          <li>a. Fit a function to the data; use functions fitted to data to solve problems in the context of the data. Use given functions or choose a function suggested by the context. Emphasize linear, quadratic, and exponential models.<\/li>          <li>b. Informally assess the fit of a function by plotting and analyzing residuals.<\/li>          <li>c. Fit a linear function for a scatter plot that suggests a linear association.<\/li>      <\/ul>      "},{"title":"S-ID.7","body":" Interpret the slope (rate of change) and the intercept (constant term) of a linear model in the context of the data."},{"title":"S-ID.8","body":" Compute (using technology) and interpret the correlation coefficient of a linear fit."},{"title":"S-ID.9","body":" Distinguish between correlation and causation."}],"Making Inferences & Justifying Conclusions":[{"title":"S-IC.1","body":" Understand statistics as a process for making inferences about population parameters based on a random sample from that population."},{"title":"S-IC.2","body":" Decide if a specified model is consistent with results from a given data-generating process, e.g., using simulation. <i>For example, a model says a spinning coin falls heads up with probability 0.5. Would a result of 5 tails in a row cause you to question the model?<\/i>"},{"title":"S-IC.3","body":" Recognize the purposes of and differences among sample surveys, experiments, and observational studies; explain how randomization relates to each."},{"title":"S-IC.4","body":" Use data from a sample survey to estimate a population mean or proportion; develop a margin of error through the use of simulation models for random sampling."},{"title":"S-IC.5","body":" Use data from a randomized experiment to compare two treatments; use simulations to decide if differences between parameters are significant."},{"title":"S-IC.6","body":" Evaluate reports based on data."}],"Conditional Probability & the Rules of Probability":[{"title":"S-CP.1","body":" Describe events as subsets of a sample space (the set of outcomes) using characteristics (or categories) of the outcomes, or as unions, intersections, or complements of other events (&ldquo;or,&rdquo; &ldquo;and,&rdquo; &ldquo;not&rdquo;)."},{"title":"S-CP.2","body":" Understand that two events <i>A<\/i> and <i>B<\/i> are independent if the probability of <i>A<\/i> and <i>B<\/i> occurring together is the product of their probabilities, and use this characterization to determine if they are independent."},{"title":"S-CP.3","body":" Understand the conditional probability of <i>A<\/i> given <i>B<\/i> as <i>P<\/i>(<i>A<\/i> and <i>B<\/i>)\/<i>P<\/i>(<i>B<\/i>), and interpret independence of <i>A<\/i> and <i>B<\/i> as saying that the conditional probability of <i>A<\/i> given <i>B<\/i> is the same as the probability of <i>A<\/i>, and the conditional probability of <i>B<\/i> given <i>A<\/i> is the same as the probability of <i>B<\/i>."},{"title":"S-CP.4","body":" Construct and interpret two-way frequency tables of data when two categories are associated with each object being classified. Use the two-way table as a sample space to decide if events are independent and to approximate conditional probabilities. <i>For example, collect data from a random sample of students in your school on their favorite subject among math, science, and English. Estimate the probability that a randomly selected student from your school will favor science given that the student is in tenth grade. Do the same for other subjects and compare the results.<\/i>"},{"title":"S-CP.5","body":" Recognize and explain the concepts of conditional probability and independence in everyday language and everyday situations. <i>For example, compare the chance of having lung cancer if you are a smoker with the chance of being a smoker if you have lung cancer.<\/i>"},{"title":"S-CP.6","body":" Find the conditional probability of <i>A<\/i> given <i>B<\/i> as the fraction of <i>B<\/i>&rsquo;s outcomes that also belong to <i>A<\/i>, and interpret the answer in terms of the model."},{"title":"S-CP.7","body":" Apply the Addition Rule, P(A or B) = P(A) + P(B) &ndash; P(A and B), and interpret the answer in terms of the model."},{"title":"S-CP.8","body":" (+) Apply the general Multiplication Rule in a uniform probability model, P(A and B) = P(A)P(B|A) = P(B)P(A|B), and interpret the answer in terms of the model."},{"title":"S-CP.9","body":" (+) Use permutations and combinations to compute probabilities of compound events and solve problems."}],"Using Probability to Make Decisions":[{"title":"S-MD.1","body":" (+) Define a random variable for a quantity of interest by assigning a numerical value to each event in a sample space; graph the corresponding probability distribution using the same graphical displays as for data distributions."},{"title":"S-MD.2","body":" (+) Calculate the expected value of a random variable; interpret it as the mean of the probability distribution."},{"title":"S-MD.3","body":" (+) Develop a probability distribution for a random variable defined for a sample space in which theoretical probabilities can be calculated; find the expected value. <i>For example, find the theoretical probability distribution for the number of correct answers obtained by guessing on all five questions of a multiple-choice test where each question has four choices, and find the expected grade under various grading schemes.<\/i>"},{"title":"S-MD.4","body":" (+) Develop a probability distribution for a random variable defined for a sample space in which probabilities are assigned empirically; find the expected value. <i>For example, find a current data distribution on the number of TV sets per household in the United States, and calculate the expected number of sets per household. How many TV sets would you expect to find in 100 randomly selected households?<\/i>"},{"title":"S-MD.5","body":" (+) Weigh the possible outcomes of a decision by assigning probabilities to payoff values and finding expected values.      <ul>          <li>a. Find the expected payoff for a game of chance. <i>For example, find the expected winnings from a state lottery ticket or a game at a fast-food restaurant.<\/i><\/li>          <li>b. Evaluate and compare strategies on the basis of expected values. <i>For example, compare a high-deductible versus a low-deductible automobile insurance policy using various, but reasonable, chances of having a minor or a major accident.<\/i><\/li>      <\/ul>      "},{"title":"S-MD.6","body":" (+) Use probabilities to make fair decisions (e.g., drawing by lots, using a random number generator)."},{"title":"S-MD.7","body":" (+) Analyze decisions and strategies using probability concepts (e.g., product testing, medical testing, pulling a hockey goalie at the end of a game)."}]}}}